[139647] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_OBJ_TYPE_SW_ICM' val=8
	'MLX5_OBJ_TYPE_HEADER_MODIFY_ARGUMENT' val=35
[139648] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=199
	'MLX5_CMD_OP_QUERY_HCA_CAP' val=256
	'MLX5_CMD_OP_QUERY_ADAPTER' val=257
	'MLX5_CMD_OP_INIT_HCA' val=258
	'MLX5_CMD_OP_TEARDOWN_HCA' val=259
	'MLX5_CMD_OP_ENABLE_HCA' val=260
	'MLX5_CMD_OP_DISABLE_HCA' val=261
	'MLX5_CMD_OP_QUERY_PAGES' val=263
	'MLX5_CMD_OP_MANAGE_PAGES' val=264
	'MLX5_CMD_OP_SET_HCA_CAP' val=265
	'MLX5_CMD_OP_QUERY_ISSI' val=266
	'MLX5_CMD_OP_SET_ISSI' val=267
	'MLX5_CMD_OP_SET_DRIVER_VERSION' val=269
	'MLX5_CMD_OP_QUERY_SF_PARTITION' val=273
	'MLX5_CMD_OP_ALLOC_SF' val=275
	'MLX5_CMD_OP_DEALLOC_SF' val=276
	'MLX5_CMD_OP_SUSPEND_VHCA' val=277
	'MLX5_CMD_OP_RESUME_VHCA' val=278
	'MLX5_CMD_OP_QUERY_VHCA_MIGRATION_STATE' val=279
	'MLX5_CMD_OP_SAVE_VHCA_STATE' val=280
	'MLX5_CMD_OP_LOAD_VHCA_STATE' val=281
	'MLX5_CMD_OP_CREATE_MKEY' val=512
	'MLX5_CMD_OP_QUERY_MKEY' val=513
	'MLX5_CMD_OP_DESTROY_MKEY' val=514
	'MLX5_CMD_OP_QUERY_SPECIAL_CONTEXTS' val=515
	'MLX5_CMD_OP_PAGE_FAULT_RESUME' val=516
	'MLX5_CMD_OP_ALLOC_MEMIC' val=517
	'MLX5_CMD_OP_DEALLOC_MEMIC' val=518
	'MLX5_CMD_OP_MODIFY_MEMIC' val=519
	'MLX5_CMD_OP_CREATE_EQ' val=769
	'MLX5_CMD_OP_DESTROY_EQ' val=770
	'MLX5_CMD_OP_QUERY_EQ' val=771
	'MLX5_CMD_OP_GEN_EQE' val=772
	'MLX5_CMD_OP_CREATE_CQ' val=1024
	'MLX5_CMD_OP_DESTROY_CQ' val=1025
	'MLX5_CMD_OP_QUERY_CQ' val=1026
	'MLX5_CMD_OP_MODIFY_CQ' val=1027

	'MLX5_CMD_OP_CREATE_XRC_SRQ' val=1797
	'MLX5_CMD_OP_DESTROY_XRC_SRQ' val=1798
	'MLX5_CMD_OP_QUERY_XRC_SRQ' val=1799
	'MLX5_CMD_OP_ARM_XRC_SRQ' val=1800
	'MLX5_CMD_OP_CREATE_DCT' val=1808
	'MLX5_CMD_OP_DESTROY_DCT' val=1809
	'MLX5_CMD_OP_DRAIN_DCT' val=1810
	'MLX5_CMD_OP_QUERY_DCT' val=1811
	'MLX5_CMD_OP_ARM_DCT_FOR_KEY_VIOLATION' val=1812
	'MLX5_CMD_OP_CREATE_XRQ' val=1815
	'MLX5_CMD_OP_DESTROY_XRQ' val=1816
	'MLX5_CMD_OP_QUERY_XRQ' val=1817
	'MLX5_CMD_OP_ARM_XRQ' val=1818
	'MLX5_CMD_OP_QUERY_XRQ_DC_PARAMS_ENTRY' val=1829
	'MLX5_CMD_OP_SET_XRQ_DC_PARAMS_ENTRY' val=1830
	'MLX5_CMD_OP_QUERY_XRQ_ERROR_PARAMS' val=1831
	'MLX5_CMD_OP_RELEASE_XRQ_ERROR' val=1833
	'MLX5_CMD_OP_MODIFY_XRQ' val=1834
	'MLX5_CMD_OP_QUERY_ESW_FUNCTIONS' val=1856
	'MLX5_CMD_OP_QUERY_VPORT_STATE' val=1872
	'MLX5_CMD_OP_MODIFY_VPORT_STATE' val=1873
	'MLX5_CMD_OP_QUERY_ESW_VPORT_CONTEXT' val=1874
	'MLX5_CMD_OP_MODIFY_ESW_VPORT_CONTEXT' val=1875
	'MLX5_CMD_OP_QUERY_NIC_VPORT_CONTEXT' val=1876
	'MLX5_CMD_OP_MODIFY_NIC_VPORT_CONTEXT' val=1877
	'MLX5_CMD_OP_QUERY_ROCE_ADDRESS' val=1888
	'MLX5_CMD_OP_SET_ROCE_ADDRESS' val=1889
	'MLX5_CMD_OP_QUERY_HCA_VPORT_CONTEXT' val=1890
	'MLX5_CMD_OP_MODIFY_HCA_VPORT_CONTEXT' val=1891
	'MLX5_CMD_OP_QUERY_HCA_VPORT_GID' val=1892
	'MLX5_CMD_OP_QUERY_HCA_VPORT_PKEY' val=1893
	'MLX5_CMD_OP_QUERY_VNIC_ENV' val=1903
	'MLX5_CMD_OP_QUERY_VPORT_COUNTER' val=1904
	'MLX5_CMD_OP_ALLOC_Q_COUNTER' val=1905
	'MLX5_CMD_OP_DEALLOC_Q_COUNTER' val=1906
	'MLX5_CMD_OP_QUERY_Q_COUNTER' val=1907
	'MLX5_CMD_OP_SET_MONITOR_COUNTER' val=1908
	'MLX5_CMD_OP_ARM_MONITOR_COUNTER' val=1909
	'MLX5_CMD_OP_SET_PP_RATE_LIMIT' val=1920
	'MLX5_CMD_OP_QUERY_RATE_LIMIT' val=1921
	'MLX5_CMD_OP_CREATE_SCHEDULING_ELEMENT' val=1922
	'MLX5_CMD_OP_DESTROY_SCHEDULING_ELEMENT' val=1923
	'MLX5_CMD_OP_QUERY_SCHEDULING_ELEMENT' val=1924
	'MLX5_CMD_OP_MODIFY_SCHEDULING_ELEMENT' val=1925
	'MLX5_CMD_OP_CREATE_QOS_PARA_VPORT' val=1926
	'MLX5_CMD_OP_DESTROY_QOS_PARA_VPORT' val=1927
	'MLX5_CMD_OP_ALLOC_PD' val=2048
	'MLX5_CMD_OP_DEALLOC_PD' val=2049
	'MLX5_CMD_OP_ALLOC_UAR' val=2050
	'MLX5_CMD_OP_DEALLOC_UAR' val=2051
	'MLX5_CMD_OP_CONFIG_INT_MODERATION' val=2052
	'MLX5_CMD_OP_ACCESS_REG' val=2053
	'MLX5_CMD_OP_ATTACH_TO_MCG' val=2054
	'MLX5_CMD_OP_DETACH_FROM_MCG' val=2055
	'MLX5_CMD_OP_GET_DROPPED_PACKET_LOG' val=2058
	'MLX5_CMD_OP_MAD_IFC' val=1293
	'MLX5_CMD_OP_QUERY_MAD_DEMUX' val=2059
	'MLX5_CMD_OP_SET_MAD_DEMUX' val=2060
	'MLX5_CMD_OP_NOP' val=2061
	'MLX5_CMD_OP_ALLOC_XRCD' val=2062
	'MLX5_CMD_OP_DEALLOC_XRCD' val=2063
	'MLX5_CMD_OP_ALLOC_TRANSPORT_DOMAIN' val=2070
	'MLX5_CMD_OP_DEALLOC_TRANSPORT_DOMAIN' val=2071
	'MLX5_CMD_OP_QUERY_CONG_STATUS' val=2082
	'MLX5_CMD_OP_MODIFY_CONG_STATUS' val=2083
	'MLX5_CMD_OP_QUERY_CONG_PARAMS' val=2084
	'MLX5_CMD_OP_MODIFY_CONG_PARAMS' val=2085
	'MLX5_CMD_OP_QUERY_CONG_STATISTICS' val=2086
	'MLX5_CMD_OP_ADD_VXLAN_UDP_DPORT' val=2087
	'MLX5_CMD_OP_DELETE_VXLAN_UDP_DPORT' val=2088
	'MLX5_CMD_OP_SET_L2_TABLE_ENTRY' val=2089
	'MLX5_CMD_OP_QUERY_L2_TABLE_ENTRY' val=2090
	'MLX5_CMD_OP_DELETE_L2_TABLE_ENTRY' val=2091
	'MLX5_CMD_OP_SET_WOL_ROL' val=2096
	'MLX5_CMD_OP_QUERY_WOL_ROL' val=2097
	'MLX5_CMD_OP_CREATE_LAG' val=2112
	'MLX5_CMD_OP_MODIFY_LAG' val=2113
	'MLX5_CMD_OP_QUERY_LAG' val=2114
	'MLX5_CMD_OP_DESTROY_LAG' val=2115
	'MLX5_CMD_OP_CREATE_VPORT_LAG' val=2116
	'MLX5_CMD_OP_DESTROY_VPORT_LAG' val=2117
	'MLX5_CMD_OP_CREATE_TIR' val=2304
	'MLX5_CMD_OP_MODIFY_TIR' val=2305
	'MLX5_CMD_OP_DESTROY_TIR' val=2306
	'MLX5_CMD_OP_QUERY_TIR' val=2307
	'MLX5_CMD_OP_CREATE_SQ' val=2308
	'MLX5_CMD_OP_MODIFY_SQ' val=2309
	'MLX5_CMD_OP_DESTROY_SQ' val=2310
	'MLX5_CMD_OP_QUERY_SQ' val=2311
	'MLX5_CMD_OP_CREATE_RQ' val=2312
	'MLX5_CMD_OP_MODIFY_RQ' val=2313
	'MLX5_CMD_OP_SET_DELAY_DROP_PARAMS' val=2320
	'MLX5_CMD_OP_DESTROY_RQ' val=2314
	'MLX5_CMD_OP_QUERY_RQ' val=2315
	'MLX5_CMD_OP_CREATE_RMP' val=2316
	'MLX5_CMD_OP_MODIFY_RMP' val=2317
	'MLX5_CMD_OP_DESTROY_RMP' val=2318
	'MLX5_CMD_OP_QUERY_RMP' val=2319
	'MLX5_CMD_OP_CREATE_TIS' val=2322
	'MLX5_CMD_OP_MODIFY_TIS' val=2323
	'MLX5_CMD_OP_DESTROY_TIS' val=2324
	'MLX5_CMD_OP_QUERY_TIS' val=2325
	'MLX5_CMD_OP_CREATE_RQT' val=2326
	'MLX5_CMD_OP_MODIFY_RQT' val=2327
	'MLX5_CMD_OP_DESTROY_RQT' val=2328
	'MLX5_CMD_OP_QUERY_RQT' val=2329
	'MLX5_CMD_OP_SET_FLOW_TABLE_ROOT' val=2351
	'MLX5_CMD_OP_CREATE_FLOW_TABLE' val=2352
	'MLX5_CMD_OP_DESTROY_FLOW_TABLE' val=2353
	'MLX5_CMD_OP_QUERY_FLOW_TABLE' val=2354
	'MLX5_CMD_OP_CREATE_FLOW_GROUP' val=2355
	'MLX5_CMD_OP_DESTROY_FLOW_GROUP' val=2356
	'MLX5_CMD_OP_QUERY_FLOW_GROUP' val=2357
	'MLX5_CMD_OP_SET_FLOW_TABLE_ENTRY' val=2358
	'MLX5_CMD_OP_QUERY_FLOW_TABLE_ENTRY' val=2359
	'MLX5_CMD_OP_DELETE_FLOW_TABLE_ENTRY' val=2360
	'MLX5_CMD_OP_ALLOC_FLOW_COUNTER' val=2361
	'MLX5_CMD_OP_DEALLOC_FLOW_COUNTER' val=2362
	'MLX5_CMD_OP_QUERY_FLOW_COUNTER' val=2363
	'MLX5_CMD_OP_MODIFY_FLOW_TABLE' val=2364
	'MLX5_CMD_OP_ALLOC_PACKET_REFORMAT_CONTEXT' val=2365
	'MLX5_CMD_OP_DEALLOC_PACKET_REFORMAT_CONTEXT' val=2366
	'MLX5_CMD_OP_QUERY_PACKET_REFORMAT_CONTEXT' val=2367
	'MLX5_CMD_OP_ALLOC_MODIFY_HEADER_CONTEXT' val=2368
	'MLX5_CMD_OP_DEALLOC_MODIFY_HEADER_CONTEXT' val=2369
	'MLX5_CMD_OP_QUERY_MODIFY_HEADER_CONTEXT' val=2370
	'MLX5_CMD_OP_FPGA_CREATE_QP' val=2400
	'MLX5_CMD_OP_FPGA_MODIFY_QP' val=2401
	'MLX5_CMD_OP_FPGA_QUERY_QP' val=2402
	'MLX5_CMD_OP_FPGA_DESTROY_QP' val=2403
	'MLX5_CMD_OP_FPGA_QUERY_QP_COUNTERS' val=2404
	'MLX5_CMD_OP_CREATE_GENERAL_OBJECT' val=2560
	'MLX5_CMD_OP_MODIFY_GENERAL_OBJECT' val=2561
	'MLX5_CMD_OP_QUERY_GENERAL_OBJECT' val=2562
	'MLX5_CMD_OP_DESTROY_GENERAL_OBJECT' val=2563
	'MLX5_CMD_OP_CREATE_UCTX' val=2564
	'MLX5_CMD_OP_DESTROY_UCTX' val=2566
	'MLX5_CMD_OP_CREATE_UMEM' val=2568
	'MLX5_CMD_OP_DESTROY_UMEM' val=2570
	'MLX5_CMD_OP_SYNC_STEERING' val=2816
	'MLX5_CMD_OP_QUERY_VHCA_STATE' val=2829
	'MLX5_CMD_OP_MODIFY_VHCA_STATE' val=2830
	'MLX5_CMD_OP_SYNC_CRYPTO' val=2834
	'MLX5_CMD_OP_ALLOW_OTHER_VHCA_ACCESS' val=2838
	'MLX5_CMD_OP_MAX' val=2839
[139649] STRUCT 'mlx5_ifc_dealloc_pd_in_bits' size=128 vlen=7
	'opcode' type_id=474 bits_offset=0
	'uid' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=7469 bits_offset=512
	'pd' type_id=9799 bits_offset=576
	'reserved_at_60' type_id=3834 bits_offset=768
[139650] STRUCT 'mlx5_ifc_alloc_pd_out_bits' size=128 vlen=6
	'status' type_id=7469 bits_offset=0
	'reserved_at_8' type_id=9799 bits_offset=64
	'syndrome' type_id=3834 bits_offset=256
	'reserved_at_40' type_id=7469 bits_offset=512
	'pd' type_id=9799 bits_offset=576
	'reserved_at_60' type_id=3834 bits_offset=768
[139651] STRUCT 'mlx5_ifc_alloc_pd_in_bits' size=128 vlen=5
	'opcode' type_id=474 bits_offset=0
	'uid' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=1843 bits_offset=512
[139652] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=5
	'MLX5_MAX_COMMANDS' val=32
	'MLX5_CMD_DATA_BLOCK_SIZE' val=512
	'MLX5_PCI_CMD_XPORT' val=7
	'MLX5_MKEY_BSF_OCTO_SIZE' val=4
	'MLX5_MAX_PSVS' val=4
[139653] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_INLINE_SEG' val=2147483648
[139654] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_ADAPTER_PAGE_SHIFT' val=12
	'MLX5_ADAPTER_PAGE_SIZE' val=4096
[139655] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=4
	'MLX5_EVENT_QUEUE_TYPE_QP' val=0
	'MLX5_EVENT_QUEUE_TYPE_RQ' val=1
	'MLX5_EVENT_QUEUE_TYPE_SQ' val=2
	'MLX5_EVENT_QUEUE_TYPE_DCT' val=6
[139656] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_ROCE_VERSION_1' val=0
	'MLX5_ROCE_VERSION_2' val=2
[139657] STRUCT 'mlx5_cmd_layout' size=64 vlen=12
	'type' type_id=19 bits_offset=0
	'rsvd0' type_id=401 bits_offset=8
	'inlen' type_id=1851 bits_offset=32
	'in_ptr' type_id=6867 bits_offset=64
	'in' type_id=1903 bits_offset=128
	'out' type_id=1903 bits_offset=256
	'out_ptr' type_id=6867 bits_offset=384
	'outlen' type_id=1851 bits_offset=448
	'token' type_id=19 bits_offset=480
	'sig' type_id=19 bits_offset=488
	'rsvd1' type_id=19 bits_offset=496
	'status_own' type_id=19 bits_offset=504
[139658] STRUCT 'health_buffer' size=64 vlen=13
	'assert_var' type_id=13422 bits_offset=0
	'rsvd0' type_id=12097 bits_offset=192
	'assert_exit_ptr' type_id=1851 bits_offset=256
	'assert_callra' type_id=1851 bits_offset=288
	'rsvd1' type_id=24222 bits_offset=320
	'time' type_id=1851 bits_offset=352
	'fw_ver' type_id=1851 bits_offset=384
	'hw_id' type_id=1851 bits_offset=416
	'rfr_severity' type_id=19 bits_offset=448
	'rsvd2' type_id=401 bits_offset=456
	'irisc_index' type_id=19 bits_offset=480
	'synd' type_id=19 bits_offset=488
	'ext_synd' type_id=1850 bits_offset=496
[139659] STRUCT 'mlx5_init_seg' size=8208 vlen=23
	'fw_rev' type_id=1851 bits_offset=0
	'cmdif_rev_fw_sub' type_id=1851 bits_offset=32
	'rsvd0' type_id=12097 bits_offset=64
	'cmdq_addr_h' type_id=1851 bits_offset=128
	'cmdq_addr_l_sz' type_id=1851 bits_offset=160
	'cmd_dbell' type_id=1851 bits_offset=192
	'rsvd1' type_id=139660 bits_offset=224
	'initializing' type_id=1851 bits_offset=4064
	'health' type_id=139658 bits_offset=4096
	'rsvd2' type_id=139661 bits_offset=4608
	'cmd_exec_to' type_id=1851 bits_offset=32704
	'cmd_q_init_to' type_id=1851 bits_offset=32736
	'internal_timer_h' type_id=1851 bits_offset=32768
	'internal_timer_l' type_id=1851 bits_offset=32800
	'rsvd3' type_id=12097 bits_offset=32832
	'health_counter' type_id=1851 bits_offset=32896
	'rsvd4' type_id=139662 bits_offset=32928
	'real_time_h' type_id=1851 bits_offset=33280
	'real_time_l' type_id=1851 bits_offset=33312
	'rsvd5' type_id=139663 bits_offset=33344
	'ieee1588_clk' type_id=6867 bits_offset=65536
	'ieee1588_clk_type' type_id=1851 bits_offset=65600
	'clr_intx' type_id=1851 bits_offset=65632
[139660] ARRAY '(anon)' type_id=1851 index_type_id=13 nr_elems=120
[139661] ARRAY '(anon)' type_id=1851 index_type_id=13 nr_elems=878
[139662] ARRAY '(anon)' type_id=1851 index_type_id=13 nr_elems=11
[139663] ARRAY '(anon)' type_id=1851 index_type_id=13 nr_elems=1006
[139664] ENUM 'mlx5_cap_type' encoding=UNSIGNED size=4 vlen=25
	'MLX5_CAP_GENERAL' val=0
	'MLX5_CAP_ETHERNET_OFFLOADS' val=1
	'MLX5_CAP_ODP' val=2
	'MLX5_CAP_ATOMIC' val=3
	'MLX5_CAP_ROCE' val=4
	'MLX5_CAP_IPOIB_OFFLOADS' val=5
	'MLX5_CAP_IPOIB_ENHANCED_OFFLOADS' val=6
	'MLX5_CAP_FLOW_TABLE' val=7
	'MLX5_CAP_ESWITCH_FLOW_TABLE' val=8
	'MLX5_CAP_ESWITCH' val=9
	'MLX5_CAP_QOS' val=12
	'MLX5_CAP_DEBUG' val=13
	'MLX5_CAP_RESERVED_14' val=14
	'MLX5_CAP_DEV_MEM' val=15
	'MLX5_CAP_RESERVED_16' val=16
	'MLX5_CAP_TLS' val=17
	'MLX5_CAP_VDPA_EMULATION' val=19
	'MLX5_CAP_DEV_EVENT' val=20
	'MLX5_CAP_IPSEC' val=21
	'MLX5_CAP_CRYPTO' val=26
	'MLX5_CAP_MACSEC' val=31
	'MLX5_CAP_GENERAL_2' val=32
	'MLX5_CAP_PORT_SELECTION' val=37
	'MLX5_CAP_ADV_VIRTUALIZATION' val=38
	'MLX5_CAP_NUM' val=39
[139665] ENUM 'mlx5_mcam_reg_groups' encoding=UNSIGNED size=4 vlen=3
	'MLX5_MCAM_REGS_FIRST_128' val=0
	'MLX5_MCAM_REGS_0x9100_0x917F' val=2
	'MLX5_MCAM_REGS_NUM' val=3
[139666] STRUCT 'mlx5_nb' size=32 vlen=2
	'nb' type_id=1865 bits_offset=0
	'event_type' type_id=19 bits_offset=192
[139667] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_BOARD_ID_LEN' val=64
[139668] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_CMD_WQ_MAX_NAME' val=32
[139669] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_MAX_PORTS' val=4
[139670] ENUM 'port_state_policy' encoding=UNSIGNED size=4 vlen=4
	'MLX5_POLICY_DOWN' val=0
	'MLX5_POLICY_UP' val=1
	'MLX5_POLICY_FOLLOW' val=2
	'MLX5_POLICY_INVALID' val=4294967295
[139671] ENUM 'mlx5_coredev_type' encoding=UNSIGNED size=4 vlen=3
	'MLX5_COREDEV_PF' val=0
	'MLX5_COREDEV_VF' val=1
	'MLX5_COREDEV_SF' val=2
[139672] STRUCT 'mlx5_core_dev' size=4336 vlen=39
	'device' type_id=782 bits_offset=0
	'coredev_type' type_id=139671 bits_offset=64
	'pdev' type_id=3013 bits_offset=128
	'pci_status_mutex' type_id=155 bits_offset=192
	'pci_status' type_id=139731 bits_offset=448
	'rev_id' type_id=19 bits_offset=480
	'board_id' type_id=476 bits_offset=488
	'cmd' type_id=139684 bits_offset=1024
	'caps' type_id=139745 bits_offset=6720
	'timeouts' type_id=139751 bits_offset=14272
	'sys_image_guid' type_id=23 bits_offset=14336
	'iseg_base' type_id=385 bits_offset=14400
	'iseg' type_id=139752 bits_offset=14464
	'bar_addr' type_id=385 bits_offset=14528
	'state' type_id=139730 bits_offset=14592
	'intf_state_mutex' type_id=155 bits_offset=14656
	'lock_key' type_id=405 bits_offset=14912
	'intf_state' type_id=1 bits_offset=14912
	'priv' type_id=139711 bits_offset=14976
	'profile' type_id=139742 bits_offset=24896
	'issi' type_id=21 bits_offset=26432
	'mlx5e_res' type_id=139734 bits_offset=26496
	'dm' type_id=139753 bits_offset=28800
	'vxlan' type_id=139754 bits_offset=28864
	'geneve' type_id=139755 bits_offset=28928
	'roce' type_id=139750 bits_offset=28992
	'fpga' type_id=139756 bits_offset=29248
	'clock' type_id=139739 bits_offset=29312
	'clock_info' type_id=139757 bits_offset=33664
	'tracer' type_id=139758 bits_offset=33728
	'rsc_dump' type_id=139759 bits_offset=33792
	'vsc_addr' type_id=21 bits_offset=33856
	'hv_vhca' type_id=139760 bits_offset=33920
	'hwmon' type_id=139761 bits_offset=33984
	'num_block_tc' type_id=23 bits_offset=34048
	'num_block_ipsec' type_id=23 bits_offset=34112
	'macsec_fs' type_id=139762 bits_offset=34176
	'macsec_nh' type_id=1866 bits_offset=34240
	'num_ipsec_offloads' type_id=23 bits_offset=34624
[139673] PTR '(anon)' type_id=139672
[139674] ENUM 'mlx5_cmdif_state' encoding=UNSIGNED size=4 vlen=3
	'MLX5_CMDIF_STATE_UNINITIALIZED' val=0
	'MLX5_CMDIF_STATE_UP' val=1
	'MLX5_CMDIF_STATE_DOWN' val=2
[139675] STRUCT 'mlx5_cmd_first' size=16 vlen=1
	'data' type_id=1903 bits_offset=0
[139676] STRUCT 'mlx5_cmd_msg' size=56 vlen=5
	'list' type_id=54 bits_offset=0
	'parent' type_id=139678 bits_offset=128
	'len' type_id=21 bits_offset=192
	'first' type_id=139675 bits_offset=224
	'next' type_id=139680 bits_offset=384
[139677] STRUCT 'cmd_msg_cache' size=32 vlen=4
	'lock' type_id=154 bits_offset=0
	'head' type_id=54 bits_offset=64
	'max_inbox_size' type_id=6 bits_offset=192
	'num_ent' type_id=6 bits_offset=224
[139678] PTR '(anon)' type_id=139677
[139679] STRUCT 'mlx5_cmd_mailbox' size=24 vlen=3
	'buf' type_id=64 bits_offset=0
	'dma' type_id=3718 bits_offset=64
	'next' type_id=139680 bits_offset=128
[139680] PTR '(anon)' type_id=139679
[139681] STRUCT 'mlx5_cmd_debug' size=32 vlen=6
	'dbg_root' type_id=912 bits_offset=0
	'in_msg' type_id=64 bits_offset=64
	'out_msg' type_id=64 bits_offset=128
	'status' type_id=19 bits_offset=192
	'inlen' type_id=20 bits_offset=208
	'outlen' type_id=20 bits_offset=224
[139682] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_NUM_COMMAND_CACHES' val=5
[139683] STRUCT '(anon)' size=88 vlen=8
	'cmdif_rev' type_id=20 bits_offset=0
	'log_sz' type_id=19 bits_offset=16
	'log_stride' type_id=19 bits_offset=24
	'max_reg_cmds' type_id=13 bits_offset=32
	'bitmask' type_id=1 bits_offset=64
	'sem' type_id=4499 bits_offset=128
	'pages_sem' type_id=4499 bits_offset=320
	'throttle_sem' type_id=4499 bits_offset=512
[139684] STRUCT 'mlx5_cmd' size=712 vlen=21
	'nb' type_id=139666 bits_offset=0
	'vars' type_id=139683 bits_offset=256
	'state' type_id=139674 bits_offset=960
	'cmd_alloc_buf' type_id=64 bits_offset=1024
	'alloc_dma' type_id=3718 bits_offset=1088
	'alloc_size' type_id=13 bits_offset=1152
	'cmd_buf' type_id=64 bits_offset=1216
	'dma' type_id=3718 bits_offset=1280
	'alloc_lock' type_id=154 bits_offset=1344
	'token_lock' type_id=154 bits_offset=1376
	'token' type_id=19 bits_offset=1408
	'wq_name' type_id=1221 bits_offset=1416
	'wq' type_id=542 bits_offset=1728
	'mode' type_id=13 bits_offset=1792
	'allowed_opcode' type_id=20 bits_offset=1824
	'ent_arr' type_id=139685 bits_offset=1856
	'pool' type_id=20808 bits_offset=3904
	'dbg' type_id=139681 bits_offset=3968
	'cache' type_id=139688 bits_offset=4224
	'checksum_disabled' type_id=13 bits_offset=5504
	'stats' type_id=660 bits_offset=5568
[139685] ARRAY '(anon)' type_id=139686 index_type_id=13 nr_elems=32
[139686] PTR '(anon)' type_id=139687
[139687] STRUCT 'mlx5_cmd_work_ent' size=336 vlen=24
	'state' type_id=1 bits_offset=0
	'in' type_id=139766 bits_offset=64
	'out' type_id=139766 bits_offset=128
	'uout' type_id=64 bits_offset=192
	'uout_size' type_id=13 bits_offset=256
	'callback' type_id=139763 bits_offset=320
	'cb_timeout_work' type_id=541 bits_offset=384
	'context' type_id=64 bits_offset=1088
	'idx' type_id=13 bits_offset=1152
	'handling' type_id=508 bits_offset=1216
	'slotted' type_id=508 bits_offset=1472
	'done' type_id=508 bits_offset=1728
	'cmd' type_id=139767 bits_offset=1984
	'work' type_id=540 bits_offset=2048
	'lay' type_id=139768 bits_offset=2304
	'ret' type_id=13 bits_offset=2368
	'page_queue' type_id=13 bits_offset=2400
	'status' type_id=19 bits_offset=2432
	'token' type_id=19 bits_offset=2440
	'ts1' type_id=23 bits_offset=2496
	'ts2' type_id=23 bits_offset=2560
	'op' type_id=20 bits_offset=2624
	'polling' type_id=42 bits_offset=2640
	'refcnt' type_id=178 bits_offset=2656
[139688] ARRAY '(anon)' type_id=139677 index_type_id=13 nr_elems=5
[139689] STRUCT 'mlx5_uars_page' size=80 vlen=11
	'map' type_id=64 bits_offset=0
	'wc' type_id=42 bits_offset=64
	'index' type_id=21 bits_offset=96
	'list' type_id=54 bits_offset=128
	'bfregs' type_id=6 bits_offset=256
	'reg_bitmap' type_id=79 bits_offset=320
	'fp_bitmap' type_id=79 bits_offset=384
	'reg_avail' type_id=6 bits_offset=448
	'fp_avail' type_id=6 bits_offset=480
	'ref_count' type_id=525 bits_offset=512
	'mdev' type_id=139673 bits_offset=576
[139690] STRUCT 'mlx5_bfreg_head' size=48 vlen=2
	'lock' type_id=155 bits_offset=0
	'list' type_id=54 bits_offset=256
[139691] STRUCT 'mlx5_bfreg_data' size=96 vlen=2
	'reg_head' type_id=139690 bits_offset=0
	'wc_head' type_id=139690 bits_offset=384
[139692] STRUCT 'mlx5_sq_bfreg' size=32 vlen=5
	'map' type_id=64 bits_offset=0
	'up' type_id=139693 bits_offset=64
	'wc' type_id=42 bits_offset=128
	'index' type_id=21 bits_offset=160
	'offset' type_id=6 bits_offset=192
[139693] PTR '(anon)' type_id=139689
[139694] STRUCT 'mlx5_core_health' size=272 vlen=16
	'health' type_id=139695 bits_offset=0
	'health_counter' type_id=8515 bits_offset=64
	'timer' type_id=169 bits_offset=128
	'prev' type_id=21 bits_offset=448
	'miss_counter' type_id=13 bits_offset=480
	'synd' type_id=19 bits_offset=512
	'fatal_error' type_id=21 bits_offset=544
	'crdump_size' type_id=21 bits_offset=576
	'wq' type_id=542 bits_offset=640
	'flags' type_id=1 bits_offset=704
	'fatal_report_work' type_id=540 bits_offset=768
	'report_work' type_id=540 bits_offset=1024
	'fw_reporter' type_id=25060 bits_offset=1280
	'fw_fatal_reporter' type_id=25060 bits_offset=1344
	'vnic_reporter' type_id=25060 bits_offset=1408
	'update_fw_log_ts_work' type_id=541 bits_offset=1472
[139695] PTR '(anon)' type_id=139658
[139696] STRUCT 'mlx5_vf_context' size=80 vlen=7
	'enabled' type_id=13 bits_offset=0
	'port_guid' type_id=23 bits_offset=64
	'node_guid' type_id=23 bits_offset=128
	'port_guid_valid' type_id=19 bits_offset=192 bitfield_size=1
	'node_guid_valid' type_id=19 bits_offset=193 bitfield_size=1
	'policy' type_id=139670 bits_offset=224
	'notifier' type_id=1866 bits_offset=256
[139697] STRUCT 'mlx5_core_sriov' size=16 vlen=4
	'vfs_ctx' type_id=139698 bits_offset=0
	'num_vfs' type_id=13 bits_offset=64
	'max_vfs' type_id=20 bits_offset=96
	'max_ec_vfs' type_id=20 bits_offset=112
[139698] PTR '(anon)' type_id=139696
[139699] STRUCT 'mlx5_fc_pool' size=104 vlen=8
	'dev' type_id=139673 bits_offset=0
	'pool_lock' type_id=155 bits_offset=64
	'fully_used' type_id=54 bits_offset=320
	'partially_used' type_id=54 bits_offset=448
	'unused' type_id=54 bits_offset=576
	'available_fcs' type_id=13 bits_offset=704
	'used_fcs' type_id=13 bits_offset=736
	'threshold' type_id=13 bits_offset=768
[139700] STRUCT 'mlx5_fc_stats' size=320 vlen=15
	'counters_idr_lock' type_id=154 bits_offset=0
	'counters_idr' type_id=663 bits_offset=64
	'counters' type_id=54 bits_offset=256
	'addlist' type_id=142 bits_offset=384
	'dellist' type_id=142 bits_offset=448
	'wq' type_id=542 bits_offset=512
	'work' type_id=541 bits_offset=576
	'next_query' type_id=1 bits_offset=1280
	'sampling_interval' type_id=1 bits_offset=1344
	'bulk_query_out' type_id=96 bits_offset=1408
	'bulk_query_len' type_id=13 bits_offset=1472
	'num_counters' type_id=45 bits_offset=1536
	'bulk_query_alloc_failed' type_id=42 bits_offset=1600
	'next_bulk_query_alloc' type_id=1 bits_offset=1664
	'fc_pool' type_id=139699 bits_offset=1728
[139701] STRUCT 'mlx5_rl_entry' size=64 vlen=5
	'rl_raw' type_id=7775 bits_offset=0
	'refcount' type_id=23 bits_offset=384
	'index' type_id=20 bits_offset=448
	'uid' type_id=20 bits_offset=464
	'dedicated' type_id=19 bits_offset=480 bitfield_size=1
[139702] STRUCT 'mlx5_rl_table' size=64 vlen=6
	'rl_lock' type_id=155 bits_offset=0
	'max_size' type_id=20 bits_offset=256
	'max_rate' type_id=21 bits_offset=288
	'min_rate' type_id=21 bits_offset=320
	'rl_entry' type_id=139703 bits_offset=384
	'refcount' type_id=23 bits_offset=448
[139703] PTR '(anon)' type_id=139701
[139704] STRUCT 'mlx5_core_roce' size=24 vlen=3
	'ft' type_id=139705 bits_offset=0
	'fg' type_id=139706 bits_offset=64
	'allow_rule' type_id=139707 bits_offset=128
[139705] PTR '(anon)' type_id=140302
[139706] PTR '(anon)' type_id=140303
[139707] PTR '(anon)' type_id=140304
[139708] STRUCT 'mlx5_adev' size=800 vlen=3
	'adev' type_id=61064 bits_offset=0
	'mdev' type_id=139673 bits_offset=6272
	'idx' type_id=13 bits_offset=6336
[139709] STRUCT 'mlx5_debugfs_entries' size=56 vlen=7
	'dbg_root' type_id=912 bits_offset=0
	'qp_debugfs' type_id=912 bits_offset=64
	'eq_debugfs' type_id=912 bits_offset=128
	'cq_debugfs' type_id=912 bits_offset=192
	'cmdif_debugfs' type_id=912 bits_offset=256
	'pages_debugfs' type_id=912 bits_offset=320
	'lag_debugfs' type_id=912 bits_offset=384
[139710] ENUM 'mlx5_func_type' encoding=UNSIGNED size=4 vlen=6
	'MLX5_PF' val=0
	'MLX5_VF' val=1
	'MLX5_SF' val=2
	'MLX5_HOST_PF' val=3
	'MLX5_EC_VF' val=4
	'MLX5_FUNC_TYPE_NUM' val=5
[139711] STRUCT 'mlx5_priv' size=1240 vlen=44
	'irq_table' type_id=139712 bits_offset=0
	'eq_table' type_id=139713 bits_offset=64
	'pg_nb' type_id=139666 bits_offset=128
	'pg_wq' type_id=542 bits_offset=384
	'page_root_xa' type_id=660 bits_offset=448
	'reg_pages' type_id=51 bits_offset=576
	'free_list' type_id=54 bits_offset=640
	'fw_pages' type_id=21 bits_offset=768
	'page_counters' type_id=4558 bits_offset=800
	'fw_pages_alloc_failed' type_id=21 bits_offset=960
	'give_pages_dropped' type_id=21 bits_offset=992
	'reclaim_pages_discard' type_id=21 bits_offset=1024
	'health' type_id=139694 bits_offset=1088
	'traps' type_id=54 bits_offset=3264
	'dbg' type_id=139709 bits_offset=3392
	'alloc_mutex' type_id=155 bits_offset=3840
	'numa_node' type_id=13 bits_offset=4096
	'pgdir_mutex' type_id=155 bits_offset=4160
	'pgdir_list' type_id=54 bits_offset=4416
	'adev' type_id=139714 bits_offset=4544
	'adev_idx' type_id=13 bits_offset=4608
	'sw_vhca_id' type_id=13 bits_offset=4640
	'events' type_id=139716 bits_offset=4672
	'vhca_events' type_id=139717 bits_offset=4736
	'steering' type_id=139718 bits_offset=4800
	'mpfs' type_id=139719 bits_offset=4864
	'eswitch' type_id=139720 bits_offset=4928
	'sriov' type_id=139697 bits_offset=4992
	'lag' type_id=139721 bits_offset=5120
	'flags' type_id=21 bits_offset=5184
	'devc' type_id=139722 bits_offset=5248
	'hca_devcom_comp' type_id=139723 bits_offset=5312
	'fw_reset' type_id=139724 bits_offset=5376
	'roce' type_id=139704 bits_offset=5440
	'fc_stats' type_id=139700 bits_offset=5632
	'rl_table' type_id=139702 bits_offset=8192
	'ft_pool' type_id=139725 bits_offset=8704
	'bfregs' type_id=139691 bits_offset=8768
	'uar' type_id=139693 bits_offset=9536
	'vhca_state_notifier' type_id=139726 bits_offset=9600
	'sf_dev_table' type_id=139727 bits_offset=9664
	'parent_mdev' type_id=139673 bits_offset=9728
	'sf_hw_table' type_id=139728 bits_offset=9792
	'sf_table' type_id=139729 bits_offset=9856
[139712] PTR '(anon)' type_id=143201
[139713] PTR '(anon)' type_id=140541
[139714] PTR '(anon)' type_id=139715
[139715] PTR '(anon)' type_id=139708
[139716] PTR '(anon)' type_id=147205
[139717] PTR '(anon)' type_id=147252
[139718] PTR '(anon)' type_id=140305
[139719] PTR '(anon)' type_id=148007
[139720] PTR '(anon)' type_id=140142
[139721] PTR '(anon)' type_id=141253
[139722] PTR '(anon)' type_id=140577
[139723] PTR '(anon)' type_id=140578
[139724] PTR '(anon)' type_id=147215
[139725] PTR '(anon)' type_id=142686
[139726] PTR '(anon)' type_id=147253
[139727] PTR '(anon)' type_id=146587
[139728] PTR '(anon)' type_id=145129
[139729] PTR '(anon)' type_id=142859
[139730] ENUM 'mlx5_device_state' encoding=UNSIGNED size=4 vlen=2
	'MLX5_DEVICE_STATE_UP' val=1
	'MLX5_DEVICE_STATE_INTERNAL_ERROR' val=2
[139731] ENUM 'mlx5_pci_status' encoding=UNSIGNED size=4 vlen=2
	'MLX5_PCI_STATUS_DISABLED' val=0
	'MLX5_PCI_STATUS_ENABLED' val=1
[139732] STRUCT 'mlx5_td' size=56 vlen=3
	'list_lock' type_id=155 bits_offset=0
	'tirs_list' type_id=54 bits_offset=256
	'tdn' type_id=21 bits_offset=384
[139733] STRUCT 'mlx5e_hw_objs' size=240 vlen=6
	'pdn' type_id=21 bits_offset=0
	'td' type_id=139732 bits_offset=64
	'mkey' type_id=21 bits_offset=512
	'bfreg' type_id=139692 bits_offset=576
	'tisn' type_id=105 bits_offset=832
	'tisn_valid' type_id=42 bits_offset=1856
[139734] STRUCT 'mlx5e_resources' size=288 vlen=4
	'hw_objs' type_id=139733 bits_offset=0
	'uplink_netdev' type_id=1996 bits_offset=1920
	'uplink_netdev_lock' type_id=155 bits_offset=1984
	'dek_priv' type_id=139735 bits_offset=2240
[139735] PTR '(anon)' type_id=144720
[139736] STRUCT 'mlx5_rsvd_gids' size=24 vlen=3
	'start' type_id=6 bits_offset=0
	'count' type_id=6 bits_offset=32
	'ida' type_id=15008 bits_offset=64
[139737] STRUCT 'mlx5_pps' size=128 vlen=6
	'pin_caps' type_id=7469 bits_offset=0
	'out_work' type_id=540 bits_offset=64
	'start' type_id=475 bits_offset=320
	'enabled' type_id=19 bits_offset=832
	'min_npps_period' type_id=23 bits_offset=896
	'min_out_pulse_duration_ns' type_id=23 bits_offset=960
[139738] STRUCT 'mlx5_timer' size=168 vlen=5
	'cycles' type_id=26711 bits_offset=0
	'tc' type_id=26716 bits_offset=192
	'nominal_c_mult' type_id=21 bits_offset=512
	'overflow_period' type_id=1 bits_offset=576
	'overflow_work' type_id=541 bits_offset=640
[139739] STRUCT 'mlx5_clock' size=544 vlen=7
	'pps_nb' type_id=139666 bits_offset=0
	'lock' type_id=501 bits_offset=256
	'hwtstamp_config' type_id=23360 bits_offset=320
	'ptp' type_id=31569 bits_offset=448
	'ptp_info' type_id=31535 bits_offset=512
	'pps_info' type_id=139737 bits_offset=1984
	'timer' type_id=139738 bits_offset=3008
[139740] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MKEY_CACHE_LAST_STD_ENTRY' val=20
	'MLX5_IMR_KSM_CACHE_ENTRY' val=21
	'MAX_MKEY_CACHE_ENTRIES' val=22
[139741] STRUCT '(anon)' size=8 vlen=2
	'size' type_id=13 bits_offset=0
	'limit' type_id=13 bits_offset=32
[139742] STRUCT 'mlx5_profile' size=192 vlen=4
	'mask' type_id=23 bits_offset=0
	'log_max_qp' type_id=19 bits_offset=64
	'num_cmd_caches' type_id=19 bits_offset=72
	'mr_cache' type_id=139743 bits_offset=96
[139743] ARRAY '(anon)' type_id=139741 index_type_id=13 nr_elems=22
[139744] STRUCT 'mlx5_hca_cap' size=8192 vlen=2
	'cur' type_id=10088 bits_offset=0
	'max' type_id=10088 bits_offset=32768
[139745] STRUCT '(anon)' size=944 vlen=6
	'hca' type_id=139746 bits_offset=0
	'pcam' type_id=98 bits_offset=2496
	'mcam' type_id=139748 bits_offset=3136
	'fpga' type_id=106 bits_offset=4864
	'qcam' type_id=139749 bits_offset=6912
	'embedded_cpu' type_id=19 bits_offset=7488
[139746] ARRAY '(anon)' type_id=139747 index_type_id=13 nr_elems=39
[139747] PTR '(anon)' type_id=139744
[139748] ARRAY '(anon)' type_id=21 index_type_id=13 nr_elems=54
[139749] ARRAY '(anon)' type_id=21 index_type_id=13 nr_elems=18
[139750] STRUCT '(anon)' size=32 vlen=2
	'reserved_gids' type_id=139736 bits_offset=0
	'roce_en' type_id=21 bits_offset=192
[139751] PTR '(anon)' type_id=147651
[139752] PTR '(anon)' type_id=139659
[139753] PTR '(anon)' type_id=145017
[139754] PTR '(anon)' type_id=145692
[139755] PTR '(anon)' type_id=147991
[139756] PTR '(anon)' type_id=140542
[139757] PTR '(anon)' type_id=147239
[139758] PTR '(anon)' type_id=140543
[139759] PTR '(anon)' type_id=146046
[139760] PTR '(anon)' type_id=146123
[139761] PTR '(anon)' type_id=145113
[139762] PTR '(anon)' type_id=141398
[139763] TYPEDEF 'mlx5_cmd_cbk_t' type_id=139764
[139764] PTR '(anon)' type_id=139765
[139765] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=13
	'(anon)' type_id=64
[139766] PTR '(anon)' type_id=139676
[139767] PTR '(anon)' type_id=139684
[139768] PTR '(anon)' type_id=139657
[139769] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=28
[139770] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=4
	'MLX5_WQ_TYPE_LINKED_LIST' val=0
	'MLX5_WQ_TYPE_CYCLIC' val=1
	'MLX5_WQ_TYPE_LINKED_LIST_STRIDING_RQ' val=2
	'MLX5_WQ_TYPE_CYCLIC_STRIDING_RQ' val=3
[139771] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_RQC_STATE_RST' val=0
	'MLX5_RQC_STATE_RDY' val=1
	'MLX5_RQC_STATE_ERR' val=3
[139772] ENUM 'mlx5_event' encoding=UNSIGNED size=4 vlen=38
	'MLX5_EVENT_TYPE_NOTIFY_ANY' val=0
	'MLX5_EVENT_TYPE_COMP' val=0
	'MLX5_EVENT_TYPE_PATH_MIG' val=1
	'MLX5_EVENT_TYPE_COMM_EST' val=2
	'MLX5_EVENT_TYPE_SQ_DRAINED' val=3
	'MLX5_EVENT_TYPE_SRQ_LAST_WQE' val=19
	'MLX5_EVENT_TYPE_SRQ_RQ_LIMIT' val=20
	'MLX5_EVENT_TYPE_CQ_ERROR' val=4
	'MLX5_EVENT_TYPE_WQ_CATAS_ERROR' val=5
	'MLX5_EVENT_TYPE_PATH_MIG_FAILED' val=7
	'MLX5_EVENT_TYPE_WQ_INVAL_REQ_ERROR' val=16
	'MLX5_EVENT_TYPE_WQ_ACCESS_ERROR' val=17
	'MLX5_EVENT_TYPE_SRQ_CATAS_ERROR' val=18
	'MLX5_EVENT_TYPE_OBJECT_CHANGE' val=39
	'MLX5_EVENT_TYPE_INTERNAL_ERROR' val=8
	'MLX5_EVENT_TYPE_PORT_CHANGE' val=9
	'MLX5_EVENT_TYPE_GPIO_EVENT' val=21
	'MLX5_EVENT_TYPE_PORT_MODULE_EVENT' val=22
	'MLX5_EVENT_TYPE_TEMP_WARN_EVENT' val=23
	'MLX5_EVENT_TYPE_XRQ_ERROR' val=24
	'MLX5_EVENT_TYPE_REMOTE_CONFIG' val=25
	'MLX5_EVENT_TYPE_GENERAL_EVENT' val=34
	'MLX5_EVENT_TYPE_MONITOR_COUNTER' val=36
	'MLX5_EVENT_TYPE_PPS_EVENT' val=37
	'MLX5_EVENT_TYPE_DB_BF_CONGESTION' val=26
	'MLX5_EVENT_TYPE_STALL_EVENT' val=27
	'MLX5_EVENT_TYPE_CMD' val=10
	'MLX5_EVENT_TYPE_PAGE_REQUEST' val=11
	'MLX5_EVENT_TYPE_PAGE_FAULT' val=12
	'MLX5_EVENT_TYPE_NIC_VPORT_CHANGE' val=13
	'MLX5_EVENT_TYPE_ESW_FUNCTIONS_CHANGED' val=14
	'MLX5_EVENT_TYPE_VHCA_STATE_CHANGE' val=15
	'MLX5_EVENT_TYPE_DCT_DRAINED' val=28
	'MLX5_EVENT_TYPE_DCT_KEY_VIOLATION' val=29
	'MLX5_EVENT_TYPE_FPGA_ERROR' val=32
	'MLX5_EVENT_TYPE_FPGA_QP_ERROR' val=33
	'MLX5_EVENT_TYPE_DEVICE_TRACER' val=38
	'MLX5_EVENT_TYPE_MAX' val=256
[139773] STRUCT 'mlx5_eqe_comp' size=28 vlen=2
	'reserved' type_id=13422 bits_offset=0
	'cqn' type_id=1851 bits_offset=192
[139774] STRUCT 'mlx5_eqe_qp_srq' size=28 vlen=4
	'reserved1' type_id=13424 bits_offset=0
	'type' type_id=19 bits_offset=160
	'reserved2' type_id=401 bits_offset=168
	'qp_srq_n' type_id=1851 bits_offset=192
[139775] STRUCT 'mlx5_eqe_cq_err' size=12 vlen=3
	'cqn' type_id=1851 bits_offset=0
	'reserved1' type_id=3023 bits_offset=32
	'syndrome' type_id=19 bits_offset=88
[139776] STRUCT 'mlx5_eqe_xrq_err' size=28 vlen=3
	'reserved1' type_id=13424 bits_offset=0
	'type_xrqn' type_id=1851 bits_offset=160
	'reserved2' type_id=1851 bits_offset=192
[139777] STRUCT 'mlx5_eqe_port_state' size=9 vlen=2
	'reserved0' type_id=7469 bits_offset=0
	'port' type_id=19 bits_offset=64
[139778] STRUCT 'mlx5_eqe_gpio' size=16 vlen=2
	'reserved0' type_id=12097 bits_offset=0
	'gpio_event' type_id=6867 bits_offset=64
[139779] STRUCT 'mlx5_eqe_congestion' size=3 vlen=3
	'type' type_id=19 bits_offset=0
	'rsvd0' type_id=19 bits_offset=8
	'congestion_level' type_id=19 bits_offset=16
[139780] STRUCT 'mlx5_eqe_stall_vl' size=4 vlen=2
	'rsvd0' type_id=401 bits_offset=0
	'port_vl' type_id=19 bits_offset=24
[139781] STRUCT 'mlx5_eqe_cmd' size=28 vlen=2
	'vector' type_id=1851 bits_offset=0
	'rsvd' type_id=13422 bits_offset=32
[139782] STRUCT 'mlx5_eqe_page_req' size=28 vlen=4
	'ec_function' type_id=1850 bits_offset=0
	'func_id' type_id=1850 bits_offset=16
	'num_pages' type_id=1851 bits_offset=32
	'rsvd1' type_id=13424 bits_offset=64
[139783] STRUCT '(anon)' size=24 vlen=7
	'reserved1' type_id=20 bits_offset=0
	'wqe_index' type_id=1850 bits_offset=16
	'reserved2' type_id=20 bits_offset=32
	'packet_length' type_id=1850 bits_offset=48
	'token' type_id=1851 bits_offset=64
	'reserved4' type_id=7469 bits_offset=96
	'pftype_wq' type_id=1851 bits_offset=160
[139784] STRUCT '(anon)' size=24 vlen=6
	'r_key' type_id=1851 bits_offset=0
	'reserved1' type_id=20 bits_offset=32
	'packet_length' type_id=1850 bits_offset=48
	'rdma_op_len' type_id=1851 bits_offset=64
	'rdma_va' type_id=6867 bits_offset=96
	'pftype_token' type_id=1851 bits_offset=160
[139785] UNION '(anon)' size=24 vlen=2
	'wqe' type_id=139783 bits_offset=0
	'rdma' type_id=139784 bits_offset=0
[139786] STRUCT 'mlx5_eqe_page_fault' size=28 vlen=2
	'bytes_committed' type_id=1851 bits_offset=0
	'(anon)' type_id=139785 bits_offset=32
[139787] STRUCT 'mlx5_eqe_vport_change' size=28 vlen=3
	'rsvd0' type_id=2689 bits_offset=0
	'vport_num' type_id=1850 bits_offset=16
	'rsvd1' type_id=13422 bits_offset=32
[139788] STRUCT 'mlx5_eqe_port_module' size=7 vlen=6
	'reserved_at_0' type_id=16161 bits_offset=0
	'module' type_id=19 bits_offset=8
	'reserved_at_2' type_id=16161 bits_offset=16
	'module_status' type_id=19 bits_offset=24
	'reserved_at_4' type_id=2689 bits_offset=32
	'error_type' type_id=19 bits_offset=48
[139789] STRUCT '(anon)' size=8 vlen=2
	'time_sec' type_id=1851 bits_offset=0
	'time_nsec' type_id=1851 bits_offset=32
[139790] STRUCT '(anon)' size=8 vlen=1
	'time_stamp' type_id=6867 bits_offset=0
[139791] UNION '(anon)' size=8 vlen=2
	'(anon)' type_id=139789 bits_offset=0
	'(anon)' type_id=139790 bits_offset=0
[139792] STRUCT 'mlx5_eqe_pps' size=28 vlen=5
	'rsvd0' type_id=401 bits_offset=0
	'pin' type_id=19 bits_offset=24
	'rsvd1' type_id=2120 bits_offset=32
	'(anon)' type_id=139791 bits_offset=64
	'rsvd2' type_id=7436 bits_offset=128
[139793] STRUCT 'mlx5_eqe_dct' size=28 vlen=2
	'reserved' type_id=13422 bits_offset=0
	'dctn' type_id=1851 bits_offset=192
[139794] STRUCT 'mlx5_eqe_temp_warning' size=16 vlen=2
	'sensor_warning_msb' type_id=6867 bits_offset=0
	'sensor_warning_lsb' type_id=6867 bits_offset=64
[139795] STRUCT 'mlx5_eqe_obj_change' size=8 vlen=3
	'rsvd0' type_id=2689 bits_offset=0
	'obj_type' type_id=1850 bits_offset=16
	'obj_id' type_id=1851 bits_offset=32
[139796] STRUCT 'mlx5_eqe_sync_fw_update' size=4 vlen=2
	'reserved_at_0' type_id=401 bits_offset=0
	'sync_rst_state' type_id=19 bits_offset=24
[139797] STRUCT 'mlx5_eqe_vhca_state' size=4 vlen=2
	'ec_function' type_id=1850 bits_offset=0
	'function_id' type_id=1850 bits_offset=16
[139798] UNION 'ev_data' size=28 vlen=20
	'raw' type_id=139799 bits_offset=0
	'cmd' type_id=139781 bits_offset=0
	'comp' type_id=139773 bits_offset=0
	'qp_srq' type_id=139774 bits_offset=0
	'cq_err' type_id=139775 bits_offset=0
	'port' type_id=139777 bits_offset=0
	'gpio' type_id=139778 bits_offset=0
	'cong' type_id=139779 bits_offset=0
	'stall_vl' type_id=139780 bits_offset=0
	'req_pages' type_id=139782 bits_offset=0
	'page_fault' type_id=139786 bits_offset=0
	'vport_change' type_id=139787 bits_offset=0
	'port_module' type_id=139788 bits_offset=0
	'pps' type_id=139792 bits_offset=0
	'dct' type_id=139793 bits_offset=0
	'temp_warning' type_id=139794 bits_offset=0
	'xrq_err' type_id=139776 bits_offset=0
	'sync_fw_update' type_id=139796 bits_offset=0
	'vhca_state' type_id=139797 bits_offset=0
	'obj_change' type_id=139795 bits_offset=0
[139799] ARRAY '(anon)' type_id=1851 index_type_id=13 nr_elems=7
[139800] STRUCT 'mlx5_eqe' size=64 vlen=9
	'rsvd0' type_id=19 bits_offset=0
	'type' type_id=19 bits_offset=8
	'rsvd1' type_id=19 bits_offset=16
	'sub_type' type_id=19 bits_offset=24
	'rsvd2' type_id=139799 bits_offset=32
	'data' type_id=139798 bits_offset=256
	'rsvd3' type_id=1850 bits_offset=480
	'signature' type_id=19 bits_offset=496
	'owner' type_id=19 bits_offset=504
[139801] STRUCT '(anon)' size=8 vlen=4
	'tcppsh_abort_dupack' type_id=19 bits_offset=0
	'min_ttl' type_id=19 bits_offset=8
	'tcp_win' type_id=1850 bits_offset=16
	'ack_seq_num' type_id=1851 bits_offset=32
[139802] STRUCT '(anon)' size=8 vlen=7
	'reserved0' type_id=19 bits_offset=0 bitfield_size=1
	'match' type_id=19 bits_offset=1 bitfield_size=1
	'flush' type_id=19 bits_offset=2 bitfield_size=1
	'reserved3' type_id=19 bits_offset=3 bitfield_size=5
	'header_size' type_id=19 bits_offset=8
	'header_entry_index' type_id=1850 bits_offset=16
	'data_offset' type_id=1851 bits_offset=32
[139803] UNION '(anon)' size=8 vlen=2
	'lro' type_id=139801 bits_offset=0
	'shampo' type_id=139802 bits_offset=0
[139804] UNION '(anon)' size=4 vlen=4
	'immediate' type_id=1851 bits_offset=0
	'inval_rkey' type_id=1851 bits_offset=0
	'pkey' type_id=1851 bits_offset=0
	'ft_metadata' type_id=1851 bits_offset=0
[139805] UNION '(anon)' size=1 vlen=2
	'signature' type_id=19 bits_offset=0
	'validity_iteration_count' type_id=19 bits_offset=0
[139806] STRUCT 'mlx5_cqe64' size=64 vlen=24
	'tls_outer_l3_tunneled' type_id=19 bits_offset=0
	'rsvd0' type_id=19 bits_offset=8
	'wqe_id' type_id=1850 bits_offset=16
	'(anon)' type_id=139803 bits_offset=32
	'rss_hash_result' type_id=1851 bits_offset=96
	'rss_hash_type' type_id=19 bits_offset=128
	'ml_path' type_id=19 bits_offset=136
	'rsvd20' type_id=2689 bits_offset=144
	'check_sum' type_id=1850 bits_offset=160
	'slid' type_id=1850 bits_offset=176
	'flags_rqpn' type_id=1851 bits_offset=192
	'hds_ip_ext' type_id=19 bits_offset=224
	'l4_l3_hdr_type' type_id=19 bits_offset=232
	'vlan_info' type_id=1850 bits_offset=240
	'srqn' type_id=1851 bits_offset=256
	'(anon)' type_id=139804 bits_offset=288
	'rsvd40' type_id=2120 bits_offset=320
	'byte_cnt' type_id=1851 bits_offset=352
	'timestamp_h' type_id=1851 bits_offset=384
	'timestamp_l' type_id=1851 bits_offset=416
	'sop_drop_qpn' type_id=1851 bits_offset=448
	'wqe_counter' type_id=1850 bits_offset=480
	'(anon)' type_id=139805 bits_offset=496
	'op_own' type_id=19 bits_offset=504
[139807] STRUCT '(anon)' size=4 vlen=2
	'checksum' type_id=1850 bits_offset=0
	'stridx' type_id=1850 bits_offset=16
[139808] STRUCT '(anon)' size=4 vlen=3
	'wqe_counter' type_id=1850 bits_offset=0
	's_wqe_opcode' type_id=19 bits_offset=16
	'reserved' type_id=19 bits_offset=24
[139809] UNION '(anon)' size=4 vlen=3
	'rx_hash_result' type_id=1851 bits_offset=0
	'(anon)' type_id=139807 bits_offset=0
	's_wqe_info' type_id=139808 bits_offset=0
[139810] STRUCT 'mlx5_mini_cqe8' size=8 vlen=2
	'(anon)' type_id=139809 bits_offset=0
	'byte_cnt' type_id=1851 bits_offset=32
[139811] STRUCT 'mlx5_mkey_seg' size=64 vlen=15
	'status' type_id=19 bits_offset=0
	'pcie_control' type_id=19 bits_offset=8
	'flags' type_id=19 bits_offset=16
	'version' type_id=19 bits_offset=24
	'qpn_mkey7_0' type_id=1851 bits_offset=32
	'rsvd1' type_id=2120 bits_offset=64
	'flags_pd' type_id=1851 bits_offset=96
	'start_addr' type_id=6867 bits_offset=128
	'len' type_id=6867 bits_offset=192
	'bsfs_octo_size' type_id=1851 bits_offset=256
	'rsvd2' type_id=474 bits_offset=288
	'xlt_oct_size' type_id=1851 bits_offset=416
	'rsvd3' type_id=401 bits_offset=448
	'log2_page_size' type_id=19 bits_offset=472
	'rsvd4' type_id=2120 bits_offset=480
[139812] ENUM 'mlx5_dcbx_oper_mode' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_DCBX_PARAM_VER_OPER_HOST' val=0
	'MLX5E_DCBX_PARAM_VER_OPER_AUTO' val=3
[139813] ENUM 'dbg_rsc_type' encoding=UNSIGNED size=4 vlen=3
	'MLX5_DBG_RSC_QP' val=0
	'MLX5_DBG_RSC_EQ' val=1
	'MLX5_DBG_RSC_CQ' val=2
[139814] STRUCT 'mlx5_field_desc' size=4 vlen=1
	'i' type_id=13 bits_offset=0
[139815] STRUCT 'mlx5_rsc_debug' size=32 vlen=5
	'dev' type_id=139673 bits_offset=0
	'object' type_id=64 bits_offset=64
	'type' type_id=139813 bits_offset=128
	'root' type_id=912 bits_offset=192
	'fields' type_id=139816 bits_offset=256
[139816] ARRAY '(anon)' type_id=139814 index_type_id=13 nr_elems=0
[139817] STRUCT 'mlx5_buf_list' size=16 vlen=2
	'buf' type_id=64 bits_offset=0
	'map' type_id=3718 bits_offset=64
[139818] STRUCT 'mlx5_frag_buf' size=24 vlen=4
	'frags' type_id=139819 bits_offset=0
	'npages' type_id=13 bits_offset=64
	'size' type_id=13 bits_offset=96
	'page_shift' type_id=19 bits_offset=128
[139819] PTR '(anon)' type_id=139817
[139820] STRUCT 'mlx5_frag_buf_ctrl' size=24 vlen=7
	'frags' type_id=139819 bits_offset=0
	'sz_m1' type_id=21 bits_offset=64
	'frag_sz_m1' type_id=20 bits_offset=96
	'strides_offset' type_id=20 bits_offset=112
	'log_sz' type_id=19 bits_offset=128
	'log_stride' type_id=19 bits_offset=136
	'log_frag_strides' type_id=19 bits_offset=144
[139821] UNION '(anon)' size=8 vlen=2
	'pgdir' type_id=139822 bits_offset=0
	'user_page' type_id=139824 bits_offset=0
[139822] PTR '(anon)' type_id=146471
[139823] FWD 'mlx5_ib_user_db_page' fwd_kind=struct
[139824] PTR '(anon)' type_id=139823
[139825] STRUCT 'mlx5_db' size=32 vlen=4
	'db' type_id=8515 bits_offset=0
	'u' type_id=139821 bits_offset=64
	'dma' type_id=3718 bits_offset=128
	'index' type_id=13 bits_offset=192
[139826] UNION '(anon)' size=4 vlen=4
	'general_id' type_id=1851 bits_offset=0
	'imm' type_id=1851 bits_offset=0
	'umr_mkey' type_id=1851 bits_offset=0
	'tis_tir_num' type_id=1851 bits_offset=0
[139827] STRUCT '(anon)' size=8 vlen=4
	'signature' type_id=19 bits_offset=0
	'rsvd' type_id=2689 bits_offset=8
	'fm_ce_se' type_id=19 bits_offset=24
	'(anon)' type_id=139826 bits_offset=32
[139828] UNION '(anon)' size=8 vlen=2
	'(anon)' type_id=139827 bits_offset=0
	'trailer' type_id=139827 bits_offset=0
[139829] STRUCT 'mlx5_wqe_ctrl_seg' size=16 vlen=3
	'opmod_idx_opcode' type_id=1851 bits_offset=0
	'qpn_ds' type_id=1851 bits_offset=32
	'(anon)' type_id=139828 bits_offset=64
[139830] UNION '(anon)' size=2 vlen=2
	'start' type_id=2689 bits_offset=0
	'(anon)' type_id=21421 bits_offset=0
[139831] STRUCT '(anon)' size=4 vlen=2
	'sz' type_id=1850 bits_offset=0
	'(anon)' type_id=139830 bits_offset=16
[139832] STRUCT '(anon)' size=4 vlen=2
	'type' type_id=1850 bits_offset=0
	'vlan_tci' type_id=1850 bits_offset=16
[139833] UNION '(anon)' size=4 vlen=3
	'inline_hdr' type_id=139831 bits_offset=0
	'insert' type_id=139832 bits_offset=0
	'trailer' type_id=1851 bits_offset=0
[139834] STRUCT 'mlx5_wqe_eth_seg' size=16 vlen=9
	'swp_outer_l4_offset' type_id=19 bits_offset=0
	'swp_outer_l3_offset' type_id=19 bits_offset=8
	'swp_inner_l4_offset' type_id=19 bits_offset=16
	'swp_inner_l3_offset' type_id=19 bits_offset=24
	'cs_flags' type_id=19 bits_offset=32
	'swp_flags' type_id=19 bits_offset=40
	'mss' type_id=1850 bits_offset=48
	'flow_table_metadata' type_id=1851 bits_offset=64
	'(anon)' type_id=139833 bits_offset=96
[139835] STRUCT 'mlx5_wqe_data_seg' size=16 vlen=3
	'byte_count' type_id=1851 bits_offset=0
	'lkey' type_id=1851 bits_offset=32
	'addr' type_id=6867 bits_offset=64
[139836] UNION '(anon)' size=2 vlen=2
	'xlt_offset' type_id=1850 bits_offset=0
	'bsf_octowords' type_id=1850 bits_offset=0
[139837] STRUCT 'mlx5_wqe_umr_ctrl_seg' size=48 vlen=7
	'flags' type_id=19 bits_offset=0
	'rsvd0' type_id=401 bits_offset=8
	'xlt_octowords' type_id=1850 bits_offset=32
	'(anon)' type_id=139836 bits_offset=48
	'mkey_mask' type_id=6867 bits_offset=64
	'xlt_offset_47_16' type_id=1851 bits_offset=128
	'rsvd1' type_id=139769 bits_offset=160
[139838] STRUCT 'mlx5_mtt' size=8 vlen=1
	'ptag' type_id=6867 bits_offset=0
[139839] STRUCT 'mlx5_klm' size=16 vlen=3
	'bcount' type_id=1851 bits_offset=0
	'key' type_id=1851 bits_offset=32
	'va' type_id=6867 bits_offset=64
[139840] STRUCT 'mlx5_ksm' size=16 vlen=3
	'reserved' type_id=1851 bits_offset=0
	'key' type_id=1851 bits_offset=32
	'va' type_id=6867 bits_offset=64
[139841] PTR '(anon)' type_id=139815
[139842] STRUCT '(anon)' size=32 vlen=3
	'list' type_id=54 bits_offset=0
	'comp' type_id=139847 bits_offset=128
	'priv' type_id=64 bits_offset=192
[139843] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=139844
	'(anon)' type_id=139846
[139844] PTR '(anon)' type_id=139845
[139845] STRUCT 'mlx5_core_cq' size=192 vlen=20
	'cqn' type_id=21 bits_offset=0
	'cqe_sz' type_id=13 bits_offset=32
	'set_ci_db' type_id=8515 bits_offset=64
	'arm_db' type_id=8515 bits_offset=128
	'uar' type_id=139693 bits_offset=192
	'refcount' type_id=178 bits_offset=256
	'free' type_id=508 bits_offset=320
	'vector' type_id=6 bits_offset=576
	'irqn' type_id=6 bits_offset=608
	'comp' type_id=139847 bits_offset=640
	'event' type_id=139849 bits_offset=704
	'cons_index' type_id=21 bits_offset=768
	'arm_sn' type_id=6 bits_offset=800
	'dbg' type_id=139841 bits_offset=832
	'pid' type_id=13 bits_offset=896
	'tasklet_ctx' type_id=139842 bits_offset=960
	'reset_notify_added' type_id=13 bits_offset=1216
	'reset_notify' type_id=54 bits_offset=1280
	'eq' type_id=139850 bits_offset=1408
	'uid' type_id=20 bits_offset=1472
[139846] PTR '(anon)' type_id=139800
[139847] PTR '(anon)' type_id=139843
[139848] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=139844
	'(anon)' type_id=139772
[139849] PTR '(anon)' type_id=139848
[139850] PTR '(anon)' type_id=140546
[139851] STRUCT 'mlx5_wq_ctrl' size=64 vlen=3
	'mdev' type_id=139673 bits_offset=0
	'buf' type_id=139818 bits_offset=64
	'db' type_id=139825 bits_offset=256
[139852] STRUCT 'mlx5_wq_cyc' size=40 vlen=5
	'fbc' type_id=139820 bits_offset=0
	'db' type_id=8515 bits_offset=192
	'sz' type_id=20 bits_offset=256
	'wqe_ctr' type_id=20 bits_offset=272
	'cur_sz' type_id=20 bits_offset=288
[139853] STRUCT 'mlx5_cqwq' size=40 vlen=3
	'fbc' type_id=139820 bits_offset=0
	'db' type_id=8515 bits_offset=192
	'cc' type_id=21 bits_offset=256
[139854] STRUCT 'mlx5_wq_ll' size=48 vlen=6
	'fbc' type_id=139820 bits_offset=0
	'db' type_id=8515 bits_offset=192
	'tail_next' type_id=8386 bits_offset=256
	'head' type_id=20 bits_offset=320
	'wqe_ctr' type_id=20 bits_offset=336
	'cur_sz' type_id=20 bits_offset=352
[139855] STRUCT 'mlx5e_stats_grp' size=40 vlen=5
	'update_stats_mask' type_id=20 bits_offset=0
	'get_num_stats' type_id=139860 bits_offset=64
	'fill_strings' type_id=139862 bits_offset=128
	'fill_stats' type_id=139864 bits_offset=192
	'update_stats' type_id=139866 bits_offset=256
[139856] CONST '(anon)' type_id=139855
[139857] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=139858
[139858] PTR '(anon)' type_id=139859
[139859] STRUCT 'mlx5e_priv' size=20160 vlen=52
	'selq' type_id=139894 bits_offset=0
	'txq2sq' type_id=140001 bits_offset=256
	'dcbx_dp' type_id=139889 bits_offset=320
	'state' type_id=1 bits_offset=896
	'state_lock' type_id=155 bits_offset=960
	'drop_rq' type_id=139966 bits_offset=1536
	'channels' type_id=140003 bits_offset=12800
	'rx_res' type_id=140015 bits_offset=15808
	'tx_rates' type_id=96 bits_offset=15872
	'fs' type_id=140016 bits_offset=15936
	'wq' type_id=542 bits_offset=16000
	'update_carrier_work' type_id=540 bits_offset=16064
	'set_rx_mode_work' type_id=540 bits_offset=16320
	'tx_timeout_work' type_id=540 bits_offset=16576
	'update_stats_work' type_id=540 bits_offset=16832
	'monitor_counters_work' type_id=540 bits_offset=17088
	'monitor_counters_nb' type_id=139666 bits_offset=17344
	'mdev' type_id=139673 bits_offset=17600
	'netdev' type_id=1996 bits_offset=17664
	'en_trap' type_id=140017 bits_offset=17728
	'stats' type_id=139885 bits_offset=17792
	'channel_stats' type_id=140018 bits_offset=98880
	'trap_stats' type_id=140006 bits_offset=99328
	'ptp_stats' type_id=140008 bits_offset=130560
	'htb_qos_sq_stats' type_id=140020 bits_offset=157696
	'htb_max_qos_sqs' type_id=20 bits_offset=157760
	'stats_nch' type_id=20 bits_offset=157776
	'max_nch' type_id=20 bits_offset=157792
	'max_opened_tc' type_id=19 bits_offset=157808
	'tx_ptp_opened' type_id=42 bits_offset=157816
	'rx_ptp_opened' type_id=42 bits_offset=157824
	'tstamp' type_id=23360 bits_offset=157856
	'q_counter' type_id=20 bits_offset=157952
	'drop_rq_q_counter' type_id=20 bits_offset=157968
	'events_nb' type_id=1865 bits_offset=158016
	'blocking_events_nb' type_id=1865 bits_offset=158208
	'nic_info' type_id=22764 bits_offset=158400
	'dcbx' type_id=139888 bits_offset=158976
	'profile' type_id=140023 bits_offset=159424
	'ppriv' type_id=64 bits_offset=159488
	'macsec' type_id=140024 bits_offset=159552
	'ipsec' type_id=140025 bits_offset=159616
	'tls' type_id=140026 bits_offset=159680
	'tx_reporter' type_id=25060 bits_offset=159744
	'rx_reporter' type_id=25060 bits_offset=159808
	'xsk' type_id=139912 bits_offset=159872
	'stats_agent' type_id=140011 bits_offset=160000
	'scratchpad' type_id=140014 bits_offset=160896
	'htb' type_id=140027 bits_offset=160960
	'mqprio_rl' type_id=140028 bits_offset=161024
	'dfs_root' type_id=912 bits_offset=161088
	'devcom' type_id=139723 bits_offset=161152
[139860] PTR '(anon)' type_id=139857
[139861] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=139858
	'(anon)' type_id=2241
	'(anon)' type_id=13
[139862] PTR '(anon)' type_id=139861
[139863] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=139858
	'(anon)' type_id=1473
	'(anon)' type_id=13
[139864] PTR '(anon)' type_id=139863
[139865] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=139858
[139866] PTR '(anon)' type_id=139865
[139867] TYPEDEF 'mlx5e_stats_grp_t' type_id=139869
[139868] PTR '(anon)' type_id=139856
[139869] CONST '(anon)' type_id=139868
[139870] STRUCT 'mlx5e_sw_stats' size=1024 vlen=128
	'rx_packets' type_id=23 bits_offset=0
	'rx_bytes' type_id=23 bits_offset=64
	'tx_packets' type_id=23 bits_offset=128
	'tx_bytes' type_id=23 bits_offset=192
	'tx_tso_packets' type_id=23 bits_offset=256
	'tx_tso_bytes' type_id=23 bits_offset=320
	'tx_tso_inner_packets' type_id=23 bits_offset=384
	'tx_tso_inner_bytes' type_id=23 bits_offset=448
	'tx_added_vlan_packets' type_id=23 bits_offset=512
	'tx_nop' type_id=23 bits_offset=576
	'tx_mpwqe_blks' type_id=23 bits_offset=640
	'tx_mpwqe_pkts' type_id=23 bits_offset=704
	'rx_lro_packets' type_id=23 bits_offset=768
	'rx_lro_bytes' type_id=23 bits_offset=832
	'rx_gro_packets' type_id=23 bits_offset=896
	'rx_gro_bytes' type_id=23 bits_offset=960
	'rx_gro_skbs' type_id=23 bits_offset=1024
	'rx_gro_match_packets' type_id=23 bits_offset=1088
	'rx_gro_large_hds' type_id=23 bits_offset=1152
	'rx_mcast_packets' type_id=23 bits_offset=1216
	'rx_ecn_mark' type_id=23 bits_offset=1280
	'rx_removed_vlan_packets' type_id=23 bits_offset=1344
	'rx_csum_unnecessary' type_id=23 bits_offset=1408
	'rx_csum_none' type_id=23 bits_offset=1472
	'rx_csum_complete' type_id=23 bits_offset=1536
	'rx_csum_complete_tail' type_id=23 bits_offset=1600
	'rx_csum_complete_tail_slow' type_id=23 bits_offset=1664
	'rx_csum_unnecessary_inner' type_id=23 bits_offset=1728
	'rx_xdp_drop' type_id=23 bits_offset=1792
	'rx_xdp_redirect' type_id=23 bits_offset=1856
	'rx_xdp_tx_xmit' type_id=23 bits_offset=1920
	'rx_xdp_tx_mpwqe' type_id=23 bits_offset=1984
	'rx_xdp_tx_inlnw' type_id=23 bits_offset=2048
	'rx_xdp_tx_nops' type_id=23 bits_offset=2112
	'rx_xdp_tx_full' type_id=23 bits_offset=2176
	'rx_xdp_tx_err' type_id=23 bits_offset=2240
	'rx_xdp_tx_cqe' type_id=23 bits_offset=2304
	'tx_csum_none' type_id=23 bits_offset=2368
	'tx_csum_partial' type_id=23 bits_offset=2432
	'tx_csum_partial_inner' type_id=23 bits_offset=2496
	'tx_queue_stopped' type_id=23 bits_offset=2560
	'tx_queue_dropped' type_id=23 bits_offset=2624
	'tx_xmit_more' type_id=23 bits_offset=2688
	'tx_recover' type_id=23 bits_offset=2752
	'tx_cqes' type_id=23 bits_offset=2816
	'tx_queue_wake' type_id=23 bits_offset=2880
	'tx_cqe_err' type_id=23 bits_offset=2944
	'tx_xdp_xmit' type_id=23 bits_offset=3008
	'tx_xdp_mpwqe' type_id=23 bits_offset=3072
	'tx_xdp_inlnw' type_id=23 bits_offset=3136
	'tx_xdp_nops' type_id=23 bits_offset=3200
	'tx_xdp_full' type_id=23 bits_offset=3264
	'tx_xdp_err' type_id=23 bits_offset=3328
	'tx_xdp_cqes' type_id=23 bits_offset=3392
	'rx_wqe_err' type_id=23 bits_offset=3456
	'rx_mpwqe_filler_cqes' type_id=23 bits_offset=3520
	'rx_mpwqe_filler_strides' type_id=23 bits_offset=3584
	'rx_oversize_pkts_sw_drop' type_id=23 bits_offset=3648
	'rx_buff_alloc_err' type_id=23 bits_offset=3712
	'rx_cqe_compress_blks' type_id=23 bits_offset=3776
	'rx_cqe_compress_pkts' type_id=23 bits_offset=3840
	'rx_congst_umr' type_id=23 bits_offset=3904
	'rx_arfs_add' type_id=23 bits_offset=3968
	'rx_arfs_request_in' type_id=23 bits_offset=4032
	'rx_arfs_request_out' type_id=23 bits_offset=4096
	'rx_arfs_expired' type_id=23 bits_offset=4160
	'rx_arfs_err' type_id=23 bits_offset=4224
	'rx_recover' type_id=23 bits_offset=4288
	'ch_events' type_id=23 bits_offset=4352
	'ch_poll' type_id=23 bits_offset=4416
	'ch_arm' type_id=23 bits_offset=4480
	'ch_aff_change' type_id=23 bits_offset=4544
	'ch_force_irq' type_id=23 bits_offset=4608
	'ch_eq_rearm' type_id=23 bits_offset=4672
	'rx_pp_alloc_fast' type_id=23 bits_offset=4736
	'rx_pp_alloc_slow' type_id=23 bits_offset=4800
	'rx_pp_alloc_slow_high_order' type_id=23 bits_offset=4864
	'rx_pp_alloc_empty' type_id=23 bits_offset=4928
	'rx_pp_alloc_refill' type_id=23 bits_offset=4992
	'rx_pp_alloc_waive' type_id=23 bits_offset=5056
	'rx_pp_recycle_cached' type_id=23 bits_offset=5120
	'rx_pp_recycle_cache_full' type_id=23 bits_offset=5184
	'rx_pp_recycle_ring' type_id=23 bits_offset=5248
	'rx_pp_recycle_ring_full' type_id=23 bits_offset=5312
	'rx_pp_recycle_released_ref' type_id=23 bits_offset=5376
	'tx_tls_encrypted_packets' type_id=23 bits_offset=5440
	'tx_tls_encrypted_bytes' type_id=23 bits_offset=5504
	'tx_tls_ooo' type_id=23 bits_offset=5568
	'tx_tls_dump_packets' type_id=23 bits_offset=5632
	'tx_tls_dump_bytes' type_id=23 bits_offset=5696
	'tx_tls_resync_bytes' type_id=23 bits_offset=5760
	'tx_tls_skip_no_sync_data' type_id=23 bits_offset=5824
	'tx_tls_drop_no_sync_data' type_id=23 bits_offset=5888
	'tx_tls_drop_bypass_req' type_id=23 bits_offset=5952
	'rx_tls_decrypted_packets' type_id=23 bits_offset=6016
	'rx_tls_decrypted_bytes' type_id=23 bits_offset=6080
	'rx_tls_resync_req_pkt' type_id=23 bits_offset=6144
	'rx_tls_resync_req_start' type_id=23 bits_offset=6208
	'rx_tls_resync_req_end' type_id=23 bits_offset=6272
	'rx_tls_resync_req_skip' type_id=23 bits_offset=6336
	'rx_tls_resync_res_ok' type_id=23 bits_offset=6400
	'rx_tls_resync_res_retry' type_id=23 bits_offset=6464
	'rx_tls_resync_res_skip' type_id=23 bits_offset=6528
	'rx_tls_err' type_id=23 bits_offset=6592
	'rx_xsk_packets' type_id=23 bits_offset=6656
	'rx_xsk_bytes' type_id=23 bits_offset=6720
	'rx_xsk_csum_complete' type_id=23 bits_offset=6784
	'rx_xsk_csum_unnecessary' type_id=23 bits_offset=6848
	'rx_xsk_csum_unnecessary_inner' type_id=23 bits_offset=6912
	'rx_xsk_csum_none' type_id=23 bits_offset=6976
	'rx_xsk_ecn_mark' type_id=23 bits_offset=7040
	'rx_xsk_removed_vlan_packets' type_id=23 bits_offset=7104
	'rx_xsk_xdp_drop' type_id=23 bits_offset=7168
	'rx_xsk_xdp_redirect' type_id=23 bits_offset=7232
	'rx_xsk_wqe_err' type_id=23 bits_offset=7296
	'rx_xsk_mpwqe_filler_cqes' type_id=23 bits_offset=7360
	'rx_xsk_mpwqe_filler_strides' type_id=23 bits_offset=7424
	'rx_xsk_oversize_pkts_sw_drop' type_id=23 bits_offset=7488
	'rx_xsk_buff_alloc_err' type_id=23 bits_offset=7552
	'rx_xsk_cqe_compress_blks' type_id=23 bits_offset=7616
	'rx_xsk_cqe_compress_pkts' type_id=23 bits_offset=7680
	'rx_xsk_congst_umr' type_id=23 bits_offset=7744
	'tx_xsk_xmit' type_id=23 bits_offset=7808
	'tx_xsk_mpwqe' type_id=23 bits_offset=7872
	'tx_xsk_inlnw' type_id=23 bits_offset=7936
	'tx_xsk_full' type_id=23 bits_offset=8000
	'tx_xsk_err' type_id=23 bits_offset=8064
	'tx_xsk_cqes' type_id=23 bits_offset=8128
[139871] STRUCT 'mlx5e_qcounter_stats' size=8 vlen=2
	'rx_out_of_buffer' type_id=21 bits_offset=0
	'rx_if_down_packets' type_id=21 bits_offset=32
[139872] STRUCT 'mlx5e_vnic_env_stats' size=528 vlen=1
	'query_vnic_env_out' type_id=139873 bits_offset=0
[139873] ARRAY '(anon)' type_id=6867 index_type_id=13 nr_elems=66
[139874] STRUCT 'mlx5e_vport_stats' size=528 vlen=1
	'query_vport_out' type_id=139873 bits_offset=0
[139875] STRUCT 'mlx5e_pport_stats' size=7680 vlen=9
	'IEEE_802_3_counters' type_id=139876 bits_offset=0
	'RFC_2863_counters' type_id=139876 bits_offset=2048
	'RFC_2819_counters' type_id=139876 bits_offset=4096
	'per_prio_counters' type_id=139877 bits_offset=6144
	'phy_counters' type_id=139876 bits_offset=22528
	'phy_statistical_counters' type_id=139876 bits_offset=24576
	'eth_ext_counters' type_id=139876 bits_offset=26624
	'per_tc_prio_counters' type_id=139877 bits_offset=28672
	'per_tc_congest_prio_counters' type_id=139877 bits_offset=45056
[139876] ARRAY '(anon)' type_id=6867 index_type_id=13 nr_elems=32
[139877] ARRAY '(anon)' type_id=6867 index_type_id=13 nr_elems=256
[139878] STRUCT 'mlx5e_pcie_stats' size=256 vlen=1
	'pcie_perf_counters' type_id=139876 bits_offset=0
[139879] STRUCT 'mlx5e_rq_stats' size=440 vlen=55
	'packets' type_id=23 bits_offset=0
	'bytes' type_id=23 bits_offset=64
	'csum_complete' type_id=23 bits_offset=128
	'csum_complete_tail' type_id=23 bits_offset=192
	'csum_complete_tail_slow' type_id=23 bits_offset=256
	'csum_unnecessary' type_id=23 bits_offset=320
	'csum_unnecessary_inner' type_id=23 bits_offset=384
	'csum_none' type_id=23 bits_offset=448
	'lro_packets' type_id=23 bits_offset=512
	'lro_bytes' type_id=23 bits_offset=576
	'gro_packets' type_id=23 bits_offset=640
	'gro_bytes' type_id=23 bits_offset=704
	'gro_skbs' type_id=23 bits_offset=768
	'gro_match_packets' type_id=23 bits_offset=832
	'gro_large_hds' type_id=23 bits_offset=896
	'mcast_packets' type_id=23 bits_offset=960
	'ecn_mark' type_id=23 bits_offset=1024
	'removed_vlan_packets' type_id=23 bits_offset=1088
	'xdp_drop' type_id=23 bits_offset=1152
	'xdp_redirect' type_id=23 bits_offset=1216
	'wqe_err' type_id=23 bits_offset=1280
	'mpwqe_filler_cqes' type_id=23 bits_offset=1344
	'mpwqe_filler_strides' type_id=23 bits_offset=1408
	'oversize_pkts_sw_drop' type_id=23 bits_offset=1472
	'buff_alloc_err' type_id=23 bits_offset=1536
	'cqe_compress_blks' type_id=23 bits_offset=1600
	'cqe_compress_pkts' type_id=23 bits_offset=1664
	'congst_umr' type_id=23 bits_offset=1728
	'arfs_add' type_id=23 bits_offset=1792
	'arfs_request_in' type_id=23 bits_offset=1856
	'arfs_request_out' type_id=23 bits_offset=1920
	'arfs_expired' type_id=23 bits_offset=1984
	'arfs_err' type_id=23 bits_offset=2048
	'recover' type_id=23 bits_offset=2112
	'pp_alloc_fast' type_id=23 bits_offset=2176
	'pp_alloc_slow' type_id=23 bits_offset=2240
	'pp_alloc_slow_high_order' type_id=23 bits_offset=2304
	'pp_alloc_empty' type_id=23 bits_offset=2368
	'pp_alloc_refill' type_id=23 bits_offset=2432
	'pp_alloc_waive' type_id=23 bits_offset=2496
	'pp_recycle_cached' type_id=23 bits_offset=2560
	'pp_recycle_cache_full' type_id=23 bits_offset=2624
	'pp_recycle_ring' type_id=23 bits_offset=2688
	'pp_recycle_ring_full' type_id=23 bits_offset=2752
	'pp_recycle_released_ref' type_id=23 bits_offset=2816
	'tls_decrypted_packets' type_id=23 bits_offset=2880
	'tls_decrypted_bytes' type_id=23 bits_offset=2944
	'tls_resync_req_pkt' type_id=23 bits_offset=3008
	'tls_resync_req_start' type_id=23 bits_offset=3072
	'tls_resync_req_end' type_id=23 bits_offset=3136
	'tls_resync_req_skip' type_id=23 bits_offset=3200
	'tls_resync_res_ok' type_id=23 bits_offset=3264
	'tls_resync_res_retry' type_id=23 bits_offset=3328
	'tls_resync_res_skip' type_id=23 bits_offset=3392
	'tls_err' type_id=23 bits_offset=3456
[139880] STRUCT 'mlx5e_sq_stats' size=320 vlen=29
	'packets' type_id=23 bits_offset=0
	'bytes' type_id=23 bits_offset=64
	'xmit_more' type_id=23 bits_offset=128
	'tso_packets' type_id=23 bits_offset=192
	'tso_bytes' type_id=23 bits_offset=256
	'tso_inner_packets' type_id=23 bits_offset=320
	'tso_inner_bytes' type_id=23 bits_offset=384
	'csum_partial' type_id=23 bits_offset=448
	'csum_partial_inner' type_id=23 bits_offset=512
	'added_vlan_packets' type_id=23 bits_offset=576
	'nop' type_id=23 bits_offset=640
	'mpwqe_blks' type_id=23 bits_offset=704
	'mpwqe_pkts' type_id=23 bits_offset=768
	'tls_encrypted_packets' type_id=23 bits_offset=832
	'tls_encrypted_bytes' type_id=23 bits_offset=896
	'tls_ooo' type_id=23 bits_offset=960
	'tls_dump_packets' type_id=23 bits_offset=1024
	'tls_dump_bytes' type_id=23 bits_offset=1088
	'tls_resync_bytes' type_id=23 bits_offset=1152
	'tls_skip_no_sync_data' type_id=23 bits_offset=1216
	'tls_drop_no_sync_data' type_id=23 bits_offset=1280
	'tls_drop_bypass_req' type_id=23 bits_offset=1344
	'csum_none' type_id=23 bits_offset=1408
	'stopped' type_id=23 bits_offset=1472
	'dropped' type_id=23 bits_offset=1536
	'recover' type_id=23 bits_offset=1600
	'cqes' type_id=23 bits_offset=2048
	'wake' type_id=23 bits_offset=2112
	'cqe_err' type_id=23 bits_offset=2176
[139881] STRUCT 'mlx5e_xdpsq_stats' size=128 vlen=7
	'xmit' type_id=23 bits_offset=0
	'mpwqe' type_id=23 bits_offset=64
	'inlnw' type_id=23 bits_offset=128
	'nops' type_id=23 bits_offset=192
	'full' type_id=23 bits_offset=256
	'err' type_id=23 bits_offset=320
	'cqes' type_id=23 bits_offset=512
[139882] STRUCT 'mlx5e_ch_stats' size=48 vlen=6
	'events' type_id=23 bits_offset=0
	'poll' type_id=23 bits_offset=64
	'arm' type_id=23 bits_offset=128
	'aff_change' type_id=23 bits_offset=192
	'force_irq' type_id=23 bits_offset=256
	'eq_rearm' type_id=23 bits_offset=320
[139883] STRUCT 'mlx5e_ptp_cq_stats' size=40 vlen=5
	'cqe' type_id=23 bits_offset=0
	'err_cqe' type_id=23 bits_offset=64
	'abort' type_id=23 bits_offset=128
	'abort_abs_diff_ns' type_id=23 bits_offset=192
	'late_cqe' type_id=23 bits_offset=256
[139884] STRUCT 'mlx5e_rep_stats' size=112 vlen=14
	'vport_rx_packets' type_id=23 bits_offset=0
	'vport_tx_packets' type_id=23 bits_offset=64
	'vport_rx_bytes' type_id=23 bits_offset=128
	'vport_tx_bytes' type_id=23 bits_offset=192
	'rx_vport_rdma_unicast_packets' type_id=23 bits_offset=256
	'tx_vport_rdma_unicast_packets' type_id=23 bits_offset=320
	'rx_vport_rdma_unicast_bytes' type_id=23 bits_offset=384
	'tx_vport_rdma_unicast_bytes' type_id=23 bits_offset=448
	'rx_vport_rdma_multicast_packets' type_id=23 bits_offset=512
	'tx_vport_rdma_multicast_packets' type_id=23 bits_offset=576
	'rx_vport_rdma_multicast_bytes' type_id=23 bits_offset=640
	'tx_vport_rdma_multicast_bytes' type_id=23 bits_offset=704
	'vport_loopback_packets' type_id=23 bits_offset=768
	'vport_loopback_bytes' type_id=23 bits_offset=832
[139885] STRUCT 'mlx5e_stats' size=10136 vlen=7
	'sw' type_id=139870 bits_offset=0
	'qcnt' type_id=139871 bits_offset=8192
	'vnic' type_id=139872 bits_offset=8256
	'vport' type_id=139874 bits_offset=12480
	'pport' type_id=139875 bits_offset=16704
	'pcie' type_id=139878 bits_offset=78144
	'rep_stats' type_id=139884 bits_offset=80192
[139886] STRUCT 'mlx5e_cee_config' size=25 vlen=4
	'pg_bw_pct' type_id=7469 bits_offset=0
	'prio_to_pg_map' type_id=7469 bits_offset=64
	'pfc_setting' type_id=139887 bits_offset=128
	'pfc_enable' type_id=42 bits_offset=192
[139887] ARRAY '(anon)' type_id=42 index_type_id=13 nr_elems=8
[139888] STRUCT 'mlx5e_dcbx' size=52 vlen=9
	'mode' type_id=139812 bits_offset=0
	'cee_cfg' type_id=139886 bits_offset=32
	'dscp_app_cnt' type_id=19 bits_offset=232
	'tc_tsa' type_id=7469 bits_offset=240
	'cap' type_id=19 bits_offset=304
	'manual_buffer' type_id=42 bits_offset=312
	'cable_len' type_id=21 bits_offset=320
	'xoff' type_id=21 bits_offset=352
	'port_buff_cell_sz' type_id=20 bits_offset=384
[139889] STRUCT 'mlx5e_dcbx_dp' size=65 vlen=2
	'dscp2prio' type_id=1843 bits_offset=0
	'trust_state' type_id=19 bits_offset=512
[139890] TYPEDEF 'cqe_ts_to_ns' type_id=139891
[139891] PTR '(anon)' type_id=139892
[139892] FUNC_PROTO '(anon)' ret_type_id=48 vlen=2
	'(anon)' type_id=139893
	'(anon)' type_id=23
[139893] PTR '(anon)' type_id=139739
[139894] STRUCT 'mlx5e_selq' size=32 vlen=4
	'active' type_id=139895 bits_offset=0
	'standby' type_id=139895 bits_offset=64
	'state_lock' type_id=2798 bits_offset=128
	'is_prepared' type_id=42 bits_offset=192
[139895] PTR '(anon)' type_id=144191
[139896] STRUCT 'mlx5e_tx_wqe' size=32 vlen=3
	'ctrl' type_id=139829 bits_offset=0
	'eth' type_id=139834 bits_offset=128
	'data' type_id=139897 bits_offset=256
[139897] ARRAY '(anon)' type_id=139835 index_type_id=13 nr_elems=0
[139898] STRUCT '(anon)' size=0 vlen=2
	'__empty_inline_mtts' type_id=526 bits_offset=0
	'inline_mtts' type_id=139899 bits_offset=0
[139899] ARRAY '(anon)' type_id=139838 index_type_id=13 nr_elems=0
[139900] STRUCT '(anon)' size=0 vlen=2
	'__empty_inline_klms' type_id=526 bits_offset=0
	'inline_klms' type_id=139901 bits_offset=0
[139901] ARRAY '(anon)' type_id=139839 index_type_id=13 nr_elems=0
[139902] STRUCT '(anon)' size=0 vlen=2
	'__empty_inline_ksms' type_id=526 bits_offset=0
	'inline_ksms' type_id=139903 bits_offset=0
[139903] ARRAY '(anon)' type_id=139840 index_type_id=13 nr_elems=0
[139904] UNION '(anon)' size=0 vlen=3
	'(anon)' type_id=139898 bits_offset=0
	'(anon)' type_id=139900 bits_offset=0
	'(anon)' type_id=139902 bits_offset=0
[139905] STRUCT 'mlx5e_umr_wqe' size=128 vlen=4
	'ctrl' type_id=139829 bits_offset=0
	'uctrl' type_id=139837 bits_offset=128
	'mkc' type_id=139811 bits_offset=512
	'(anon)' type_id=139904 bits_offset=1024
[139906] ENUM 'packet_merge' encoding=UNSIGNED size=4 vlen=3
	'MLX5E_PACKET_MERGE_NONE' val=0
	'MLX5E_PACKET_MERGE_LRO' val=1
	'MLX5E_PACKET_MERGE_SHAMPO' val=2
[139907] STRUCT '(anon)' size=2 vlen=2
	'match_criteria_type' type_id=19 bits_offset=0
	'alignment_granularity' type_id=19 bits_offset=8
[139908] STRUCT 'mlx5e_packet_merge_param' size=12 vlen=3
	'type' type_id=139906 bits_offset=0
	'timeout' type_id=21 bits_offset=32
	'shampo' type_id=139907 bits_offset=64
[139909] STRUCT '(anon)' size=192 vlen=2
	'max_rate' type_id=2872 bits_offset=0
	'hw_id' type_id=2555 bits_offset=1024
[139910] STRUCT '(anon)' size=264 vlen=4
	'mode' type_id=20 bits_offset=0
	'num_tc' type_id=19 bits_offset=16
	'tc_to_txq' type_id=8089 bits_offset=32
	'channel' type_id=139909 bits_offset=576
[139911] STRUCT 'mlx5e_params' size=352 vlen=21
	'log_sq_size' type_id=19 bits_offset=0
	'rq_wq_type' type_id=19 bits_offset=8
	'log_rq_mtu_frames' type_id=19 bits_offset=16
	'num_channels' type_id=20 bits_offset=32
	'mqprio' type_id=139910 bits_offset=64
	'rx_cqe_compress_def' type_id=42 bits_offset=2176
	'rx_cq_moderation' type_id=91843 bits_offset=2192
	'tx_cq_moderation' type_id=91843 bits_offset=2256
	'packet_merge' type_id=139908 bits_offset=2336
	'tx_min_inline_mode' type_id=19 bits_offset=2432
	'vlan_strip_disable' type_id=42 bits_offset=2440
	'scatter_fcs_en' type_id=42 bits_offset=2448
	'rx_dim_enabled' type_id=42 bits_offset=2456
	'tx_dim_enabled' type_id=42 bits_offset=2464
	'pflags' type_id=21 bits_offset=2496
	'xdp_prog' type_id=1719 bits_offset=2560
	'xsk' type_id=139913 bits_offset=2624
	'sw_mtu' type_id=6 bits_offset=2688
	'hard_mtu' type_id=13 bits_offset=2720
	'ptp_rx' type_id=42 bits_offset=2752
	'terminate_lkey_be' type_id=1851 bits_offset=2784
[139912] STRUCT 'mlx5e_xsk' size=16 vlen=3
	'pools' type_id=140013 bits_offset=0
	'refcnt' type_id=20 bits_offset=64
	'ever_used' type_id=42 bits_offset=80
[139913] PTR '(anon)' type_id=139912
[139914] STRUCT 'mlx5e_cq' size=384 vlen=9
	'wq' type_id=139853 bits_offset=0
	'event_ctr' type_id=20 bits_offset=320
	'napi' type_id=7843 bits_offset=384
	'mcq' type_id=139845 bits_offset=448
	'ch_stats' type_id=139915 bits_offset=1984
	'netdev' type_id=1996 bits_offset=2048
	'mdev' type_id=139673 bits_offset=2112
	'workqueue' type_id=542 bits_offset=2176
	'wq_ctrl' type_id=139851 bits_offset=2240
[139915] PTR '(anon)' type_id=139882
[139916] STRUCT 'mlx5e_cq_decomp' size=192 vlen=6
	'title' type_id=139806 bits_offset=0
	'mini_arr' type_id=139917 bits_offset=512
	'mini_arr_idx' type_id=19 bits_offset=1024
	'left' type_id=20 bits_offset=1040
	'wqe_counter' type_id=20 bits_offset=1056
	'last_cqe_title' type_id=42 bits_offset=1072
[139917] ARRAY '(anon)' type_id=139810 index_type_id=13 nr_elems=8
[139918] ENUM 'mlx5e_dma_map_type' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_DMA_MAP_SINGLE' val=0
	'MLX5E_DMA_MAP_PAGE' val=1
[139919] STRUCT 'mlx5e_sq_dma' size=16 vlen=3
	'addr' type_id=3718 bits_offset=0
	'size' type_id=21 bits_offset=64
	'type' type_id=139918 bits_offset=96
[139920] STRUCT 'mlx5e_tx_mpwqe' size=16 vlen=5
	'wqe' type_id=139921 bits_offset=0
	'bytes_count' type_id=21 bits_offset=64
	'ds_count' type_id=19 bits_offset=96
	'pkt_count' type_id=19 bits_offset=104
	'inline_on' type_id=19 bits_offset=112
[139921] PTR '(anon)' type_id=139896
[139922] STRUCT 'mlx5e_skb_fifo' size=32 vlen=4
	'fifo' type_id=7850 bits_offset=0
	'pc' type_id=5292 bits_offset=64
	'cc' type_id=5292 bits_offset=128
	'mask' type_id=20 bits_offset=192
[139923] STRUCT '(anon)' size=48 vlen=3
	'dma_fifo' type_id=139924 bits_offset=0
	'skb_fifo' type_id=139922 bits_offset=64
	'wqe_info' type_id=139925 bits_offset=320
[139924] PTR '(anon)' type_id=139919
[139925] PTR '(anon)' type_id=140783
[139926] STRUCT 'mlx5e_txqsq' size=960 vlen=35
	'cc' type_id=20 bits_offset=0
	'skb_fifo_cc' type_id=20 bits_offset=16
	'dma_fifo_cc' type_id=21 bits_offset=32
	'dim' type_id=24547 bits_offset=64
	'pc' type_id=20 bits_offset=1024
	'skb_fifo_pc' type_id=20 bits_offset=1040
	'dma_fifo_pc' type_id=21 bits_offset=1056
	'mpwqe' type_id=139920 bits_offset=1088
	'cq' type_id=139914 bits_offset=1536
	'wq' type_id=139852 bits_offset=4608
	'dma_fifo_mask' type_id=21 bits_offset=4928
	'stats' type_id=139927 bits_offset=4992
	'db' type_id=139923 bits_offset=5056
	'uar_map' type_id=64 bits_offset=5440
	'txq' type_id=8088 bits_offset=5504
	'sqn' type_id=21 bits_offset=5568
	'stop_room' type_id=20 bits_offset=5600
	'max_sq_mpw_wqebbs' type_id=19 bits_offset=5616
	'min_inline_mode' type_id=19 bits_offset=5624
	'pdev' type_id=782 bits_offset=5632
	'mkey_be' type_id=1851 bits_offset=5696
	'state' type_id=1 bits_offset=5760
	'hw_mtu' type_id=6 bits_offset=5824
	'clock' type_id=139893 bits_offset=5888
	'netdev' type_id=1996 bits_offset=5952
	'mdev' type_id=139673 bits_offset=6016
	'channel' type_id=139929 bits_offset=6080
	'priv' type_id=139858 bits_offset=6144
	'wq_ctrl' type_id=139851 bits_offset=6208
	'ch_ix' type_id=13 bits_offset=6720
	'txq_ix' type_id=13 bits_offset=6752
	'rate_limit' type_id=21 bits_offset=6784
	'recover_work' type_id=540 bits_offset=6848
	'ptpsq' type_id=139930 bits_offset=7104
	'ptp_cyc2time' type_id=139890 bits_offset=7168
[139927] PTR '(anon)' type_id=139880
[139928] STRUCT 'mlx5e_channel' size=14656 vlen=27
	'rq' type_id=139966 bits_offset=0
	'rq_xdpsq' type_id=139937 bits_offset=11264
	'sq' type_id=140000 bits_offset=17408
	'icosq' type_id=139948 bits_offset=78848
	'qos_sqs' type_id=140001 bits_offset=83968
	'xdp' type_id=42 bits_offset=84032
	'napi' type_id=7841 bits_offset=84096
	'pdev' type_id=782 bits_offset=87296
	'netdev' type_id=1996 bits_offset=87360
	'mkey_be' type_id=1851 bits_offset=87424
	'qos_sqs_size' type_id=20 bits_offset=87456
	'num_tc' type_id=19 bits_offset=87472
	'lag_port' type_id=19 bits_offset=87480
	'xdpsq' type_id=139937 bits_offset=87552
	'xskrq' type_id=139966 bits_offset=93696
	'xsksq' type_id=139937 bits_offset=104960
	'async_icosq' type_id=139948 bits_offset=111104
	'async_icosq_lock' type_id=154 bits_offset=116224
	'aff_mask' type_id=2200 bits_offset=116288
	'stats' type_id=139915 bits_offset=116352
	'priv' type_id=139858 bits_offset=116416
	'mdev' type_id=139673 bits_offset=116480
	'tstamp' type_id=23375 bits_offset=116544
	'state' type_id=182 bits_offset=116608
	'ix' type_id=13 bits_offset=116672
	'cpu' type_id=13 bits_offset=116704
	'icosq_recovery_lock' type_id=155 bits_offset=116736
[139929] PTR '(anon)' type_id=139928
[139930] PTR '(anon)' type_id=141317
[139931] STRUCT 'mlx5e_xdp_info_fifo' size=32 vlen=4
	'xi' type_id=139932 bits_offset=0
	'cc' type_id=96 bits_offset=64
	'pc' type_id=96 bits_offset=128
	'mask' type_id=21 bits_offset=192
[139932] PTR '(anon)' type_id=141912
[139933] TYPEDEF 'mlx5e_fp_xmit_xdp_frame_check' type_id=139934
[139934] PTR '(anon)' type_id=139935
[139935] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=139936
[139936] PTR '(anon)' type_id=139937
[139937] STRUCT 'mlx5e_xdpsq' size=768 vlen=24
	'xdpi_fifo_cc' type_id=21 bits_offset=0
	'cc' type_id=20 bits_offset=32
	'xdpi_fifo_pc' type_id=21 bits_offset=512
	'pc' type_id=20 bits_offset=544
	'doorbell_cseg' type_id=139944 bits_offset=576
	'mpwqe' type_id=139920 bits_offset=640
	'cq' type_id=139914 bits_offset=1024
	'xsk_pool' type_id=7854 bits_offset=4096
	'wq' type_id=139852 bits_offset=4160
	'stats' type_id=139945 bits_offset=4480
	'xmit_xdp_frame_check' type_id=139933 bits_offset=4544
	'xmit_xdp_frame' type_id=139938 bits_offset=4608
	'db' type_id=139942 bits_offset=4672
	'uar_map' type_id=64 bits_offset=4992
	'sqn' type_id=21 bits_offset=5056
	'pdev' type_id=782 bits_offset=5120
	'mkey_be' type_id=1851 bits_offset=5184
	'stop_room' type_id=20 bits_offset=5216
	'max_sq_mpw_wqebbs' type_id=19 bits_offset=5232
	'min_inline_mode' type_id=19 bits_offset=5240
	'state' type_id=1 bits_offset=5248
	'hw_mtu' type_id=6 bits_offset=5312
	'wq_ctrl' type_id=139851 bits_offset=5376
	'channel' type_id=139929 bits_offset=5888
[139938] TYPEDEF 'mlx5e_fp_xmit_xdp_frame' type_id=139939
[139939] PTR '(anon)' type_id=139940
[139940] FUNC_PROTO '(anon)' ret_type_id=42 vlen=4
	'(anon)' type_id=139936
	'(anon)' type_id=139941
	'(anon)' type_id=13
	'(anon)' type_id=95006
[139941] PTR '(anon)' type_id=140784
[139942] STRUCT '(anon)' size=40 vlen=2
	'wqe_info' type_id=139943 bits_offset=0
	'xdpi_fifo' type_id=139931 bits_offset=64
[139943] PTR '(anon)' type_id=141913
[139944] PTR '(anon)' type_id=139829
[139945] PTR '(anon)' type_id=139881
[139946] STRUCT '(anon)' size=8 vlen=1
	'wqe_info' type_id=139947 bits_offset=0
[139947] PTR '(anon)' type_id=140785
[139948] STRUCT 'mlx5e_icosq' size=640 vlen=14
	'cc' type_id=20 bits_offset=0
	'pc' type_id=20 bits_offset=16
	'doorbell_cseg' type_id=139944 bits_offset=64
	'cq' type_id=139914 bits_offset=512
	'db' type_id=139946 bits_offset=3584
	'wq' type_id=139852 bits_offset=3648
	'uar_map' type_id=64 bits_offset=3968
	'sqn' type_id=21 bits_offset=4032
	'reserved_room' type_id=20 bits_offset=4064
	'state' type_id=1 bits_offset=4096
	'ktls_resync' type_id=139949 bits_offset=4160
	'wq_ctrl' type_id=139851 bits_offset=4224
	'channel' type_id=139929 bits_offset=4736
	'recover_work' type_id=540 bits_offset=4800
[139949] PTR '(anon)' type_id=143932
[139950] STRUCT 'mlx5e_frag_page' size=16 vlen=2
	'page' type_id=85 bits_offset=0
	'frags' type_id=20 bits_offset=64
[139951] UNION '(anon)' size=8 vlen=2
	'frag_page' type_id=139952 bits_offset=0
	'xskp' type_id=25227 bits_offset=0
[139952] PTR '(anon)' type_id=139950
[139953] STRUCT 'mlx5e_wqe_frag_info' size=16 vlen=3
	'(anon)' type_id=139951 bits_offset=0
	'offset' type_id=21 bits_offset=64
	'flags' type_id=19 bits_offset=96
[139954] STRUCT '(anon)' size=0 vlen=2
	'__empty_frag_pages' type_id=526 bits_offset=0
	'frag_pages' type_id=139955 bits_offset=0
[139955] ARRAY '(anon)' type_id=139950 index_type_id=13 nr_elems=0
[139956] STRUCT '(anon)' size=0 vlen=2
	'__empty_pages' type_id=526 bits_offset=0
	'pages' type_id=139957 bits_offset=0
[139957] ARRAY '(anon)' type_id=85 index_type_id=13 nr_elems=0
[139958] STRUCT '(anon)' size=0 vlen=2
	'__empty_xsk_buffs' type_id=526 bits_offset=0
	'xsk_buffs' type_id=139959 bits_offset=0
[139959] ARRAY '(anon)' type_id=8052 index_type_id=13 nr_elems=0
[139960] UNION 'mlx5e_alloc_units' size=0 vlen=3
	'(anon)' type_id=139954 bits_offset=0
	'(anon)' type_id=139956 bits_offset=0
	'(anon)' type_id=139958 bits_offset=0
[139961] STRUCT 'mlx5e_mpw_info' size=32 vlen=4
	'consumed_strides' type_id=20 bits_offset=0
	'skip_release_bitmap' type_id=182 bits_offset=64
	'linear_page' type_id=139950 bits_offset=128
	'alloc_units' type_id=139960 bits_offset=256
[139962] TYPEDEF 'mlx5e_fp_handle_rx_cqe' type_id=139963
[139963] PTR '(anon)' type_id=139964
[139964] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=139965
	'(anon)' type_id=139967
[139965] PTR '(anon)' type_id=139966
[139966] STRUCT 'mlx5e_rq' size=1408 vlen=34
	'(anon)' type_id=139995 bits_offset=0
	'buff' type_id=139996 bits_offset=1792
	'pdev' type_id=782 bits_offset=1920
	'netdev' type_id=1996 bits_offset=1984
	'stats' type_id=139997 bits_offset=2048
	'cq' type_id=139914 bits_offset=2560
	'cqd' type_id=139916 bits_offset=5632
	'tstamp' type_id=23375 bits_offset=7168
	'clock' type_id=139893 bits_offset=7232
	'icosq' type_id=139998 bits_offset=7296
	'priv' type_id=139858 bits_offset=7360
	'hw_gro_data' type_id=139999 bits_offset=7424
	'handle_rx_cqe' type_id=139962 bits_offset=7488
	'post_wqes' type_id=139976 bits_offset=7552
	'dealloc_wqe' type_id=139979 bits_offset=7616
	'state' type_id=1 bits_offset=7680
	'ix' type_id=13 bits_offset=7744
	'hw_mtu' type_id=6 bits_offset=7776
	'dim' type_id=24547 bits_offset=7808
	'xdp_prog' type_id=1719 bits_offset=8768
	'xdpsq' type_id=139936 bits_offset=8832
	'flags' type_id=182 bits_offset=8896
	'page_pool' type_id=590 bits_offset=8960
	'xsk_pool' type_id=7854 bits_offset=9024
	'recover_work' type_id=540 bits_offset=9088
	'wq_ctrl' type_id=139851 bits_offset=9344
	'mkey_be' type_id=1851 bits_offset=9856
	'wq_type' type_id=19 bits_offset=9888
	'rqn' type_id=21 bits_offset=9920
	'mdev' type_id=139673 bits_offset=9984
	'channel' type_id=139929 bits_offset=10048
	'wqe_overflow' type_id=139986 bits_offset=10112
	'xdp_rxq' type_id=8372 bits_offset=10240
	'ptp_cyc2time' type_id=139890 bits_offset=10752
[139967] PTR '(anon)' type_id=139806
[139968] TYPEDEF 'mlx5e_fp_skb_from_cqe_mpwrq' type_id=139969
[139969] PTR '(anon)' type_id=139970
[139970] FUNC_PROTO '(anon)' ret_type_id=1896 vlen=6
	'(anon)' type_id=139965
	'(anon)' type_id=139971
	'(anon)' type_id=139967
	'(anon)' type_id=20
	'(anon)' type_id=21
	'(anon)' type_id=21
[139971] PTR '(anon)' type_id=139961
[139972] TYPEDEF 'mlx5e_fp_skb_from_cqe' type_id=139973
[139973] PTR '(anon)' type_id=139974
[139974] FUNC_PROTO '(anon)' ret_type_id=1896 vlen=4
	'(anon)' type_id=139965
	'(anon)' type_id=139975
	'(anon)' type_id=139967
	'(anon)' type_id=21
[139975] PTR '(anon)' type_id=139953
[139976] TYPEDEF 'mlx5e_fp_post_rx_wqes' type_id=139977
[139977] PTR '(anon)' type_id=139978
[139978] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'(anon)' type_id=139965
[139979] TYPEDEF 'mlx5e_fp_dealloc_wqe' type_id=139980
[139980] PTR '(anon)' type_id=139981
[139981] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=139965
	'(anon)' type_id=20
[139982] STRUCT 'mlx5e_rq_frag_info' size=8 vlen=2
	'frag_size' type_id=13 bits_offset=0
	'frag_stride' type_id=13 bits_offset=32
[139983] STRUCT 'mlx5e_rq_frags_info' size=40 vlen=6
	'arr' type_id=139984 bits_offset=0
	'num_frags' type_id=19 bits_offset=256
	'log_num_frags' type_id=19 bits_offset=264
	'wqe_bulk' type_id=20 bits_offset=272
	'refill_unit' type_id=20 bits_offset=288
	'wqe_index_mask' type_id=19 bits_offset=304
[139984] ARRAY '(anon)' type_id=139982 index_type_id=13 nr_elems=4
[139985] UNION '(anon)' size=8 vlen=2
	'frag_page' type_id=139952 bits_offset=0
	'page' type_id=85 bits_offset=0
[139986] STRUCT 'mlx5e_dma_info' size=16 vlen=2
	'addr' type_id=3718 bits_offset=0
	'(anon)' type_id=139985 bits_offset=64
[139987] STRUCT 'mlx5e_shampo_hd' size=56 vlen=11
	'mkey' type_id=21 bits_offset=0
	'info' type_id=139988 bits_offset=64
	'pages' type_id=139952 bits_offset=128
	'curr_page_index' type_id=20 bits_offset=192
	'hd_per_wq' type_id=20 bits_offset=208
	'hd_per_wqe' type_id=20 bits_offset=224
	'bitmap' type_id=79 bits_offset=256
	'pi' type_id=20 bits_offset=320
	'ci' type_id=20 bits_offset=336
	'key' type_id=1851 bits_offset=352
	'last_addr' type_id=23 bits_offset=384
[139988] PTR '(anon)' type_id=139986
[139989] STRUCT 'mlx5e_hw_gro_data' size=96 vlen=3
	'skb' type_id=1896 bits_offset=0
	'fk' type_id=24016 bits_offset=64
	'second_ip_id' type_id=13 bits_offset=704
[139990] ENUM 'mlx5e_mpwrq_umr_mode' encoding=UNSIGNED size=4 vlen=4
	'MLX5E_MPWRQ_UMR_MODE_ALIGNED' val=0
	'MLX5E_MPWRQ_UMR_MODE_UNALIGNED' val=1
	'MLX5E_MPWRQ_UMR_MODE_OVERSIZED' val=2
	'MLX5E_MPWRQ_UMR_MODE_TRIPLE' val=3
[139991] STRUCT '(anon)' size=112 vlen=6
	'wq' type_id=139852 bits_offset=0
	'frags' type_id=139975 bits_offset=320
	'alloc_units' type_id=139992 bits_offset=384
	'info' type_id=139983 bits_offset=448
	'skb_from_cqe' type_id=139972 bits_offset=768
	'skb_from_cqe_batched' type_id=139972 bits_offset=832
[139992] PTR '(anon)' type_id=139960
[139993] STRUCT '(anon)' size=224 vlen=18
	'wq' type_id=139854 bits_offset=0
	'umr_wqe' type_id=139905 bits_offset=384
	'info' type_id=139971 bits_offset=1408
	'skb_from_cqe_mpwrq' type_id=139968 bits_offset=1472
	'umr_mkey_be' type_id=1851 bits_offset=1536
	'num_strides' type_id=20 bits_offset=1568
	'actual_wq_head' type_id=20 bits_offset=1584
	'log_stride_sz' type_id=19 bits_offset=1600
	'umr_in_progress' type_id=19 bits_offset=1608
	'umr_last_bulk' type_id=19 bits_offset=1616
	'umr_completed' type_id=19 bits_offset=1624
	'min_wqe_bulk' type_id=19 bits_offset=1632
	'page_shift' type_id=19 bits_offset=1640
	'pages_per_wqe' type_id=19 bits_offset=1648
	'umr_wqebbs' type_id=19 bits_offset=1656
	'mtts_per_wqe' type_id=19 bits_offset=1664
	'umr_mode' type_id=19 bits_offset=1672
	'shampo' type_id=139994 bits_offset=1728
[139994] PTR '(anon)' type_id=139987
[139995] UNION '(anon)' size=224 vlen=2
	'wqe' type_id=139991 bits_offset=0
	'mpwqe' type_id=139993 bits_offset=0
[139996] STRUCT '(anon)' size=12 vlen=3
	'headroom' type_id=20 bits_offset=0
	'frame0_sz' type_id=21 bits_offset=32
	'map_dir' type_id=19 bits_offset=64
[139997] PTR '(anon)' type_id=139879
[139998] PTR '(anon)' type_id=139948
[139999] PTR '(anon)' type_id=139989
[140000] ARRAY '(anon)' type_id=139926 index_type_id=13 nr_elems=8
[140001] PTR '(anon)' type_id=140002
[140002] PTR '(anon)' type_id=139926
[140003] STRUCT 'mlx5e_channels' size=376 vlen=4
	'c' type_id=140004 bits_offset=0
	'ptp' type_id=140005 bits_offset=64
	'num' type_id=6 bits_offset=128
	'params' type_id=139911 bits_offset=192
[140004] PTR '(anon)' type_id=139929
[140005] PTR '(anon)' type_id=141318
[140006] STRUCT 'mlx5e_channel_stats' size=3904 vlen=7
	'ch' type_id=139882 bits_offset=0
	'sq' type_id=140007 bits_offset=512
	'rq' type_id=139879 bits_offset=20992
	'xskrq' type_id=139879 bits_offset=24512
	'rq_xdpsq' type_id=139881 bits_offset=28160
	'xdpsq' type_id=139881 bits_offset=29184
	'xsksq' type_id=139881 bits_offset=30208
[140007] ARRAY '(anon)' type_id=139880 index_type_id=13 nr_elems=8
[140008] STRUCT 'mlx5e_ptp_stats' size=3392 vlen=4
	'ch' type_id=139882 bits_offset=0
	'sq' type_id=140007 bits_offset=512
	'cq' type_id=140009 bits_offset=20992
	'rq' type_id=139879 bits_offset=23552
[140009] ARRAY '(anon)' type_id=139883 index_type_id=13 nr_elems=8
[140010] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=5
	'MLX5E_STATE_OPENED' val=0
	'MLX5E_STATE_DESTROYING' val=1
	'MLX5E_STATE_XDP_TX_ENABLED' val=2
	'MLX5E_STATE_XDP_ACTIVE' val=3
	'MLX5E_STATE_CHANNELS_ACTIVE' val=4
[140011] STRUCT 'mlx5e_hv_vhca_stats_agent' size=112 vlen=4
	'agent' type_id=140012 bits_offset=0
	'work' type_id=541 bits_offset=64
	'delay' type_id=20 bits_offset=768
	'buf' type_id=64 bits_offset=832
[140012] PTR '(anon)' type_id=146124
[140013] PTR '(anon)' type_id=7854
[140014] STRUCT 'mlx5e_scratchpad' size=8 vlen=1
	'cpumask' type_id=464 bits_offset=0
[140015] PTR '(anon)' type_id=140589
[140016] PTR '(anon)' type_id=143241
[140017] PTR '(anon)' type_id=141916
[140018] PTR '(anon)' type_id=140019
[140019] PTR '(anon)' type_id=140006
[140020] PTR '(anon)' type_id=139927
[140021] STRUCT 'mlx5e_profile' size=136 vlen=18
	'init' type_id=140032 bits_offset=0
	'cleanup' type_id=139866 bits_offset=64
	'init_rx' type_id=139860 bits_offset=128
	'cleanup_rx' type_id=139866 bits_offset=192
	'init_tx' type_id=139860 bits_offset=256
	'cleanup_tx' type_id=139866 bits_offset=320
	'enable' type_id=139866 bits_offset=384
	'disable' type_id=139866 bits_offset=448
	'update_rx' type_id=139860 bits_offset=512
	'update_stats' type_id=139866 bits_offset=576
	'update_carrier' type_id=139866 bits_offset=640
	'max_nch_limit' type_id=140034 bits_offset=704
	'get_tisn' type_id=140036 bits_offset=768
	'stats_grps_num' type_id=140038 bits_offset=832
	'stats_grps' type_id=140039 bits_offset=896
	'rx_handlers' type_id=140040 bits_offset=960
	'max_tc' type_id=13 bits_offset=1024
	'features' type_id=21 bits_offset=1056
[140022] CONST '(anon)' type_id=140021
[140023] PTR '(anon)' type_id=140022
[140024] PTR '(anon)' type_id=146496
[140025] PTR '(anon)' type_id=140733
[140026] PTR '(anon)' type_id=141917
[140027] PTR '(anon)' type_id=146484
[140028] PTR '(anon)' type_id=146074
[140029] STRUCT 'mlx5e_rx_handlers' size=24 vlen=3
	'handle_rx_cqe' type_id=139962 bits_offset=0
	'handle_rx_cqe_mpwqe' type_id=139962 bits_offset=64
	'handle_rx_cqe_mpwqe_shampo' type_id=139962 bits_offset=128
[140030] CONST '(anon)' type_id=140029
[140031] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'(anon)' type_id=139673
	'(anon)' type_id=1996
[140032] PTR '(anon)' type_id=140031
[140033] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=139673
[140034] PTR '(anon)' type_id=140033
[140035] FUNC_PROTO '(anon)' ret_type_id=21 vlen=4
	'(anon)' type_id=139673
	'(anon)' type_id=139858
	'(anon)' type_id=19
	'(anon)' type_id=19
[140036] PTR '(anon)' type_id=140035
[140037] FUNC_PROTO '(anon)' ret_type_id=6 vlen=1
	'(anon)' type_id=139858
[140038] PTR '(anon)' type_id=140037
[140039] PTR '(anon)' type_id=139867
[140040] PTR '(anon)' type_id=140030
[140041] STRUCT 'mlx5e_xsk_param' size=6 vlen=3
	'headroom' type_id=20 bits_offset=0
	'chunk_size' type_id=20 bits_offset=16
	'unaligned' type_id=42 bits_offset=32
[140042] PTR '(anon)' type_id=139911
[140043] PTR '(anon)' type_id=140041
[140044] PTR '(anon)' type_id=140003
[140045] STRUCT 'mlx5_ifc_ipv4_layout_bits' size=128 vlen=2
	'reserved_at_0' type_id=19321 bits_offset=0
	'ipv4' type_id=3834 bits_offset=768
[140046] STRUCT 'mlx5_ifc_ipv6_layout_bits' size=128 vlen=1
	'ipv6' type_id=13111 bits_offset=0
[140047] UNION 'mlx5_ifc_ipv6_layout_ipv4_layout_auto_bits' size=128 vlen=3
	'ipv6_layout' type_id=140046 bits_offset=0
	'ipv4_layout' type_id=140045 bits_offset=0
	'reserved_at_0' type_id=13111 bits_offset=0
[140048] STRUCT 'mlx5_ifc_fte_match_set_lyr_2_4_bits' size=512 vlen=26
	'smac_47_16' type_id=3834 bits_offset=0
	'smac_15_0' type_id=474 bits_offset=256
	'ethertype' type_id=474 bits_offset=384
	'dmac_47_16' type_id=3834 bits_offset=512
	'dmac_15_0' type_id=474 bits_offset=768
	'first_prio' type_id=401 bits_offset=896
	'first_cfi' type_id=16161 bits_offset=920
	'first_vid' type_id=7436 bits_offset=928
	'ip_protocol' type_id=7469 bits_offset=1024
	'ip_dscp' type_id=4362 bits_offset=1088
	'ip_ecn' type_id=2689 bits_offset=1136
	'cvlan_tag' type_id=16161 bits_offset=1152
	'svlan_tag' type_id=16161 bits_offset=1160
	'frag' type_id=16161 bits_offset=1168
	'ip_version' type_id=2120 bits_offset=1176
	'tcp_flags' type_id=26266 bits_offset=1208
	'tcp_sport' type_id=474 bits_offset=1280
	'tcp_dport' type_id=474 bits_offset=1408
	'reserved_at_c0' type_id=474 bits_offset=1536
	'ipv4_ihl' type_id=2120 bits_offset=1664
	'reserved_at_c4' type_id=2120 bits_offset=1696
	'ttl_hoplimit' type_id=7469 bits_offset=1728
	'udp_sport' type_id=474 bits_offset=1792
	'udp_dport' type_id=474 bits_offset=1920
	'src_ipv4_src_ipv6' type_id=140047 bits_offset=2048
	'dst_ipv4_dst_ipv6' type_id=140047 bits_offset=3072
[140049] STRUCT 'mlx5_ifc_nvgre_key_bits' size=32 vlen=2
	'hi' type_id=9799 bits_offset=0
	'lo' type_id=7469 bits_offset=192
[140050] UNION 'mlx5_ifc_gre_key_bits' size=32 vlen=2
	'nvgre' type_id=140049 bits_offset=0
	'key' type_id=3834 bits_offset=0
[140051] STRUCT 'mlx5_ifc_fte_match_set_misc_bits' size=512 vlen=39
	'gre_c_present' type_id=16161 bits_offset=0
	'reserved_at_1' type_id=16161 bits_offset=8
	'gre_k_present' type_id=16161 bits_offset=16
	'gre_s_present' type_id=16161 bits_offset=24
	'source_vhca_port' type_id=2120 bits_offset=32
	'source_sqn' type_id=9799 bits_offset=64
	'source_eswitch_owner_vhca_id' type_id=474 bits_offset=256
	'source_port' type_id=474 bits_offset=384
	'outer_second_prio' type_id=401 bits_offset=512
	'outer_second_cfi' type_id=16161 bits_offset=536
	'outer_second_vid' type_id=7436 bits_offset=544
	'inner_second_prio' type_id=401 bits_offset=640
	'inner_second_cfi' type_id=16161 bits_offset=664
	'inner_second_vid' type_id=7436 bits_offset=672
	'outer_second_cvlan_tag' type_id=16161 bits_offset=768
	'inner_second_cvlan_tag' type_id=16161 bits_offset=776
	'outer_second_svlan_tag' type_id=16161 bits_offset=784
	'inner_second_svlan_tag' type_id=16161 bits_offset=792
	'reserved_at_64' type_id=7436 bits_offset=800
	'gre_protocol' type_id=474 bits_offset=896
	'gre_key' type_id=140050 bits_offset=1024
	'vxlan_vni' type_id=9799 bits_offset=1280
	'bth_opcode' type_id=7469 bits_offset=1472
	'geneve_vni' type_id=9799 bits_offset=1536
	'reserved_at_d8' type_id=4362 bits_offset=1728
	'geneve_tlv_option_0_exist' type_id=16161 bits_offset=1776
	'geneve_oam' type_id=16161 bits_offset=1784
	'reserved_at_e0' type_id=7436 bits_offset=1792
	'outer_ipv6_flow_label' type_id=7773 bits_offset=1888
	'reserved_at_100' type_id=7436 bits_offset=2048
	'inner_ipv6_flow_label' type_id=7773 bits_offset=2144
	'reserved_at_120' type_id=19155 bits_offset=2304
	'geneve_opt_len' type_id=4362 bits_offset=2384
	'geneve_protocol_type' type_id=474 bits_offset=2432
	'reserved_at_140' type_id=7469 bits_offset=2560
	'bth_dst_qp' type_id=9799 bits_offset=2624
	'inner_esp_spi' type_id=3834 bits_offset=2816
	'outer_esp_spi' type_id=3834 bits_offset=3072
	'reserved_at_1a0' type_id=19321 bits_offset=3328
[140052] STRUCT 'mlx5_ifc_fte_match_mpls_bits' size=32 vlen=4
	'mpls_label' type_id=7773 bits_offset=0
	'mpls_exp' type_id=401 bits_offset=160
	'mpls_s_bos' type_id=16161 bits_offset=184
	'mpls_ttl' type_id=7469 bits_offset=192
[140053] STRUCT 'mlx5_ifc_fte_match_set_misc2_bits' size=512 vlen=18
	'outer_first_mpls' type_id=140052 bits_offset=0
	'inner_first_mpls' type_id=140052 bits_offset=256
	'outer_first_mpls_over_gre' type_id=140052 bits_offset=512
	'outer_first_mpls_over_udp' type_id=140052 bits_offset=768
	'metadata_reg_c_7' type_id=3834 bits_offset=1024
	'metadata_reg_c_6' type_id=3834 bits_offset=1280
	'metadata_reg_c_5' type_id=3834 bits_offset=1536
	'metadata_reg_c_4' type_id=3834 bits_offset=1792
	'metadata_reg_c_3' type_id=3834 bits_offset=2048
	'metadata_reg_c_2' type_id=3834 bits_offset=2304
	'metadata_reg_c_1' type_id=3834 bits_offset=2560
	'metadata_reg_c_0' type_id=3834 bits_offset=2816
	'metadata_reg_a' type_id=3834 bits_offset=3072
	'reserved_at_1a0' type_id=7469 bits_offset=3328
	'macsec_syndrome' type_id=7469 bits_offset=3392
	'ipsec_syndrome' type_id=7469 bits_offset=3456
	'reserved_at_1b8' type_id=7469 bits_offset=3520
	'reserved_at_1c0' type_id=1843 bits_offset=3584
[140054] STRUCT 'mlx5_ifc_fte_match_set_misc3_bits' size=512 vlen=24
	'inner_tcp_seq_num' type_id=3834 bits_offset=0
	'outer_tcp_seq_num' type_id=3834 bits_offset=256
	'inner_tcp_ack_num' type_id=3834 bits_offset=512
	'outer_tcp_ack_num' type_id=3834 bits_offset=768
	'reserved_at_80' type_id=7469 bits_offset=1024
	'outer_vxlan_gpe_vni' type_id=9799 bits_offset=1088
	'outer_vxlan_gpe_next_protocol' type_id=7469 bits_offset=1280
	'outer_vxlan_gpe_flags' type_id=7469 bits_offset=1344
	'reserved_at_b0' type_id=474 bits_offset=1408
	'icmp_header_data' type_id=3834 bits_offset=1536
	'icmpv6_header_data' type_id=3834 bits_offset=1792
	'icmp_type' type_id=7469 bits_offset=2048
	'icmp_code' type_id=7469 bits_offset=2112
	'icmpv6_type' type_id=7469 bits_offset=2176
	'icmpv6_code' type_id=7469 bits_offset=2240
	'geneve_tlv_option_0_data' type_id=3834 bits_offset=2304
	'gtpu_teid' type_id=3834 bits_offset=2560
	'gtpu_msg_type' type_id=7469 bits_offset=2816
	'gtpu_msg_flags' type_id=7469 bits_offset=2880
	'reserved_at_170' type_id=474 bits_offset=2944
	'gtpu_dw_2' type_id=3834 bits_offset=3072
	'gtpu_first_ext_dw_0' type_id=3834 bits_offset=3328
	'gtpu_dw_0' type_id=3834 bits_offset=3584
	'reserved_at_1e0' type_id=3834 bits_offset=3840
[140055] STRUCT 'mlx5_ifc_fte_match_set_misc4_bits' size=512 vlen=9
	'prog_sample_field_value_0' type_id=3834 bits_offset=0
	'prog_sample_field_id_0' type_id=3834 bits_offset=256
	'prog_sample_field_value_1' type_id=3834 bits_offset=512
	'prog_sample_field_id_1' type_id=3834 bits_offset=768
	'prog_sample_field_value_2' type_id=3834 bits_offset=1024
	'prog_sample_field_id_2' type_id=3834 bits_offset=1280
	'prog_sample_field_value_3' type_id=3834 bits_offset=1536
	'prog_sample_field_id_3' type_id=3834 bits_offset=1792
	'reserved_at_100' type_id=12906 bits_offset=2048
[140056] STRUCT 'mlx5_ifc_fte_match_set_misc5_bits' size=512 vlen=9
	'macsec_tag_0' type_id=3834 bits_offset=0
	'macsec_tag_1' type_id=3834 bits_offset=256
	'macsec_tag_2' type_id=3834 bits_offset=512
	'macsec_tag_3' type_id=3834 bits_offset=768
	'tunnel_header_0' type_id=3834 bits_offset=1024
	'tunnel_header_1' type_id=3834 bits_offset=1280
	'tunnel_header_2' type_id=3834 bits_offset=1536
	'tunnel_header_3' type_id=3834 bits_offset=1792
	'reserved_at_100' type_id=12906 bits_offset=2048
[140057] STRUCT 'mlx5_ifc_fte_match_param_bits' size=4096 vlen=8
	'outer_headers' type_id=140048 bits_offset=0
	'misc_parameters' type_id=140051 bits_offset=4096
	'inner_headers' type_id=140048 bits_offset=8192
	'misc_parameters_2' type_id=140053 bits_offset=12288
	'misc_parameters_3' type_id=140054 bits_offset=16384
	'misc_parameters_4' type_id=140055 bits_offset=20480
	'misc_parameters_5' type_id=140056 bits_offset=24576
	'reserved_at_e00' type_id=11214 bits_offset=28672
[140058] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=14
	'MLX5_FLOW_CONTEXT_ACTION_ALLOW' val=1
	'MLX5_FLOW_CONTEXT_ACTION_DROP' val=2
	'MLX5_FLOW_CONTEXT_ACTION_FWD_DEST' val=4
	'MLX5_FLOW_CONTEXT_ACTION_COUNT' val=8
	'MLX5_FLOW_CONTEXT_ACTION_PACKET_REFORMAT' val=16
	'MLX5_FLOW_CONTEXT_ACTION_DECAP' val=32
	'MLX5_FLOW_CONTEXT_ACTION_MOD_HDR' val=64
	'MLX5_FLOW_CONTEXT_ACTION_VLAN_POP' val=128
	'MLX5_FLOW_CONTEXT_ACTION_VLAN_PUSH' val=256
	'MLX5_FLOW_CONTEXT_ACTION_VLAN_POP_2' val=1024
	'MLX5_FLOW_CONTEXT_ACTION_VLAN_PUSH_2' val=2048
	'MLX5_FLOW_CONTEXT_ACTION_CRYPTO_DECRYPT' val=4096
	'MLX5_FLOW_CONTEXT_ACTION_CRYPTO_ENCRYPT' val=8192
	'MLX5_FLOW_CONTEXT_ACTION_EXECUTE_ASO' val=16384
[140059] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=3584
[140060] STRUCT 'mlx5_ifc_create_flow_group_in_bits' size=8192 vlen=26
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'other_vport' type_id=16161 bits_offset=512
	'reserved_at_41' type_id=2960 bits_offset=520
	'vport_number' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
	'table_type' type_id=7469 bits_offset=1024
	'reserved_at_88' type_id=2120 bits_offset=1088
	'group_type' type_id=2120 bits_offset=1120
	'reserved_at_90' type_id=474 bits_offset=1152
	'reserved_at_a0' type_id=7469 bits_offset=1280
	'table_id' type_id=9799 bits_offset=1344
	'source_eswitch_owner_vhca_id_valid' type_id=16161 bits_offset=1536
	'reserved_at_c1' type_id=20975 bits_offset=1544
	'start_flow_index' type_id=3834 bits_offset=1792
	'reserved_at_100' type_id=3834 bits_offset=2048
	'end_flow_index' type_id=3834 bits_offset=2304
	'reserved_at_140' type_id=474 bits_offset=2560
	'match_definer_id' type_id=474 bits_offset=2688
	'reserved_at_160' type_id=13111 bits_offset=2816
	'reserved_at_1e0' type_id=9799 bits_offset=3840
	'match_criteria_enable' type_id=7469 bits_offset=4032
	'match_criteria' type_id=140057 bits_offset=4096
	'reserved_at_1200' type_id=140059 bits_offset=36864
[140061] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=7
	'MLX5_MATCH_OUTER_HEADERS' val=1
	'MLX5_MATCH_MISC_PARAMETERS' val=2
	'MLX5_MATCH_INNER_HEADERS' val=4
	'MLX5_MATCH_MISC_PARAMETERS_2' val=8
	'MLX5_MATCH_MISC_PARAMETERS_3' val=16
	'MLX5_MATCH_MISC_PARAMETERS_4' val=32
	'MLX5_MATCH_MISC_PARAMETERS_5' val=64
[140062] ENUM 'mlx5_flow_destination_type' encoding=UNSIGNED size=4 vlen=11
	'MLX5_FLOW_DESTINATION_TYPE_NONE' val=0
	'MLX5_FLOW_DESTINATION_TYPE_VPORT' val=1
	'MLX5_FLOW_DESTINATION_TYPE_FLOW_TABLE' val=2
	'MLX5_FLOW_DESTINATION_TYPE_TIR' val=3
	'MLX5_FLOW_DESTINATION_TYPE_FLOW_SAMPLER' val=4
	'MLX5_FLOW_DESTINATION_TYPE_UPLINK' val=5
	'MLX5_FLOW_DESTINATION_TYPE_PORT' val=6
	'MLX5_FLOW_DESTINATION_TYPE_COUNTER' val=7
	'MLX5_FLOW_DESTINATION_TYPE_FLOW_TABLE_NUM' val=8
	'MLX5_FLOW_DESTINATION_TYPE_RANGE' val=9
	'MLX5_FLOW_DESTINATION_TYPE_TABLE_TYPE' val=10
[140063] STRUCT 'mlx5_flow_context' size=12 vlen=3
	'flags' type_id=21 bits_offset=0
	'flow_tag' type_id=21 bits_offset=32
	'flow_source' type_id=21 bits_offset=64
[140064] STRUCT 'mlx5_flow_spec' size=1040 vlen=4
	'match_criteria_enable' type_id=19 bits_offset=0
	'match_criteria' type_id=16790 bits_offset=32
	'match_value' type_id=16790 bits_offset=4128
	'flow_context' type_id=140063 bits_offset=8224
[140065] CONST '(anon)' type_id=140064
[140066] ENUM 'mlx5_flow_dest_range_field' encoding=UNSIGNED size=4 vlen=1
	'MLX5_FLOW_DEST_RANGE_FIELD_PKT_LEN' val=0
[140067] STRUCT '(anon)' size=24 vlen=4
	'num' type_id=20 bits_offset=0
	'vhca_id' type_id=20 bits_offset=16
	'pkt_reformat' type_id=140068 bits_offset=64
	'flags' type_id=19 bits_offset=128
[140068] PTR '(anon)' type_id=140309
[140069] STRUCT '(anon)' size=32 vlen=5
	'hit_ft' type_id=139705 bits_offset=0
	'miss_ft' type_id=139705 bits_offset=64
	'field' type_id=140066 bits_offset=128
	'min' type_id=21 bits_offset=160
	'max' type_id=21 bits_offset=192
[140070] UNION '(anon)' size=32 vlen=7
	'tir_num' type_id=21 bits_offset=0
	'ft_num' type_id=21 bits_offset=0
	'ft' type_id=139705 bits_offset=0
	'counter_id' type_id=21 bits_offset=0
	'vport' type_id=140067 bits_offset=0
	'range' type_id=140069 bits_offset=0
	'sampler_id' type_id=21 bits_offset=0
[140071] STRUCT 'mlx5_flow_destination' size=40 vlen=2
	'type' type_id=140062 bits_offset=0
	'(anon)' type_id=140070 bits_offset=64
[140072] STRUCT '(anon)' size=8 vlen=2
	'max_num_groups' type_id=13 bits_offset=0
	'num_reserved_entries' type_id=13 bits_offset=32
[140073] STRUCT 'mlx5_flow_table_attr' size=40 vlen=7
	'prio' type_id=13 bits_offset=0
	'max_fte' type_id=13 bits_offset=32
	'level' type_id=21 bits_offset=64
	'flags' type_id=21 bits_offset=96
	'uid' type_id=20 bits_offset=128
	'next_ft' type_id=139705 bits_offset=192
	'autogroup' type_id=140072 bits_offset=256
[140074] STRUCT '(anon)' size=2 vlen=2
	'meter_idx' type_id=19 bits_offset=0
	'init_color' type_id=19 bits_offset=8
[140075] UNION '(anon)' size=4 vlen=2
	'ctrl_data' type_id=21 bits_offset=0
	'flow_meter' type_id=140074 bits_offset=0
[140076] STRUCT 'mlx5_exe_aso' size=12 vlen=4
	'object_id' type_id=21 bits_offset=0
	'type' type_id=19 bits_offset=32
	'return_reg_id' type_id=19 bits_offset=40
	'(anon)' type_id=140075 bits_offset=64
[140077] STRUCT 'mlx5_fs_vlan' size=6 vlen=3
	'ethtype' type_id=20 bits_offset=0
	'vid' type_id=20 bits_offset=16
	'prio' type_id=19 bits_offset=32
[140078] STRUCT 'mlx5_flow_act_crypto_params' size=8 vlen=2
	'type' type_id=19 bits_offset=0
	'obj_id' type_id=21 bits_offset=32
[140079] STRUCT 'mlx5_flow_act' size=80 vlen=9
	'action' type_id=21 bits_offset=0
	'modify_hdr' type_id=140080 bits_offset=64
	'pkt_reformat' type_id=140068 bits_offset=128
	'crypto' type_id=140078 bits_offset=192
	'flags' type_id=21 bits_offset=256
	'vlan' type_id=140081 bits_offset=288
	'counters' type_id=24745 bits_offset=384
	'fg' type_id=139706 bits_offset=448
	'exe_aso' type_id=140076 bits_offset=512
[140080] PTR '(anon)' type_id=140311
[140081] ARRAY '(anon)' type_id=140077 index_type_id=13 nr_elems=2
[140082] ENUM 'mlx5_traffic_types' encoding=UNSIGNED size=4 vlen=13
	'MLX5_TT_IPV4_TCP' val=0
	'MLX5_TT_IPV6_TCP' val=1
	'MLX5_TT_IPV4_UDP' val=2
	'MLX5_TT_IPV6_UDP' val=3
	'MLX5_TT_IPV4_IPSEC_AH' val=4
	'MLX5_TT_IPV6_IPSEC_AH' val=5
	'MLX5_TT_IPV4_IPSEC_ESP' val=6
	'MLX5_TT_IPV6_IPSEC_ESP' val=7
	'MLX5_TT_IPV4' val=8
	'MLX5_TT_IPV6' val=9
	'MLX5_TT_ANY' val=10
	'MLX5_NUM_TT' val=11
	'MLX5_NUM_INDIR_TIRS' val=10
[140083] PTR '(anon)' type_id=140313
[140084] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_TC_PRIO' val=0
	'MLX5E_NIC_PRIO' val=1
[140085] STRUCT 'mlx5e_flow_table' size=24 vlen=3
	'num_groups' type_id=13 bits_offset=0
	't' type_id=139705 bits_offset=64
	'g' type_id=140086 bits_offset=128
[140086] PTR '(anon)' type_id=139706
[140087] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=13
	'MLX5E_PROMISC_FT_LEVEL' val=0
	'MLX5E_VLAN_FT_LEVEL' val=1
	'MLX5E_L2_FT_LEVEL' val=2
	'MLX5E_TTC_FT_LEVEL' val=3
	'MLX5E_INNER_TTC_FT_LEVEL' val=4
	'MLX5E_FS_TT_UDP_FT_LEVEL' val=5
	'MLX5E_FS_TT_ANY_FT_LEVEL' val=5
	'MLX5E_ACCEL_FS_TCP_FT_LEVEL' val=5
	'MLX5E_ARFS_FT_LEVEL' val=5
	'MLX5E_ACCEL_FS_POL_FT_LEVEL' val=5
	'MLX5E_ACCEL_FS_ESP_FT_LEVEL' val=6
	'MLX5E_ACCEL_FS_ESP_FT_ERR_LEVEL' val=7
	'MLX5E_ACCEL_FS_ESP_FT_ROCE_LEVEL' val=8
[140088] STRUCT 'arfs_table' size=2080 vlen=3
	'ft' type_id=140085 bits_offset=0
	'default_rule' type_id=139707 bits_offset=192
	'rules_hash' type_id=7038 bits_offset=256
[140089] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5E_ARFS_STATE_ENABLED' val=0
[140090] ENUM 'arfs_type' encoding=UNSIGNED size=4 vlen=5
	'ARFS_IPV4_TCP' val=0
	'ARFS_IPV6_TCP' val=1
	'ARFS_IPV4_UDP' val=2
	'ARFS_IPV6_UDP' val=3
	'ARFS_NUM_TYPES' val=4
[140091] STRUCT 'mlx5e_arfs_tables' size=8344 vlen=5
	'arfs_tables' type_id=140092 bits_offset=0
	'arfs_lock' type_id=154 bits_offset=66560
	'last_filter_id' type_id=13 bits_offset=66592
	'wq' type_id=542 bits_offset=66624
	'state' type_id=1 bits_offset=66688
[140092] ARRAY '(anon)' type_id=140088 index_type_id=13 nr_elems=4
[140093] UNION '(anon)' size=16 vlen=2
	'src_ipv4' type_id=1851 bits_offset=0
	'src_ipv6' type_id=1904 bits_offset=0
[140094] UNION '(anon)' size=16 vlen=2
	'dst_ipv4' type_id=1851 bits_offset=0
	'dst_ipv6' type_id=1904 bits_offset=0
[140095] STRUCT 'arfs_tuple' size=40 vlen=6
	'etype' type_id=1850 bits_offset=0
	'ip_proto' type_id=19 bits_offset=16
	'(anon)' type_id=140093 bits_offset=32
	'(anon)' type_id=140094 bits_offset=160
	'src_port' type_id=1850 bits_offset=288
	'dst_port' type_id=1850 bits_offset=304
[140096] CONST '(anon)' type_id=140095
[140097] STRUCT 'arfs_rule' size=120 vlen=8
	'priv' type_id=139858 bits_offset=0
	'arfs_work' type_id=540 bits_offset=64
	'rule' type_id=139707 bits_offset=320
	'hlist' type_id=57 bits_offset=384
	'rxq' type_id=13 bits_offset=512
	'flow_id' type_id=13 bits_offset=544
	'filter_id' type_id=13 bits_offset=576
	'tuple' type_id=140095 bits_offset=608
[140098] PTR '(anon)' type_id=140071
[140099] PTR '(anon)' type_id=140065
[140100] PTR '(anon)' type_id=140079
[140101] PTR '(anon)' type_id=140073
[140102] PTR '(anon)' type_id=140085
[140103] PTR '(anon)' type_id=140091
[140104] PTR '(anon)' type_id=146921
[140105] PTR '(anon)' type_id=140097
[140106] PTR '(anon)' type_id=140088
[140107] PTR '(anon)' type_id=140096
[140108] PTR '(anon)' type_id=140095
[140109] PTR '(anon)' type_id=140064
[140110] ENUM 'ifla_vxlan_df' encoding=UNSIGNED size=4 vlen=5
	'VXLAN_DF_UNSET' val=0
	'VXLAN_DF_SET' val=1
	'VXLAN_DF_INHERIT' val=2
	'__VXLAN_DF_END' val=3
	'VXLAN_DF_MAX' val=2
[140111] ENUM 'ifla_vxlan_label_policy' encoding=UNSIGNED size=4 vlen=4
	'VXLAN_LABEL_FIXED' val=0
	'VXLAN_LABEL_INHERIT' val=1
	'__VXLAN_LABEL_END' val=2
	'VXLAN_LABEL_MAX' val=1
[140112] CONST '(anon)' type_id=23158
[140113] STRUCT 'vxlanhdr' size=8 vlen=2
	'vx_flags' type_id=1851 bits_offset=0
	'vx_vni' type_id=1851 bits_offset=32
[140114] STRUCT 'vxlanhdr_gbp' size=8 vlen=8
	'vx_flags' type_id=19 bits_offset=0
	'reserved_flags1' type_id=19 bits_offset=8 bitfield_size=3
	'policy_applied' type_id=19 bits_offset=11 bitfield_size=1
	'reserved_flags2' type_id=19 bits_offset=12 bitfield_size=2
	'dont_learn' type_id=19 bits_offset=14 bitfield_size=1
	'reserved_flags3' type_id=19 bits_offset=15 bitfield_size=1
	'policy_id' type_id=1850 bits_offset=16
	'vx_vni' type_id=1851 bits_offset=32
[140115] CONST '(anon)' type_id=33077
[140116] STRUCT 'vxlan_sock' size=8224 vlen=5
	'hlist' type_id=57 bits_offset=0
	'sock' type_id=8616 bits_offset=128
	'vni_list' type_id=10086 bits_offset=192
	'refcnt' type_id=178 bits_offset=65728
	'flags' type_id=21 bits_offset=65760
[140117] UNION 'vxlan_addr' size=28 vlen=3
	'sin' type_id=12640 bits_offset=0
	'sin6' type_id=12638 bits_offset=0
	'sa' type_id=7567 bits_offset=0
[140118] STRUCT 'vxlan_rdst' size=96 vlen=9
	'remote_ip' type_id=140117 bits_offset=0
	'remote_port' type_id=1850 bits_offset=224
	'offloaded' type_id=19 bits_offset=240 bitfield_size=1
	'remote_vni' type_id=1851 bits_offset=256
	'remote_ifindex' type_id=21 bits_offset=288
	'remote_dev' type_id=1996 bits_offset=320
	'list' type_id=54 bits_offset=384
	'rcu' type_id=60 bits_offset=512
	'dst_cache' type_id=23153 bits_offset=640
[140119] CONST '(anon)' type_id=140118
[140120] STRUCT 'vxlan_config' size=112 vlen=17
	'remote_ip' type_id=140117 bits_offset=0
	'saddr' type_id=140117 bits_offset=224
	'vni' type_id=1851 bits_offset=448
	'remote_ifindex' type_id=13 bits_offset=480
	'mtu' type_id=13 bits_offset=512
	'dst_port' type_id=1850 bits_offset=544
	'port_min' type_id=20 bits_offset=560
	'port_max' type_id=20 bits_offset=576
	'tos' type_id=19 bits_offset=592
	'ttl' type_id=19 bits_offset=600
	'label' type_id=1851 bits_offset=608
	'label_policy' type_id=140111 bits_offset=640
	'flags' type_id=21 bits_offset=672
	'age_interval' type_id=1 bits_offset=704
	'addrmax' type_id=6 bits_offset=768
	'no_share' type_id=42 bits_offset=800
	'df' type_id=140110 bits_offset=832
[140121] STRUCT 'vxlan_dev_node' size=24 vlen=2
	'hlist' type_id=57 bits_offset=0
	'vxlan' type_id=140124 bits_offset=128
[140122] STRUCT 'vxlan_dev' size=3608 vlen=19
	'hlist4' type_id=140121 bits_offset=0
	'hlist6' type_id=140121 bits_offset=192
	'next' type_id=54 bits_offset=384
	'vn4_sock' type_id=140126 bits_offset=512
	'vn6_sock' type_id=140126 bits_offset=576
	'dev' type_id=1996 bits_offset=640
	'net' type_id=321 bits_offset=704
	'default_dst' type_id=140118 bits_offset=768
	'fan' type_id=63452 bits_offset=1536
	'age_timer' type_id=169 bits_offset=1664
	'hash_lock' type_id=94621 bits_offset=1984
	'addrcnt' type_id=6 bits_offset=10176
	'gro_cells' type_id=23534 bits_offset=10240
	'cfg' type_id=140120 bits_offset=10304
	'vnigrp' type_id=140127 bits_offset=11200
	'fdb_head' type_id=7038 bits_offset=11264
	'mdb_tbl' type_id=1883 bits_offset=27648
	'mdb_list' type_id=56 bits_offset=28736
	'mdb_seq' type_id=6 bits_offset=28800
[140123] CONST '(anon)' type_id=140122
[140124] PTR '(anon)' type_id=140122
[140125] STRUCT 'vxlan_vni_group' size=160 vlen=3
	'vni_hash' type_id=1883 bits_offset=0
	'vni_list' type_id=54 bits_offset=1088
	'num_vnis' type_id=21 bits_offset=1216
[140126] PTR '(anon)' type_id=140116
[140127] PTR '(anon)' type_id=140125
[140128] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=768
[140129] STRUCT 'mlx5_ifc_flow_table_fields_supported_bits' size=128 vlen=77
	'outer_dmac' type_id=16161 bits_offset=0
	'outer_smac' type_id=16161 bits_offset=8
	'outer_ether_type' type_id=16161 bits_offset=16
	'outer_ip_version' type_id=16161 bits_offset=24
	'outer_first_prio' type_id=16161 bits_offset=32
	'outer_first_cfi' type_id=16161 bits_offset=40
	'outer_first_vid' type_id=16161 bits_offset=48
	'outer_ipv4_ttl' type_id=16161 bits_offset=56
	'outer_second_prio' type_id=16161 bits_offset=64
	'outer_second_cfi' type_id=16161 bits_offset=72
	'outer_second_vid' type_id=16161 bits_offset=80
	'reserved_at_b' type_id=16161 bits_offset=88
	'outer_sip' type_id=16161 bits_offset=96
	'outer_dip' type_id=16161 bits_offset=104
	'outer_frag' type_id=16161 bits_offset=112
	'outer_ip_protocol' type_id=16161 bits_offset=120
	'outer_ip_ecn' type_id=16161 bits_offset=128
	'outer_ip_dscp' type_id=16161 bits_offset=136
	'outer_udp_sport' type_id=16161 bits_offset=144
	'outer_udp_dport' type_id=16161 bits_offset=152
	'outer_tcp_sport' type_id=16161 bits_offset=160
	'outer_tcp_dport' type_id=16161 bits_offset=168
	'outer_tcp_flags' type_id=16161 bits_offset=176
	'outer_gre_protocol' type_id=16161 bits_offset=184
	'outer_gre_key' type_id=16161 bits_offset=192
	'outer_vxlan_vni' type_id=16161 bits_offset=200
	'outer_geneve_vni' type_id=16161 bits_offset=208
	'outer_geneve_oam' type_id=16161 bits_offset=216
	'outer_geneve_protocol_type' type_id=16161 bits_offset=224
	'outer_geneve_opt_len' type_id=16161 bits_offset=232
	'source_vhca_port' type_id=16161 bits_offset=240
	'source_eswitch_port' type_id=16161 bits_offset=248
	'inner_dmac' type_id=16161 bits_offset=256
	'inner_smac' type_id=16161 bits_offset=264
	'inner_ether_type' type_id=16161 bits_offset=272
	'inner_ip_version' type_id=16161 bits_offset=280
	'inner_first_prio' type_id=16161 bits_offset=288
	'inner_first_cfi' type_id=16161 bits_offset=296
	'inner_first_vid' type_id=16161 bits_offset=304
	'reserved_at_27' type_id=16161 bits_offset=312
	'inner_second_prio' type_id=16161 bits_offset=320
	'inner_second_cfi' type_id=16161 bits_offset=328
	'inner_second_vid' type_id=16161 bits_offset=336
	'reserved_at_2b' type_id=16161 bits_offset=344
	'inner_sip' type_id=16161 bits_offset=352
	'inner_dip' type_id=16161 bits_offset=360
	'inner_frag' type_id=16161 bits_offset=368
	'inner_ip_protocol' type_id=16161 bits_offset=376
	'inner_ip_ecn' type_id=16161 bits_offset=384
	'inner_ip_dscp' type_id=16161 bits_offset=392
	'inner_udp_sport' type_id=16161 bits_offset=400
	'inner_udp_dport' type_id=16161 bits_offset=408
	'inner_tcp_sport' type_id=16161 bits_offset=416
	'inner_tcp_dport' type_id=16161 bits_offset=424
	'inner_tcp_flags' type_id=16161 bits_offset=432
	'reserved_at_37' type_id=26266 bits_offset=440
	'geneve_tlv_option_0_data' type_id=16161 bits_offset=512
	'geneve_tlv_option_0_exist' type_id=16161 bits_offset=520
	'reserved_at_42' type_id=401 bits_offset=528
	'outer_first_mpls_over_udp' type_id=2120 bits_offset=552
	'outer_first_mpls_over_gre' type_id=2120 bits_offset=584
	'inner_first_mpls' type_id=2120 bits_offset=616
	'outer_first_mpls' type_id=2120 bits_offset=648
	'reserved_at_55' type_id=2689 bits_offset=680
	'outer_esp_spi' type_id=16161 bits_offset=696
	'reserved_at_58' type_id=2689 bits_offset=704
	'bth_dst_qp' type_id=16161 bits_offset=720
	'reserved_at_5b' type_id=4325 bits_offset=728
	'reserved_at_60' type_id=9799 bits_offset=768
	'metadata_reg_c_7' type_id=16161 bits_offset=960
	'metadata_reg_c_6' type_id=16161 bits_offset=968
	'metadata_reg_c_5' type_id=16161 bits_offset=976
	'metadata_reg_c_4' type_id=16161 bits_offset=984
	'metadata_reg_c_3' type_id=16161 bits_offset=992
	'metadata_reg_c_2' type_id=16161 bits_offset=1000
	'metadata_reg_c_1' type_id=16161 bits_offset=1008
	'metadata_reg_c_0' type_id=16161 bits_offset=1016
[140130] STRUCT 'mlx5_ifc_flow_table_fields_supported_2_bits' size=128 vlen=6
	'reserved_at_0' type_id=61845 bits_offset=0
	'bth_opcode' type_id=16161 bits_offset=112
	'reserved_at_f' type_id=16161 bits_offset=120
	'tunnel_header_0_1' type_id=16161 bits_offset=128
	'reserved_at_11' type_id=2960 bits_offset=136
	'reserved_at_20' type_id=19321 bits_offset=256
[140131] STRUCT 'mlx5_ifc_flow_table_prop_layout_bits' size=512 vlen=63
	'ft_support' type_id=16161 bits_offset=0
	'reserved_at_1' type_id=16161 bits_offset=8
	'flow_counter' type_id=16161 bits_offset=16
	'flow_modify_en' type_id=16161 bits_offset=24
	'modify_root' type_id=16161 bits_offset=32
	'identified_miss_table_mode' type_id=16161 bits_offset=40
	'flow_table_modify' type_id=16161 bits_offset=48
	'reformat' type_id=16161 bits_offset=56
	'decap' type_id=16161 bits_offset=64
	'reset_root_to_default' type_id=16161 bits_offset=72
	'pop_vlan' type_id=16161 bits_offset=80
	'push_vlan' type_id=16161 bits_offset=88
	'reserved_at_c' type_id=16161 bits_offset=96
	'pop_vlan_2' type_id=16161 bits_offset=104
	'push_vlan_2' type_id=16161 bits_offset=112
	'reformat_and_vlan_action' type_id=16161 bits_offset=120
	'reserved_at_10' type_id=16161 bits_offset=128
	'sw_owner' type_id=16161 bits_offset=136
	'reformat_l3_tunnel_to_l2' type_id=16161 bits_offset=144
	'reformat_l2_to_l3_tunnel' type_id=16161 bits_offset=152
	'reformat_and_modify_action' type_id=16161 bits_offset=160
	'ignore_flow_level' type_id=16161 bits_offset=168
	'reserved_at_16' type_id=16161 bits_offset=176
	'table_miss_action_domain' type_id=16161 bits_offset=184
	'termination_table' type_id=16161 bits_offset=192
	'reformat_and_fwd_to_table' type_id=16161 bits_offset=200
	'reserved_at_1a' type_id=2689 bits_offset=208
	'ipsec_encrypt' type_id=16161 bits_offset=224
	'ipsec_decrypt' type_id=16161 bits_offset=232
	'sw_owner_v2' type_id=16161 bits_offset=240
	'reserved_at_1f' type_id=16161 bits_offset=248
	'termination_table_raw_traffic' type_id=16161 bits_offset=256
	'reserved_at_21' type_id=16161 bits_offset=264
	'log_max_ft_size' type_id=4362 bits_offset=272
	'log_max_modify_header_context' type_id=7469 bits_offset=320
	'max_modify_header_actions' type_id=7469 bits_offset=384
	'max_ft_level' type_id=7469 bits_offset=448
	'reformat_add_esp_trasport' type_id=16161 bits_offset=512
	'reformat_l2_to_l3_esp_tunnel' type_id=16161 bits_offset=520
	'reformat_add_esp_transport_over_udp' type_id=16161 bits_offset=528
	'reformat_del_esp_trasport' type_id=16161 bits_offset=536
	'reformat_l3_esp_tunnel_to_l2' type_id=16161 bits_offset=544
	'reformat_del_esp_transport_over_udp' type_id=16161 bits_offset=552
	'execute_aso' type_id=16161 bits_offset=560
	'reserved_at_47' type_id=33414 bits_offset=568
	'reserved_at_60' type_id=2689 bits_offset=768
	'reformat_insert' type_id=16161 bits_offset=784
	'reformat_remove' type_id=16161 bits_offset=792
	'macsec_encrypt' type_id=16161 bits_offset=800
	'macsec_decrypt' type_id=16161 bits_offset=808
	'reserved_at_66' type_id=2689 bits_offset=816
	'reformat_add_macsec' type_id=16161 bits_offset=832
	'reformat_remove_macsec' type_id=16161 bits_offset=840
	'reserved_at_6a' type_id=61845 bits_offset=848
	'log_max_ft_num' type_id=7469 bits_offset=960
	'reserved_at_80' type_id=474 bits_offset=1024
	'log_max_flow_counter' type_id=7469 bits_offset=1152
	'log_max_destination' type_id=7469 bits_offset=1216
	'reserved_at_a0' type_id=9799 bits_offset=1280
	'log_max_flow' type_id=7469 bits_offset=1472
	'reserved_at_c0' type_id=1843 bits_offset=1536
	'ft_field_support' type_id=140129 bits_offset=2048
	'ft_field_bitmask_support' type_id=140129 bits_offset=3072
[140132] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=480
[140133] STRUCT 'mlx5_ifc_flow_table_eswitch_cap_bits' size=32768 vlen=28
	'fdb_to_vport_reg_c_id' type_id=7469 bits_offset=0
	'reserved_at_8' type_id=4325 bits_offset=64
	'fdb_uplink_hairpin' type_id=16161 bits_offset=104
	'fdb_multi_path_any_table_limit_regc' type_id=16161 bits_offset=112
	'reserved_at_f' type_id=401 bits_offset=120
	'fdb_multi_path_any_table' type_id=16161 bits_offset=144
	'reserved_at_13' type_id=2689 bits_offset=152
	'fdb_modify_header_fwd_to_table' type_id=16161 bits_offset=168
	'fdb_ipv4_ttl_modify' type_id=16161 bits_offset=176
	'flow_source' type_id=16161 bits_offset=184
	'reserved_at_18' type_id=2689 bits_offset=192
	'multi_fdb_encap' type_id=16161 bits_offset=208
	'egress_acl_forward_to_vport' type_id=16161 bits_offset=216
	'fdb_multi_path_to_table' type_id=16161 bits_offset=224
	'reserved_at_1d' type_id=401 bits_offset=232
	'reserved_at_20' type_id=140132 bits_offset=256
	'flow_table_properties_nic_esw_fdb' type_id=140131 bits_offset=4096
	'flow_table_properties_esw_acl_ingress' type_id=140131 bits_offset=8192
	'flow_table_properties_esw_acl_egress' type_id=140131 bits_offset=12288
	'reserved_at_800' type_id=140134 bits_offset=16384
	'ft_field_support_2_esw_fdb' type_id=140130 bits_offset=40960
	'ft_field_bitmask_support_2_esw_fdb' type_id=140130 bits_offset=41984
	'reserved_at_1500' type_id=140128 bits_offset=43008
	'sw_steering_fdb_action_drop_icm_address_rx' type_id=1843 bits_offset=49152
	'sw_steering_fdb_action_drop_icm_address_tx' type_id=1843 bits_offset=49664
	'sw_steering_uplink_icm_address_rx' type_id=1843 bits_offset=50176
	'sw_steering_uplink_icm_address_tx' type_id=1843 bits_offset=50688
	'reserved_at_1900' type_id=140135 bits_offset=51200
[140134] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=3072
[140135] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=26368
[140136] STRUCT 'mlx5_ifc_e_switch_cap_bits' size=2048 vlen=30
	'vport_svlan_strip' type_id=16161 bits_offset=0
	'vport_cvlan_strip' type_id=16161 bits_offset=8
	'vport_svlan_insert' type_id=16161 bits_offset=16
	'vport_cvlan_insert_if_not_exist' type_id=16161 bits_offset=24
	'vport_cvlan_insert_overwrite' type_id=16161 bits_offset=32
	'reserved_at_5' type_id=16161 bits_offset=40
	'vport_cvlan_insert_always' type_id=16161 bits_offset=48
	'esw_shared_ingress_acl' type_id=16161 bits_offset=56
	'esw_uplink_ingress_acl' type_id=16161 bits_offset=64
	'root_ft_on_other_esw' type_id=16161 bits_offset=72
	'reserved_at_a' type_id=2960 bits_offset=80
	'esw_functions_changed' type_id=16161 bits_offset=200
	'reserved_at_1a' type_id=16161 bits_offset=208
	'ecpf_vport_exists' type_id=16161 bits_offset=216
	'counter_eswitch_affinity' type_id=16161 bits_offset=224
	'merged_eswitch' type_id=16161 bits_offset=232
	'nic_vport_node_guid_modify' type_id=16161 bits_offset=240
	'nic_vport_port_guid_modify' type_id=16161 bits_offset=248
	'vxlan_encap_decap' type_id=16161 bits_offset=256
	'nvgre_encap_decap' type_id=16161 bits_offset=264
	'reserved_at_22' type_id=16161 bits_offset=272
	'log_max_fdb_encap_uplink' type_id=4325 bits_offset=280
	'reserved_at_21' type_id=401 bits_offset=320
	'log_max_packet_reformat_context' type_id=4325 bits_offset=344
	'reserved_2b' type_id=4362 bits_offset=384
	'max_encap_header_size' type_id=19155 bits_offset=432
	'reserved_at_40' type_id=33386 bits_offset=512
	'log_max_esw_sf' type_id=4325 bits_offset=600
	'esw_sf_base_id' type_id=474 bits_offset=640
	'reserved_at_60' type_id=140137 bits_offset=768
[140137] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1952
[140138] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_SQC_STATE_RST' val=0
	'MLX5_SQC_STATE_RDY' val=1
	'MLX5_SQC_STATE_ERR' val=3
[140139] ENUM 'mlx5_reformat_ctx_type' encoding=UNSIGNED size=4 vlen=17
	'MLX5_REFORMAT_TYPE_L2_TO_VXLAN' val=0
	'MLX5_REFORMAT_TYPE_L2_TO_NVGRE' val=1
	'MLX5_REFORMAT_TYPE_L2_TO_L2_TUNNEL' val=2
	'MLX5_REFORMAT_TYPE_L3_TUNNEL_TO_L2' val=3
	'MLX5_REFORMAT_TYPE_L2_TO_L3_TUNNEL' val=4
	'MLX5_REFORMAT_TYPE_ADD_ESP_TRANSPORT_OVER_IPV4' val=5
	'MLX5_REFORMAT_TYPE_L2_TO_L3_ESP_TUNNEL' val=6
	'MLX5_REFORMAT_TYPE_ADD_ESP_TRANSPORT_OVER_UDPV4' val=7
	'MLX5_REFORMAT_TYPE_DEL_ESP_TRANSPORT' val=8
	'MLX5_REFORMAT_TYPE_L3_ESP_TUNNEL_TO_L2' val=9
	'MLX5_REFORMAT_TYPE_DEL_ESP_TRANSPORT_OVER_UDP' val=10
	'MLX5_REFORMAT_TYPE_ADD_ESP_TRANSPORT_OVER_IPV6' val=11
	'MLX5_REFORMAT_TYPE_ADD_ESP_TRANSPORT_OVER_UDPV6' val=12
	'MLX5_REFORMAT_TYPE_INSERT_HDR' val=15
	'MLX5_REFORMAT_TYPE_REMOVE_HDR' val=16
	'MLX5_REFORMAT_TYPE_ADD_MACSEC' val=17
	'MLX5_REFORMAT_TYPE_DEL_MACSEC' val=18
[140140] ENUM 'mlx5_inline_modes' encoding=UNSIGNED size=4 vlen=4
	'MLX5_INLINE_MODE_NONE' val=0
	'MLX5_INLINE_MODE_L2' val=1
	'MLX5_INLINE_MODE_IP' val=2
	'MLX5_INLINE_MODE_TCP_UDP' val=3
[140141] PTR '(anon)' type_id=140651
[140142] STRUCT 'mlx5_eswitch' size=13264 vlen=28
	'dev' type_id=139673 bits_offset=0
	'nb' type_id=139666 bits_offset=64
	'fdb_table' type_id=140175 bits_offset=320
	'mc_table' type_id=7038 bits_offset=18048
	'mc_promisc' type_id=140179 bits_offset=34432
	'debugfs_root' type_id=912 bits_offset=34752
	'work_queue' type_id=542 bits_offset=34816
	'vports' type_id=660 bits_offset=34880
	'flags' type_id=21 bits_offset=35008
	'total_vports' type_id=13 bits_offset=35040
	'enabled_vports' type_id=13 bits_offset=35072
	'state_lock' type_id=155 bits_offset=35136
	'mode_lock' type_id=531 bits_offset=35392
	'user_count' type_id=53 bits_offset=35712
	'qos' type_id=140181 bits_offset=35776
	'br_offloads' type_id=140183 bits_offset=36096
	'offloads' type_id=140176 bits_offset=36160
	'mode' type_id=13 bits_offset=104960
	'manager_vport' type_id=20 bits_offset=104992
	'first_host_vport' type_id=20 bits_offset=105008
	'num_peers' type_id=19 bits_offset=105024
	'esw_funcs' type_id=140180 bits_offset=105088
	'params' type_id=140182 bits_offset=105408
	'n_head' type_id=1866 bits_offset=105472
	'paired' type_id=660 bits_offset=105856
	'devcom' type_id=139723 bits_offset=105984
	'enabled_ipsec_vf_count' type_id=20 bits_offset=106048
	'eswitch_operation_in_progress' type_id=42 bits_offset=106064
[140143] STRUCT 'mod_hdr_tbl' size=2080 vlen=2
	'lock' type_id=155 bits_offset=0
	'hlist' type_id=7038 bits_offset=256
[140144] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_SEND_WQE_DS' val=16
	'MLX5_SEND_WQE_BB' val=64
[140145] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_SEND_WQE_MAX_WQEBBS' val=16
[140146] ENUM 'mlx5_tunnel_types' encoding=UNSIGNED size=4 vlen=7
	'MLX5_TT_IPV4_GRE' val=0
	'MLX5_TT_IPV6_GRE' val=1
	'MLX5_TT_IPV4_IPIP' val=2
	'MLX5_TT_IPV6_IPIP' val=3
	'MLX5_TT_IPV4_IPV6' val=4
	'MLX5_TT_IPV6_IPV6' val=5
	'MLX5_NUM_TUNNEL_TT' val=6
[140147] ENUM 'mlx5e_channel_state' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_CHANNEL_STATE_XSK' val=0
	'MLX5E_CHANNEL_NUM_STATES' val=1
[140148] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'REP_ETH' val=0
	'REP_IB' val=1
	'NUM_REP_TYPES' val=2
[140149] ENUM 'mlx5_switchdev_event' encoding=UNSIGNED size=4 vlen=2
	'MLX5_SWITCHDEV_EVENT_PAIR' val=0
	'MLX5_SWITCHDEV_EVENT_UNPAIR' val=1
[140150] STRUCT 'mlx5_eswitch_rep_ops' size=32 vlen=4
	'load' type_id=140155 bits_offset=0
	'unload' type_id=140157 bits_offset=64
	'get_proto_dev' type_id=140159 bits_offset=128
	'event' type_id=140161 bits_offset=192
[140151] CONST '(anon)' type_id=140150
[140152] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'(anon)' type_id=139673
	'(anon)' type_id=140153
[140153] PTR '(anon)' type_id=140154
[140154] STRUCT 'mlx5_eswitch_rep' size=56 vlen=6
	'rep_data' type_id=140163 bits_offset=0
	'vport' type_id=20 bits_offset=256
	'vlan' type_id=20 bits_offset=272
	'vport_index' type_id=20 bits_offset=288
	'vlan_refcount' type_id=21 bits_offset=320
	'esw' type_id=139720 bits_offset=384
[140155] PTR '(anon)' type_id=140152
[140156] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=140153
[140157] PTR '(anon)' type_id=140156
[140158] FUNC_PROTO '(anon)' ret_type_id=64 vlen=1
	'(anon)' type_id=140153
[140159] PTR '(anon)' type_id=140158
[140160] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=139720
	'(anon)' type_id=140153
	'(anon)' type_id=140149
	'(anon)' type_id=64
[140161] PTR '(anon)' type_id=140160
[140162] STRUCT 'mlx5_eswitch_rep_data' size=16 vlen=2
	'priv' type_id=64 bits_offset=0
	'state' type_id=51 bits_offset=64
[140163] ARRAY '(anon)' type_id=140162 index_type_id=13 nr_elems=2
[140164] STRUCT 'l2addr_node' size=24 vlen=2
	'hlist' type_id=57 bits_offset=0
	'addr' type_id=4362 bits_offset=128
[140165] PTR '(anon)' type_id=147653
[140166] PTR '(anon)' type_id=145632
[140167] STRUCT 'legacy_fdb' size=56 vlen=7
	'fdb' type_id=139705 bits_offset=0
	'addr_grp' type_id=139706 bits_offset=64
	'allmulti_grp' type_id=139706 bits_offset=128
	'promisc_grp' type_id=139706 bits_offset=192
	'vepa_fdb' type_id=139705 bits_offset=256
	'vepa_uplink_rule' type_id=139707 bits_offset=320
	'vepa_star_rule' type_id=139707 bits_offset=384
[140168] STRUCT '(anon)' size=2080 vlen=2
	'table' type_id=7038 bits_offset=0
	'lock' type_id=155 bits_offset=16384
[140169] STRUCT 'offloads_fdb' size=2208 vlen=14
	'ns' type_id=140083 bits_offset=0
	'tc_miss_table' type_id=139705 bits_offset=64
	'slow_fdb' type_id=139705 bits_offset=128
	'send_to_vport_grp' type_id=139706 bits_offset=192
	'send_to_vport_meta_grp' type_id=139706 bits_offset=256
	'peer_miss_grp' type_id=139706 bits_offset=320
	'peer_miss_rules' type_id=140170 bits_offset=384
	'miss_grp' type_id=139706 bits_offset=640
	'send_to_vport_meta_rules' type_id=140171 bits_offset=704
	'miss_rule_uni' type_id=139707 bits_offset=768
	'miss_rule_multi' type_id=139707 bits_offset=832
	'esw_chains_priv' type_id=140172 bits_offset=896
	'vports' type_id=140168 bits_offset=960
	'indir' type_id=140173 bits_offset=17600
[140170] ARRAY '(anon)' type_id=140171 index_type_id=13 nr_elems=4
[140171] PTR '(anon)' type_id=139707
[140172] PTR '(anon)' type_id=147230
[140173] PTR '(anon)' type_id=140627
[140174] UNION '(anon)' size=2208 vlen=2
	'legacy' type_id=140167 bits_offset=0
	'offloads' type_id=140169 bits_offset=0
[140175] STRUCT 'mlx5_eswitch_fdb' size=2216 vlen=2
	'(anon)' type_id=140174 bits_offset=0
	'flags' type_id=21 bits_offset=17664
[140176] STRUCT 'mlx5_esw_offload' size=8600 vlen=28
	'ft_offloads_restore' type_id=139705 bits_offset=0
	'restore_group' type_id=139706 bits_offset=64
	'restore_copy_hdr_id' type_id=140080 bits_offset=128
	'reg_c0_obj_pool' type_id=140165 bits_offset=192
	'ft_offloads' type_id=139705 bits_offset=256
	'vport_rx_group' type_id=139706 bits_offset=320
	'vport_rx_drop_group' type_id=139706 bits_offset=384
	'vport_rx_drop_rule' type_id=139707 bits_offset=448
	'ft_ipsec_tx_pol' type_id=139705 bits_offset=512
	'vport_reps' type_id=660 bits_offset=576
	'peer_flows' type_id=90480 bits_offset=704
	'peer_mutex' type_id=155 bits_offset=1216
	'encap_tbl_lock' type_id=155 bits_offset=1472
	'encap_tbl' type_id=7038 bits_offset=1728
	'decap_tbl_lock' type_id=155 bits_offset=18112
	'decap_tbl' type_id=7038 bits_offset=18368
	'mod_hdr' type_id=140143 bits_offset=34752
	'termtbl_tbl' type_id=7038 bits_offset=51392
	'termtbl_mutex' type_id=155 bits_offset=67776
	'vhca_map' type_id=660 bits_offset=68032
	'rep_ops' type_id=140177 bits_offset=68160
	'inline_mode' type_id=19 bits_offset=68288
	'num_flows' type_id=53 bits_offset=68352
	'num_block_encap' type_id=23 bits_offset=68416
	'num_block_mode' type_id=23 bits_offset=68480
	'encap' type_id=24427 bits_offset=68544
	'vport_metadata_ida' type_id=15008 bits_offset=68608
	'host_number' type_id=6 bits_offset=68736
[140177] ARRAY '(anon)' type_id=140178 index_type_id=13 nr_elems=2
[140178] PTR '(anon)' type_id=140151
[140179] STRUCT 'esw_mc_addr' size=40 vlen=3
	'node' type_id=140164 bits_offset=0
	'uplink_rule' type_id=139707 bits_offset=192
	'refcnt' type_id=21 bits_offset=256
[140180] STRUCT 'mlx5_esw_functions' size=40 vlen=3
	'nb' type_id=139666 bits_offset=0
	'num_vfs' type_id=20 bits_offset=256
	'num_ec_vfs' type_id=20 bits_offset=272
[140181] STRUCT '(anon)' size=40 vlen=4
	'root_tsar_ix' type_id=21 bits_offset=0
	'group0' type_id=140166 bits_offset=64
	'groups' type_id=54 bits_offset=128
	'refcnt' type_id=178 bits_offset=256
[140182] STRUCT '(anon)' size=4 vlen=1
	'large_group_num' type_id=21 bits_offset=0
[140183] PTR '(anon)' type_id=140353
[140184] ENUM 'mlx5_flow_match_level' encoding=UNSIGNED size=4 vlen=4
	'MLX5_MATCH_NONE' val=0
	'MLX5_MATCH_L2' val=1
	'MLX5_MATCH_L3' val=2
	'MLX5_MATCH_L4' val=3
[140185] UNION '(anon)' size=16 vlen=2
	'v4' type_id=1851 bits_offset=0
	'v6' type_id=1904 bits_offset=0
[140186] STRUCT 'mlx5e_neigh' size=20 vlen=2
	'dst_ip' type_id=140185 bits_offset=0
	'family' type_id=13 bits_offset=128
[140187] STRUCT 'mlx5e_neigh_hash_entry' size=120 vlen=10
	'rhash_node' type_id=876 bits_offset=0
	'm_neigh' type_id=140186 bits_offset=64
	'priv' type_id=139858 bits_offset=256
	'neigh_dev' type_id=1996 bits_offset=320
	'neigh_list' type_id=54 bits_offset=384
	'encap_list_lock' type_id=154 bits_offset=512
	'encap_list' type_id=54 bits_offset=576
	'refcnt' type_id=178 bits_offset=704
	'reported_lastuse' type_id=1 bits_offset=768
	'rcu' type_id=60 bits_offset=832
[140188] STRUCT 'mlx5e_mpls_info' size=8 vlen=4
	'label' type_id=21 bits_offset=0
	'tc' type_id=19 bits_offset=32
	'bos' type_id=19 bits_offset=40
	'ttl' type_id=19 bits_offset=48
[140189] STRUCT 'mlx5e_encap_entry' size=208 vlen=20
	'nhe' type_id=140190 bits_offset=0
	'encap_list' type_id=54 bits_offset=64
	'encap_hlist' type_id=57 bits_offset=192
	'flows' type_id=54 bits_offset=320
	'route_list' type_id=54 bits_offset=448
	'pkt_reformat' type_id=140068 bits_offset=576
	'tun_info' type_id=62968 bits_offset=640
	'mpls_info' type_id=140188 bits_offset=704
	'h_dest' type_id=351 bits_offset=768
	'out_dev' type_id=1996 bits_offset=832
	'route_dev_ifindex' type_id=13 bits_offset=896
	'tunnel' type_id=140192 bits_offset=960
	'reformat_type' type_id=13 bits_offset=1024
	'flags' type_id=19 bits_offset=1056
	'encap_header' type_id=36 bits_offset=1088
	'encap_size' type_id=13 bits_offset=1152
	'refcnt' type_id=178 bits_offset=1184
	'res_ready' type_id=508 bits_offset=1216
	'compl_result' type_id=13 bits_offset=1472
	'rcu' type_id=60 bits_offset=1536
[140190] PTR '(anon)' type_id=140187
[140191] STRUCT 'mlx5e_tc_tunnel' size=72 vlen=10
	'tunnel_type' type_id=13 bits_offset=0
	'match_level' type_id=140184 bits_offset=32
	'can_offload' type_id=140197 bits_offset=64
	'calc_hlen' type_id=140200 bits_offset=128
	'init_encap_attr' type_id=140202 bits_offset=192
	'generate_ip_tun_hdr' type_id=140204 bits_offset=256
	'parse_udp_ports' type_id=140206 bits_offset=320
	'parse_tunnel' type_id=140206 bits_offset=384
	'encap_info_equal' type_id=140209 bits_offset=448
	'get_remote_ifindex' type_id=7903 bits_offset=512
[140192] PTR '(anon)' type_id=140191
[140193] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=5
	'MLX5E_TC_TUNNEL_TYPE_UNKNOWN' val=0
	'MLX5E_TC_TUNNEL_TYPE_VXLAN' val=1
	'MLX5E_TC_TUNNEL_TYPE_GENEVE' val=2
	'MLX5E_TC_TUNNEL_TYPE_GRETAP' val=3
	'MLX5E_TC_TUNNEL_TYPE_MPLSOUDP' val=4
[140194] STRUCT 'mlx5e_encap_key' size=16 vlen=2
	'ip_tun_key' type_id=140195 bits_offset=0
	'tc_tunnel' type_id=140192 bits_offset=64
[140195] PTR '(anon)' type_id=140112
[140196] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'(anon)' type_id=139858
[140197] PTR '(anon)' type_id=140196
[140198] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=140199
[140199] PTR '(anon)' type_id=140189
[140200] PTR '(anon)' type_id=140198
[140201] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=1996
	'(anon)' type_id=139858
	'(anon)' type_id=140199
	'(anon)' type_id=7783
[140202] PTR '(anon)' type_id=140201
[140203] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=36
	'(anon)' type_id=10748
	'(anon)' type_id=140199
[140204] PTR '(anon)' type_id=140203
[140205] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'(anon)' type_id=139858
	'(anon)' type_id=140109
	'(anon)' type_id=20614
	'(anon)' type_id=64
	'(anon)' type_id=64
[140206] PTR '(anon)' type_id=140205
[140207] FUNC_PROTO '(anon)' ret_type_id=42 vlen=2
	'(anon)' type_id=140208
	'(anon)' type_id=140208
[140208] PTR '(anon)' type_id=140194
[140209] PTR '(anon)' type_id=140207
[140210] PTR '(anon)' type_id=140123
[140211] PTR '(anon)' type_id=140119
[140212] PTR '(anon)' type_id=140115
[140213] PTR '(anon)' type_id=140113
[140214] PTR '(anon)' type_id=140114
[140215] CONST '(anon)' type_id=20588
[140216] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=448
[140217] STRUCT 'mlx5_ifc_flow_table_nic_cap_bits' size=32768 vlen=27
	'nic_rx_multi_path_tirs' type_id=16161 bits_offset=0
	'nic_rx_multi_path_tirs_fts' type_id=16161 bits_offset=8
	'allow_sniffer_and_nic_rx_shared_tir' type_id=16161 bits_offset=16
	'reserved_at_3' type_id=2120 bits_offset=24
	'sw_owner_reformat_supported' type_id=16161 bits_offset=56
	'reserved_at_8' type_id=9799 bits_offset=64
	'encap_general_header' type_id=16161 bits_offset=256
	'reserved_at_21' type_id=19155 bits_offset=264
	'log_max_packet_reformat_context' type_id=4325 bits_offset=344
	'reserved_at_30' type_id=4362 bits_offset=384
	'max_encap_header_size' type_id=19155 bits_offset=432
	'reserved_at_40' type_id=140216 bits_offset=512
	'flow_table_properties_nic_receive' type_id=140131 bits_offset=4096
	'flow_table_properties_nic_receive_rdma' type_id=140131 bits_offset=8192
	'flow_table_properties_nic_receive_sniffer' type_id=140131 bits_offset=12288
	'flow_table_properties_nic_transmit' type_id=140131 bits_offset=16384
	'flow_table_properties_nic_transmit_rdma' type_id=140131 bits_offset=20480
	'flow_table_properties_nic_transmit_sniffer' type_id=140131 bits_offset=24576
	'reserved_at_e00' type_id=140218 bits_offset=28672
	'ft_field_support_2_nic_receive_rdma' type_id=140130 bits_offset=43008
	'reserved_at_1580' type_id=140219 bits_offset=44032
	'ft_field_support_2_nic_transmit_rdma' type_id=140130 bits_offset=49152
	'reserved_at_1880' type_id=140220 bits_offset=50176
	'sw_steering_nic_rx_action_drop_icm_address' type_id=1843 bits_offset=65536
	'sw_steering_nic_tx_action_drop_icm_address' type_id=1843 bits_offset=66048
	'sw_steering_nic_tx_action_allow_icm_address' type_id=1843 bits_offset=66560
	'reserved_at_20c0' type_id=140221 bits_offset=67072
[140218] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1792
[140219] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=640
[140220] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1920
[140221] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=24384
[140222] ENUM 'mlx5_flow_namespace_type' encoding=UNSIGNED size=4 vlen=27
	'MLX5_FLOW_NAMESPACE_BYPASS' val=0
	'MLX5_FLOW_NAMESPACE_KERNEL_RX_MACSEC' val=1
	'MLX5_FLOW_NAMESPACE_LAG' val=2
	'MLX5_FLOW_NAMESPACE_OFFLOADS' val=3
	'MLX5_FLOW_NAMESPACE_ETHTOOL' val=4
	'MLX5_FLOW_NAMESPACE_KERNEL' val=5
	'MLX5_FLOW_NAMESPACE_LEFTOVERS' val=6
	'MLX5_FLOW_NAMESPACE_ANCHOR' val=7
	'MLX5_FLOW_NAMESPACE_FDB_BYPASS' val=8
	'MLX5_FLOW_NAMESPACE_FDB' val=9
	'MLX5_FLOW_NAMESPACE_ESW_EGRESS' val=10
	'MLX5_FLOW_NAMESPACE_ESW_INGRESS' val=11
	'MLX5_FLOW_NAMESPACE_SNIFFER_RX' val=12
	'MLX5_FLOW_NAMESPACE_SNIFFER_TX' val=13
	'MLX5_FLOW_NAMESPACE_EGRESS' val=14
	'MLX5_FLOW_NAMESPACE_EGRESS_IPSEC' val=15
	'MLX5_FLOW_NAMESPACE_EGRESS_MACSEC' val=16
	'MLX5_FLOW_NAMESPACE_RDMA_RX' val=17
	'MLX5_FLOW_NAMESPACE_RDMA_RX_KERNEL' val=18
	'MLX5_FLOW_NAMESPACE_RDMA_TX' val=19
	'MLX5_FLOW_NAMESPACE_PORT_SEL' val=20
	'MLX5_FLOW_NAMESPACE_RDMA_RX_COUNTERS' val=21
	'MLX5_FLOW_NAMESPACE_RDMA_TX_COUNTERS' val=22
	'MLX5_FLOW_NAMESPACE_RDMA_RX_IPSEC' val=23
	'MLX5_FLOW_NAMESPACE_RDMA_TX_IPSEC' val=24
	'MLX5_FLOW_NAMESPACE_RDMA_RX_MACSEC' val=25
	'MLX5_FLOW_NAMESPACE_RDMA_TX_MACSEC' val=26
[140223] STRUCT 'mlx5e_tc_mod_hdr_acts' size=24 vlen=4
	'num_actions' type_id=13 bits_offset=0
	'max_actions' type_id=13 bits_offset=32
	'is_static' type_id=42 bits_offset=64
	'actions' type_id=64 bits_offset=128
[140224] ARRAY '(anon)' type_id=1 index_type_id=13 nr_elems=32
[140225] STRUCT 'mlx5_ct_attr' size=48 vlen=8
	'zone' type_id=20 bits_offset=0
	'ct_action' type_id=20 bits_offset=16
	'nf_ft' type_id=140141 bits_offset=64
	'ct_labels_id' type_id=21 bits_offset=128
	'act_miss_mapping' type_id=21 bits_offset=160
	'act_miss_cookie' type_id=23 bits_offset=192
	'offloaded' type_id=42 bits_offset=256
	'ft' type_id=140226 bits_offset=320
[140226] PTR '(anon)' type_id=140690
[140227] STRUCT 'mlx5e_sample_attr' size=32 vlen=6
	'group_num' type_id=21 bits_offset=0
	'rate' type_id=21 bits_offset=32
	'trunc_size' type_id=21 bits_offset=64
	'restore_obj_id' type_id=21 bits_offset=96
	'sampler_id' type_id=21 bits_offset=128
	'sample_flow' type_id=140228 bits_offset=192
[140228] PTR '(anon)' type_id=143273
[140229] PTR '(anon)' type_id=147913
[140230] STRUCT '(anon)' size=40 vlen=7
	'flags' type_id=21 bits_offset=0
	'vport_valid' type_id=42 bits_offset=32
	'vport' type_id=20 bits_offset=48
	'pkt_reformat' type_id=140068 bits_offset=64
	'mdev' type_id=139673 bits_offset=128
	'termtbl' type_id=140231 bits_offset=192
	'src_port_rewrite_act_id' type_id=13 bits_offset=256
[140231] PTR '(anon)' type_id=140315
[140232] STRUCT 'mlx5_esw_flow_attr' size=1376 vlen=15
	'in_rep' type_id=140153 bits_offset=0
	'in_mdev' type_id=139673 bits_offset=64
	'counter_dev' type_id=139673 bits_offset=128
	'dest_int_port' type_id=140233 bits_offset=192
	'int_port' type_id=140233 bits_offset=256
	'split_count' type_id=13 bits_offset=320
	'out_count' type_id=13 bits_offset=352
	'vlan_proto' type_id=24223 bits_offset=384
	'vlan_vid' type_id=2841 bits_offset=416
	'vlan_prio' type_id=2689 bits_offset=448
	'total_vlan' type_id=19 bits_offset=464
	'dests' type_id=140234 bits_offset=512
	'rx_tun_attr' type_id=140236 bits_offset=10752
	'eth' type_id=12062 bits_offset=10816
	'decap_pkt_reformat' type_id=140068 bits_offset=10944
[140233] PTR '(anon)' type_id=145109
[140234] ARRAY '(anon)' type_id=140230 index_type_id=13 nr_elems=32
[140235] STRUCT 'mlx5_rx_tun_attr' size=36 vlen=3
	'decap_vport' type_id=20 bits_offset=0
	'src_ip' type_id=140185 bits_offset=32
	'dst_ip' type_id=140185 bits_offset=160
[140236] PTR '(anon)' type_id=140235
[140237] PTR '(anon)' type_id=140706
[140238] PTR '(anon)' type_id=146092
[140239] STRUCT 'mlx5e_decap_key' size=14 vlen=1
	'key' type_id=12062 bits_offset=0
[140240] STRUCT 'mlx5e_decap_entry' size=120 vlen=8
	'key' type_id=140239 bits_offset=0
	'flows' type_id=54 bits_offset=128
	'hlist' type_id=57 bits_offset=256
	'refcnt' type_id=178 bits_offset=384
	'res_ready' type_id=508 bits_offset=448
	'compl_result' type_id=13 bits_offset=704
	'pkt_reformat' type_id=140068 bits_offset=768
	'rcu' type_id=60 bits_offset=832
[140241] ENUM 'mlx5e_flow_meter_mode' encoding=UNSIGNED size=4 vlen=2
	'MLX5_RATE_LIMIT_BPS' val=0
	'MLX5_RATE_LIMIT_PPS' val=1
[140242] STRUCT 'mlx5e_flow_meter_params' size=32 vlen=5
	'mode' type_id=140241 bits_offset=0
	'index' type_id=21 bits_offset=32
	'rate' type_id=23 bits_offset=64
	'burst' type_id=23 bits_offset=128
	'mtu' type_id=21 bits_offset=192
[140243] STRUCT 'mlx5e_flow_meter_handle' size=96 vlen=9
	'flow_meters' type_id=140238 bits_offset=0
	'meters_obj' type_id=140244 bits_offset=64
	'obj_id' type_id=21 bits_offset=128
	'idx' type_id=19 bits_offset=160
	'refcnt' type_id=13 bits_offset=192
	'hlist' type_id=57 bits_offset=256
	'params' type_id=140242 bits_offset=384
	'act_counter' type_id=140229 bits_offset=640
	'drop_counter' type_id=140229 bits_offset=704
[140244] PTR '(anon)' type_id=146093
[140245] STRUCT 'mlx5e_meter_attr' size=48 vlen=3
	'params' type_id=140242 bits_offset=0
	'meter' type_id=140246 bits_offset=256
	'post_meter' type_id=140247 bits_offset=320
[140246] PTR '(anon)' type_id=140243
[140247] PTR '(anon)' type_id=144731
[140248] STRUCT 'mlx5_nic_flow_attr' size=16 vlen=3
	'flow_tag' type_id=21 bits_offset=0
	'hairpin_tirn' type_id=21 bits_offset=32
	'hairpin_ft' type_id=139705 bits_offset=64
[140249] STRUCT '(anon)' size=0 vlen=2
	'__empty_esw_attr' type_id=526 bits_offset=0
	'esw_attr' type_id=140250 bits_offset=0
[140250] ARRAY '(anon)' type_id=140232 index_type_id=13 nr_elems=0
[140251] STRUCT '(anon)' size=0 vlen=2
	'__empty_nic_attr' type_id=526 bits_offset=0
	'nic_attr' type_id=140252 bits_offset=0
[140252] ARRAY '(anon)' type_id=140248 index_type_id=13 nr_elems=0
[140253] UNION '(anon)' size=0 vlen=2
	'(anon)' type_id=140249 bits_offset=0
	'(anon)' type_id=140251 bits_offset=0
[140254] STRUCT 'mlx5_flow_attr' size=536 vlen=29
	'action' type_id=21 bits_offset=0
	'tc_act_cookies' type_id=140224 bits_offset=64
	'counter' type_id=140229 bits_offset=2112
	'modify_hdr' type_id=140080 bits_offset=2176
	'mh' type_id=140255 bits_offset=2240
	'slow_mh' type_id=140255 bits_offset=2304
	'ct_attr' type_id=140225 bits_offset=2368
	'sample_attr' type_id=140227 bits_offset=2752
	'meter_attr' type_id=140245 bits_offset=3008
	'parse_attr' type_id=140257 bits_offset=3392
	'chain' type_id=21 bits_offset=3456
	'prio' type_id=20 bits_offset=3488
	'tc_act_cookies_count' type_id=20 bits_offset=3504
	'dest_chain' type_id=21 bits_offset=3520
	'ft' type_id=139705 bits_offset=3584
	'dest_ft' type_id=139705 bits_offset=3648
	'inner_match_level' type_id=19 bits_offset=3712
	'outer_match_level' type_id=19 bits_offset=3720
	'tun_ip_version' type_id=19 bits_offset=3728
	'tunnel_id' type_id=13 bits_offset=3744
	'flags' type_id=21 bits_offset=3776
	'exe_aso_type' type_id=21 bits_offset=3808
	'list' type_id=54 bits_offset=3840
	'post_act_handle' type_id=140258 bits_offset=3968
	'branch_true' type_id=140259 bits_offset=4032
	'branch_false' type_id=140259 bits_offset=4096
	'jumping_attr' type_id=140259 bits_offset=4160
	'act_id_restore_rule' type_id=139707 bits_offset=4224
	'(anon)' type_id=140253 bits_offset=4288
[140255] PTR '(anon)' type_id=146081
[140256] STRUCT 'mlx5e_tc_flow_parse_attr' size=2352 vlen=8
	'tun_info' type_id=140287 bits_offset=0
	'mpls_info' type_id=140288 bits_offset=2048
	'filter_dev' type_id=1996 bits_offset=4096
	'spec' type_id=140064 bits_offset=4160
	'hdrs' type_id=140289 bits_offset=12480
	'mod_hdr_acts' type_id=140223 bits_offset=16000
	'mirred_ifindex' type_id=13367 bits_offset=16192
	'parse_state' type_id=140263 bits_offset=17216
[140257] PTR '(anon)' type_id=140256
[140258] PTR '(anon)' type_id=146488
[140259] PTR '(anon)' type_id=140254
[140260] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=6
	'MLX5E_TC_FLAG_INGRESS_BIT' val=0
	'MLX5E_TC_FLAG_EGRESS_BIT' val=1
	'MLX5E_TC_FLAG_NIC_OFFLOAD_BIT' val=2
	'MLX5E_TC_FLAG_ESW_OFFLOAD_BIT' val=3
	'MLX5E_TC_FLAG_FT_OFFLOAD_BIT' val=4
	'MLX5E_TC_FLAG_LAST_EXPORTED_BIT' val=4
[140261] STRUCT 'pedit_headers' size=108 vlen=6
	'eth' type_id=12062 bits_offset=0
	'vlan' type_id=22801 bits_offset=112
	'ip4' type_id=12500 bits_offset=160
	'ip6' type_id=12474 bits_offset=320
	'tcp' type_id=12488 bits_offset=640
	'udp' type_id=12489 bits_offset=800
[140262] STRUCT 'pedit_headers_action' size=220 vlen=3
	'vals' type_id=140261 bits_offset=0
	'masks' type_id=140261 bits_offset=864
	'pedits' type_id=21 bits_offset=1728
[140263] STRUCT 'mlx5e_tc_act_parse_state' size=200 vlen=15
	'flow_action' type_id=32696 bits_offset=0
	'flow' type_id=140265 bits_offset=64
	'extack' type_id=7783 bits_offset=128
	'actions' type_id=21 bits_offset=192
	'encap' type_id=42 bits_offset=224
	'decap' type_id=42 bits_offset=232
	'mpls_push' type_id=42 bits_offset=240
	'eth_push' type_id=42 bits_offset=248
	'eth_pop' type_id=42 bits_offset=256
	'ptype_host' type_id=42 bits_offset=264
	'tun_info' type_id=62968 bits_offset=320
	'mpls_info' type_id=140188 bits_offset=384
	'ifindexes' type_id=13367 bits_offset=448
	'if_count' type_id=13 bits_offset=1472
	'ct_priv' type_id=140237 bits_offset=1536
[140264] STRUCT 'mlx5e_tc_flow' size=1904 vlen=26
	'node' type_id=876 bits_offset=0
	'priv' type_id=139858 bits_offset=64
	'cookie' type_id=23 bits_offset=128
	'flags' type_id=1 bits_offset=192
	'rule' type_id=140293 bits_offset=256
	'l3_to_l2_reformat' type_id=54 bits_offset=384
	'decap_reformat' type_id=140294 bits_offset=512
	'decap_routes' type_id=54 bits_offset=576
	'decap_route' type_id=140292 bits_offset=704
	'encap_routes' type_id=140295 bits_offset=768
	'encaps' type_id=140296 bits_offset=4864
	'hpe' type_id=140297 bits_offset=13056
	'hairpin' type_id=54 bits_offset=13120
	'peer' type_id=90480 bits_offset=13248
	'unready' type_id=54 bits_offset=13760
	'peer_flows' type_id=54 bits_offset=13888
	'orig_dev' type_id=1996 bits_offset=14016
	'tmp_entry_index' type_id=13 bits_offset=14080
	'tmp_list' type_id=54 bits_offset=14144
	'refcnt' type_id=178 bits_offset=14272
	'callback_head' type_id=60 bits_offset=14336
	'init_done' type_id=508 bits_offset=14464
	'del_hw_done' type_id=508 bits_offset=14720
	'attr' type_id=140259 bits_offset=14976
	'attrs' type_id=54 bits_offset=15040
	'chain_mapping' type_id=21 bits_offset=15168
[140265] PTR '(anon)' type_id=140264
[140266] STRUCT 'mlx5e_tc_act_branch_ctrl' size=8 vlen=2
	'act_id' type_id=20563 bits_offset=0
	'extval' type_id=21 bits_offset=32
[140267] STRUCT 'mlx5e_tc_act' size=80 vlen=10
	'can_offload' type_id=140271 bits_offset=0
	'parse_action' type_id=140273 bits_offset=64
	'post_parse' type_id=140275 bits_offset=128
	'is_multi_table_act' type_id=140277 bits_offset=192
	'is_missable' type_id=140279 bits_offset=256
	'offload_action' type_id=140281 bits_offset=320
	'destroy_action' type_id=140283 bits_offset=384
	'stats_action' type_id=140283 bits_offset=448
	'get_branch_ctrl' type_id=140286 bits_offset=512
	'is_terminating_action' type_id=42 bits_offset=576
[140268] FUNC_PROTO '(anon)' ret_type_id=42 vlen=4
	'(anon)' type_id=140269
	'(anon)' type_id=140270
	'(anon)' type_id=13
	'(anon)' type_id=140259
[140269] PTR '(anon)' type_id=140263
[140270] PTR '(anon)' type_id=140215
[140271] PTR '(anon)' type_id=140268
[140272] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=140269
	'(anon)' type_id=140270
	'(anon)' type_id=139858
	'(anon)' type_id=140259
[140273] PTR '(anon)' type_id=140272
[140274] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=140269
	'(anon)' type_id=139858
	'(anon)' type_id=140259
[140275] PTR '(anon)' type_id=140274
[140276] FUNC_PROTO '(anon)' ret_type_id=42 vlen=3
	'(anon)' type_id=139858
	'(anon)' type_id=140270
	'(anon)' type_id=140259
[140277] PTR '(anon)' type_id=140276
[140278] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'(anon)' type_id=140270
[140279] PTR '(anon)' type_id=140278
[140280] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=139858
	'(anon)' type_id=63045
	'(anon)' type_id=23728
[140281] PTR '(anon)' type_id=140280
[140282] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'(anon)' type_id=139858
	'(anon)' type_id=63045
[140283] PTR '(anon)' type_id=140282
[140284] FUNC_PROTO '(anon)' ret_type_id=42 vlen=3
	'(anon)' type_id=140270
	'(anon)' type_id=140285
	'(anon)' type_id=140285
[140285] PTR '(anon)' type_id=140266
[140286] PTR '(anon)' type_id=140284
[140287] ARRAY '(anon)' type_id=62968 index_type_id=13 nr_elems=32
[140288] ARRAY '(anon)' type_id=140188 index_type_id=13 nr_elems=32
[140289] ARRAY '(anon)' type_id=140262 index_type_id=13 nr_elems=2
[140290] STRUCT 'encap_flow_item' size=32 vlen=3
	'e' type_id=140199 bits_offset=0
	'list' type_id=54 bits_offset=64
	'index' type_id=13 bits_offset=192
[140291] STRUCT 'encap_route_flow_item' size=16 vlen=2
	'r' type_id=140292 bits_offset=0
	'index' type_id=13 bits_offset=64
[140292] PTR '(anon)' type_id=141972
[140293] ARRAY '(anon)' type_id=139707 index_type_id=13 nr_elems=2
[140294] PTR '(anon)' type_id=140240
[140295] ARRAY '(anon)' type_id=140291 index_type_id=13 nr_elems=32
[140296] ARRAY '(anon)' type_id=140290 index_type_id=13 nr_elems=32
[140297] PTR '(anon)' type_id=144209
[140298] PTR '(anon)' type_id=140232
[140299] PTR '(anon)' type_id=140262
[140300] ENUM 'mlx5_flow_table_miss_action' encoding=UNSIGNED size=4 vlen=3
	'MLX5_FLOW_TABLE_MISS_ACTION_DEF' val=0
	'MLX5_FLOW_TABLE_MISS_ACTION_FWD' val=1
	'MLX5_FLOW_TABLE_MISS_ACTION_SWITCH_DOMAIN' val=2
[140301] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_FLOW_CONTEXT_FLOW_SOURCE_ANY_VPORT' val=0
	'MLX5_FLOW_CONTEXT_FLOW_SOURCE_UPLINK' val=1
	'MLX5_FLOW_CONTEXT_FLOW_SOURCE_LOCAL_VPORT' val=2
[140302] STRUCT 'mlx5_flow_table' size=400 vlen=15
	'node' type_id=140336 bits_offset=0
	'fs_dr_table' type_id=140323 bits_offset=1024
	'id' type_id=21 bits_offset=1152
	'vport' type_id=20 bits_offset=1184
	'max_fte' type_id=6 bits_offset=1216
	'level' type_id=6 bits_offset=1248
	'type' type_id=140328 bits_offset=1280
	'op_mod' type_id=140329 bits_offset=1312
	'autogroup' type_id=140343 bits_offset=1344
	'lock' type_id=155 bits_offset=1536
	'fwd_rules' type_id=54 bits_offset=1792
	'flags' type_id=21 bits_offset=1920
	'fgs_hash' type_id=27454 bits_offset=1984
	'def_miss_action' type_id=140300 bits_offset=3072
	'ns' type_id=140083 bits_offset=3136
[140303] STRUCT 'mlx5_flow_group' size=776 vlen=9
	'node' type_id=140336 bits_offset=0
	'fs_dr_matcher' type_id=140321 bits_offset=1024
	'mask' type_id=140345 bits_offset=1088
	'start_index' type_id=21 bits_offset=4704
	'max_ftes' type_id=21 bits_offset=4736
	'fte_allocator' type_id=15008 bits_offset=4800
	'id' type_id=21 bits_offset=4928
	'ftes_hash' type_id=1883 bits_offset=4992
	'hash' type_id=878 bits_offset=6080
[140304] STRUCT 'mlx5_flow_handle' size=8 vlen=2
	'num_rules' type_id=13 bits_offset=0
	'rule' type_id=140341 bits_offset=64
[140305] STRUCT 'mlx5_flow_steering' size=128 vlen=17
	'dev' type_id=139673 bits_offset=0
	'mode' type_id=140330 bits_offset=64
	'fgs_cache' type_id=970 bits_offset=128
	'ftes_cache' type_id=970 bits_offset=192
	'root_ns' type_id=140333 bits_offset=256
	'fdb_root_ns' type_id=140333 bits_offset=320
	'fdb_sub_ns' type_id=140334 bits_offset=384
	'esw_egress_root_ns' type_id=140335 bits_offset=448
	'esw_ingress_root_ns' type_id=140335 bits_offset=512
	'sniffer_tx_root_ns' type_id=140333 bits_offset=576
	'sniffer_rx_root_ns' type_id=140333 bits_offset=640
	'rdma_rx_root_ns' type_id=140333 bits_offset=704
	'rdma_tx_root_ns' type_id=140333 bits_offset=768
	'egress_root_ns' type_id=140333 bits_offset=832
	'port_sel_root_ns' type_id=140333 bits_offset=896
	'esw_egress_acl_vports' type_id=13 bits_offset=960
	'esw_ingress_acl_vports' type_id=13 bits_offset=992
[140306] CONST '(anon)' type_id=140142
[140307] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=6
	'MLX5_FLOW_TABLE_TUNNEL_EN_REFORMAT' val=1
	'MLX5_FLOW_TABLE_TUNNEL_EN_DECAP' val=2
	'MLX5_FLOW_TABLE_TERMINATION' val=4
	'MLX5_FLOW_TABLE_UNMANAGED' val=8
	'MLX5_FLOW_TABLE_OTHER_VPORT' val=16
	'MLX5_FLOW_TABLE_UPLINK_VPORT' val=32
[140308] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=9
	'FDB_BYPASS_PATH' val=0
	'FDB_CRYPTO_INGRESS' val=1
	'FDB_TC_OFFLOAD' val=2
	'FDB_FT_OFFLOAD' val=3
	'FDB_TC_MISS' val=4
	'FDB_BR_OFFLOAD' val=5
	'FDB_SLOW_PATH' val=6
	'FDB_CRYPTO_EGRESS' val=7
	'FDB_PER_VPORT' val=8
[140309] STRUCT 'mlx5_pkt_reformat' size=24 vlen=4
	'ns_type' type_id=140222 bits_offset=0
	'reformat_type' type_id=13 bits_offset=32
	'owner' type_id=140325 bits_offset=64
	'(anon)' type_id=140326 bits_offset=128
[140310] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'FLOW_ACT_NO_APPEND' val=1
	'FLOW_ACT_IGNORE_FLOW_LEVEL' val=2
[140311] STRUCT 'mlx5_modify_hdr' size=16 vlen=3
	'ns_type' type_id=140222 bits_offset=0
	'owner' type_id=140325 bits_offset=32
	'(anon)' type_id=140326 bits_offset=64
[140312] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=4
	'MLX5_VPORT_PF' val=0
	'MLX5_VPORT_FIRST_VF' val=1
	'MLX5_VPORT_ECPF' val=65534
	'MLX5_VPORT_UPLINK' val=65535
[140313] STRUCT 'mlx5_flow_namespace' size=136 vlen=2
	'node' type_id=140336 bits_offset=0
	'def_miss_action' type_id=140300 bits_offset=1024
[140314] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_ESW_DEST_ENCAP' val=1
	'MLX5_ESW_DEST_ENCAP_VALID' val=2
	'MLX5_ESW_DEST_CHAIN_WITH_SRC_PORT_CHANGE' val=4
[140315] STRUCT 'mlx5_termtbl_handle' size=160 vlen=6
	'termtbl_hlist' type_id=57 bits_offset=0
	'termtbl' type_id=139705 bits_offset=128
	'flow_act' type_id=140079 bits_offset=192
	'dest' type_id=140071 bits_offset=832
	'rule' type_id=139707 bits_offset=1152
	'ref_count' type_id=13 bits_offset=1216
[140316] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=9
	'MLX5_ATTR_FLAG_VLAN_HANDLED' val=1
	'MLX5_ATTR_FLAG_SLOW_PATH' val=2
	'MLX5_ATTR_FLAG_NO_IN_PORT' val=4
	'MLX5_ATTR_FLAG_SRC_REWRITE' val=8
	'MLX5_ATTR_FLAG_SAMPLE' val=16
	'MLX5_ATTR_FLAG_ACCEPT' val=32
	'MLX5_ATTR_FLAG_CT' val=64
	'MLX5_ATTR_FLAG_TERMINATING' val=128
	'MLX5_ATTR_FLAG_MTU' val=256
[140317] PTR '(anon)' type_id=140376
[140318] STRUCT 'mlx5_fs_dr_action' size=8 vlen=1
	'dr_action' type_id=140317 bits_offset=0
[140319] STRUCT 'mlx5_fs_dr_domain' size=8 vlen=1
	'dr_domain' type_id=140320 bits_offset=0
[140320] PTR '(anon)' type_id=140383
[140321] STRUCT 'mlx5_fs_dr_matcher' size=8 vlen=1
	'dr_matcher' type_id=140322 bits_offset=0
[140322] PTR '(anon)' type_id=140384
[140323] STRUCT 'mlx5_fs_dr_table' size=16 vlen=2
	'dr_table' type_id=140324 bits_offset=0
	'miss_action' type_id=140317 bits_offset=64
[140324] PTR '(anon)' type_id=140385
[140325] ENUM 'mlx5_flow_resource_owner' encoding=UNSIGNED size=4 vlen=2
	'MLX5_FLOW_RESOURCE_OWNER_FW' val=0
	'MLX5_FLOW_RESOURCE_OWNER_SW' val=1
[140326] UNION '(anon)' size=8 vlen=2
	'action' type_id=140318 bits_offset=0
	'id' type_id=21 bits_offset=0
[140327] ENUM 'fs_node_type' encoding=UNSIGNED size=4 vlen=7
	'FS_TYPE_NAMESPACE' val=0
	'FS_TYPE_PRIO' val=1
	'FS_TYPE_PRIO_CHAINS' val=2
	'FS_TYPE_FLOW_TABLE' val=3
	'FS_TYPE_FLOW_GROUP' val=4
	'FS_TYPE_FLOW_ENTRY' val=5
	'FS_TYPE_FLOW_DEST' val=6
[140328] ENUM 'fs_flow_table_type' encoding=UNSIGNED size=4 vlen=11
	'FS_FT_NIC_RX' val=0
	'FS_FT_NIC_TX' val=1
	'FS_FT_ESW_EGRESS_ACL' val=2
	'FS_FT_ESW_INGRESS_ACL' val=3
	'FS_FT_FDB' val=4
	'FS_FT_SNIFFER_RX' val=5
	'FS_FT_SNIFFER_TX' val=6
	'FS_FT_RDMA_RX' val=7
	'FS_FT_RDMA_TX' val=8
	'FS_FT_PORT_SEL' val=9
	'FS_FT_MAX_TYPE' val=9
[140329] ENUM 'fs_flow_table_op_mod' encoding=UNSIGNED size=4 vlen=2
	'FS_FT_OP_MOD_NORMAL' val=0
	'FS_FT_OP_MOD_LAG_DEMUX' val=1
[140330] ENUM 'mlx5_flow_steering_mode' encoding=UNSIGNED size=4 vlen=2
	'MLX5_FLOW_STEERING_MODE_DMFS' val=0
	'MLX5_FLOW_STEERING_MODE_SMFS' val=1
[140331] ENUM 'mlx5_flow_steering_capabilty' encoding=UNSIGNED size=4 vlen=3
	'MLX5_FLOW_STEERING_CAP_VLAN_PUSH_ON_RX' val=1
	'MLX5_FLOW_STEERING_CAP_VLAN_POP_ON_TX' val=2
	'MLX5_FLOW_STEERING_CAP_MATCH_RANGES' val=4
[140332] STRUCT 'mlx5_flow_root_namespace' size=232 vlen=9
	'ns' type_id=140313 bits_offset=0
	'mode' type_id=140330 bits_offset=1088
	'fs_dr_domain' type_id=140319 bits_offset=1152
	'table_type' type_id=140328 bits_offset=1216
	'dev' type_id=139673 bits_offset=1280
	'root_ft' type_id=139705 bits_offset=1344
	'chain_lock' type_id=155 bits_offset=1408
	'underlay_qpns' type_id=54 bits_offset=1664
	'cmds' type_id=140347 bits_offset=1792
[140333] PTR '(anon)' type_id=140332
[140334] PTR '(anon)' type_id=140083
[140335] PTR '(anon)' type_id=140333
[140336] STRUCT 'fs_node' size=128 vlen=11
	'list' type_id=54 bits_offset=0
	'children' type_id=54 bits_offset=128
	'type' type_id=140327 bits_offset=256
	'parent' type_id=140337 bits_offset=320
	'root' type_id=140337 bits_offset=384
	'lock' type_id=531 bits_offset=448
	'refcount' type_id=178 bits_offset=768
	'active' type_id=42 bits_offset=800
	'del_hw_func' type_id=140339 bits_offset=832
	'del_sw_func' type_id=140339 bits_offset=896
	'version' type_id=51 bits_offset=960
[140337] PTR '(anon)' type_id=140336
[140338] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=140337
[140339] PTR '(anon)' type_id=140338
[140340] STRUCT 'mlx5_flow_rule' size=200 vlen=5
	'node' type_id=140336 bits_offset=0
	'ft' type_id=139705 bits_offset=1024
	'dest_attr' type_id=140071 bits_offset=1088
	'next_ft' type_id=54 bits_offset=1408
	'sw_action' type_id=21 bits_offset=1536
[140341] ARRAY '(anon)' type_id=140342 index_type_id=13 nr_elems=0
[140342] PTR '(anon)' type_id=140340
[140343] STRUCT '(anon)' size=20 vlen=5
	'active' type_id=42 bits_offset=0
	'required_groups' type_id=6 bits_offset=32
	'group_size' type_id=6 bits_offset=64
	'num_groups' type_id=6 bits_offset=96
	'max_fte' type_id=6 bits_offset=128
[140344] ARRAY '(anon)' type_id=21 index_type_id=13 nr_elems=112
[140345] STRUCT 'mlx5_flow_group_mask' size=452 vlen=2
	'match_criteria_enable' type_id=19 bits_offset=0
	'match_criteria' type_id=140344 bits_offset=32
[140346] CONST '(anon)' type_id=142732
[140347] PTR '(anon)' type_id=140346
[140348] PTR '(anon)' type_id=140306
[140349] STRUCT 'mlx5_ifc_cmd_hca_cap_bits' size=2048 vlen=421
	'reserved_at_0' type_id=474 bits_offset=0
	'shared_object_to_user_object_allowed' type_id=16161 bits_offset=128
	'reserved_at_13' type_id=61845 bits_offset=136
	'vhca_resource_manager' type_id=16161 bits_offset=248
	'hca_cap_2' type_id=16161 bits_offset=256
	'create_lag_when_not_master_up' type_id=16161 bits_offset=264
	'dtor' type_id=16161 bits_offset=272
	'event_on_vhca_state_teardown_request' type_id=16161 bits_offset=280
	'event_on_vhca_state_in_use' type_id=16161 bits_offset=288
	'event_on_vhca_state_active' type_id=16161 bits_offset=296
	'event_on_vhca_state_allocated' type_id=16161 bits_offset=304
	'event_on_vhca_state_invalid' type_id=16161 bits_offset=312
	'reserved_at_28' type_id=7469 bits_offset=320
	'vhca_id' type_id=474 bits_offset=384
	'reserved_at_40' type_id=1843 bits_offset=512
	'log_max_srq_sz' type_id=7469 bits_offset=1024
	'log_max_qp_sz' type_id=7469 bits_offset=1088
	'event_cap' type_id=16161 bits_offset=1152
	'reserved_at_91' type_id=2689 bits_offset=1160
	'isolate_vl_tc_new' type_id=16161 bits_offset=1176
	'reserved_at_94' type_id=2120 bits_offset=1184
	'prio_tag_required' type_id=16161 bits_offset=1216
	'reserved_at_99' type_id=2689 bits_offset=1224
	'log_max_qp' type_id=4325 bits_offset=1240
	'reserved_at_a0' type_id=401 bits_offset=1280
	'ece_support' type_id=16161 bits_offset=1304
	'reserved_at_a4' type_id=4325 bits_offset=1312
	'reg_c_preserve' type_id=16161 bits_offset=1352
	'reserved_at_aa' type_id=16161 bits_offset=1360
	'log_max_srq' type_id=4325 bits_offset=1368
	'reserved_at_b0' type_id=16161 bits_offset=1408
	'uplink_follow' type_id=16161 bits_offset=1416
	'ts_cqe_to_dest_cqn' type_id=16161 bits_offset=1424
	'reserved_at_b3' type_id=4362 bits_offset=1432
	'go_back_n' type_id=16161 bits_offset=1480
	'shampo' type_id=16161 bits_offset=1488
	'reserved_at_bb' type_id=4325 bits_offset=1496
	'max_sgl_for_optimized_performance' type_id=7469 bits_offset=1536
	'log_max_cq_sz' type_id=7469 bits_offset=1600
	'relaxed_ordering_write_umr' type_id=16161 bits_offset=1664
	'relaxed_ordering_read_umr' type_id=16161 bits_offset=1672
	'reserved_at_d2' type_id=3023 bits_offset=1680
	'virtio_net_device_emualtion_manager' type_id=16161 bits_offset=1736
	'virtio_blk_device_emualtion_manager' type_id=16161 bits_offset=1744
	'log_max_cq' type_id=4325 bits_offset=1752
	'log_max_eq_sz' type_id=7469 bits_offset=1792
	'relaxed_ordering_write' type_id=16161 bits_offset=1856
	'relaxed_ordering_read_pci_enabled' type_id=16161 bits_offset=1864
	'log_max_mkey' type_id=4362 bits_offset=1872
	'reserved_at_f0' type_id=4362 bits_offset=1920
	'terminate_scatter_list_mkey' type_id=16161 bits_offset=1968
	'repeated_mkey' type_id=16161 bits_offset=1976
	'dump_fill_mkey' type_id=16161 bits_offset=1984
	'reserved_at_f9' type_id=2689 bits_offset=1992
	'fast_teardown' type_id=16161 bits_offset=2008
	'log_max_eq' type_id=2120 bits_offset=2016
	'max_indirection' type_id=7469 bits_offset=2048
	'fixed_buffer_size' type_id=16161 bits_offset=2112
	'log_max_mrw_sz' type_id=3023 bits_offset=2120
	'force_teardown' type_id=16161 bits_offset=2176
	'reserved_at_111' type_id=16161 bits_offset=2184
	'log_max_bsf_list_size' type_id=4362 bits_offset=2192
	'umr_extended_translation_offset' type_id=16161 bits_offset=2240
	'null_mkey' type_id=16161 bits_offset=2248
	'log_max_klm_list_size' type_id=4362 bits_offset=2256
	'reserved_at_120' type_id=2689 bits_offset=2304
	'qpc_extension' type_id=16161 bits_offset=2320
	'reserved_at_123' type_id=3023 bits_offset=2328
	'log_max_ra_req_dc' type_id=4362 bits_offset=2384
	'reserved_at_130' type_id=2689 bits_offset=2432
	'eth_wqe_too_small' type_id=16161 bits_offset=2448
	'reserved_at_133' type_id=4362 bits_offset=2456
	'vnic_env_cq_overrun' type_id=16161 bits_offset=2504
	'log_max_ra_res_dc' type_id=4362 bits_offset=2512
	'reserved_at_140' type_id=4325 bits_offset=2560
	'release_all_pages' type_id=16161 bits_offset=2600
	'must_not_use' type_id=16161 bits_offset=2608
	'reserved_at_147' type_id=2689 bits_offset=2616
	'roce_accl' type_id=16161 bits_offset=2632
	'log_max_ra_req_qp' type_id=4362 bits_offset=2640
	'reserved_at_150' type_id=19155 bits_offset=2688
	'log_max_ra_res_qp' type_id=4362 bits_offset=2768
	'end_pad' type_id=16161 bits_offset=2816
	'cc_query_allowed' type_id=16161 bits_offset=2824
	'cc_modify_allowed' type_id=16161 bits_offset=2832
	'start_pad' type_id=16161 bits_offset=2840
	'cache_line_128byte' type_id=16161 bits_offset=2848
	'reserved_at_165' type_id=2120 bits_offset=2856
	'rts2rts_qp_counters_set_id' type_id=16161 bits_offset=2888
	'reserved_at_16a' type_id=2689 bits_offset=2896
	'vnic_env_int_rq_oob' type_id=16161 bits_offset=2912
	'sbcam_reg' type_id=16161 bits_offset=2920
	'reserved_at_16e' type_id=16161 bits_offset=2928
	'qcam_reg' type_id=16161 bits_offset=2936
	'gid_table_size' type_id=474 bits_offset=2944
	'out_of_seq_cnt' type_id=16161 bits_offset=3072
	'vport_counters' type_id=16161 bits_offset=3080
	'retransmission_q_counters' type_id=16161 bits_offset=3088
	'debug' type_id=16161 bits_offset=3096
	'modify_rq_counter_set_id' type_id=16161 bits_offset=3104
	'rq_delay_drop' type_id=16161 bits_offset=3112
	'max_qp_cnt' type_id=19155 bits_offset=3120
	'pkey_table_size' type_id=474 bits_offset=3200
	'vport_group_manager' type_id=16161 bits_offset=3328
	'vhca_group_manager' type_id=16161 bits_offset=3336
	'ib_virt' type_id=16161 bits_offset=3344
	'eth_virt' type_id=16161 bits_offset=3352
	'vnic_env_queue_counters' type_id=16161 bits_offset=3360
	'ets' type_id=16161 bits_offset=3368
	'nic_flow_table' type_id=16161 bits_offset=3376
	'eswitch_manager' type_id=16161 bits_offset=3384
	'device_memory' type_id=16161 bits_offset=3392
	'mcam_reg' type_id=16161 bits_offset=3400
	'pcam_reg' type_id=16161 bits_offset=3408
	'local_ca_ack_delay' type_id=4325 bits_offset=3416
	'port_module_event' type_id=16161 bits_offset=3456
	'enhanced_error_q_counters' type_id=16161 bits_offset=3464
	'ports_check' type_id=16161 bits_offset=3472
	'reserved_at_1b3' type_id=16161 bits_offset=3480
	'disable_link_up' type_id=16161 bits_offset=3488
	'beacon_led' type_id=16161 bits_offset=3496
	'port_type' type_id=2689 bits_offset=3504
	'num_ports' type_id=7469 bits_offset=3520
	'reserved_at_1c0' type_id=16161 bits_offset=3584
	'pps' type_id=16161 bits_offset=3592
	'pps_modify' type_id=16161 bits_offset=3600
	'log_max_msg' type_id=4325 bits_offset=3608
	'reserved_at_1c8' type_id=2120 bits_offset=3648
	'max_tc' type_id=2120 bits_offset=3680
	'temp_warn_event' type_id=16161 bits_offset=3712
	'dcbx' type_id=16161 bits_offset=3720
	'general_notification_event' type_id=16161 bits_offset=3728
	'reserved_at_1d3' type_id=2689 bits_offset=3736
	'fpga' type_id=16161 bits_offset=3752
	'rol_s' type_id=16161 bits_offset=3760
	'rol_g' type_id=16161 bits_offset=3768
	'reserved_at_1d8' type_id=16161 bits_offset=3776
	'wol_s' type_id=16161 bits_offset=3784
	'wol_g' type_id=16161 bits_offset=3792
	'wol_a' type_id=16161 bits_offset=3800
	'wol_b' type_id=16161 bits_offset=3808
	'wol_m' type_id=16161 bits_offset=3816
	'wol_u' type_id=16161 bits_offset=3824
	'wol_p' type_id=16161 bits_offset=3832
	'stat_rate_support' type_id=474 bits_offset=3840
	'reserved_at_1f0' type_id=16161 bits_offset=3968
	'pci_sync_for_fw_update_event' type_id=16161 bits_offset=3976
	'reserved_at_1f2' type_id=4362 bits_offset=3984
	'init2_lag_tx_port_affinity' type_id=16161 bits_offset=4032
	'reserved_at_1fa' type_id=401 bits_offset=4040
	'cqe_version' type_id=2120 bits_offset=4064
	'compact_address_vector' type_id=16161 bits_offset=4096
	'striding_rq' type_id=16161 bits_offset=4104
	'reserved_at_202' type_id=16161 bits_offset=4112
	'ipoib_enhanced_offloads' type_id=16161 bits_offset=4120
	'ipoib_basic_offloads' type_id=16161 bits_offset=4128
	'reserved_at_205' type_id=16161 bits_offset=4136
	'repeated_block_disabled' type_id=16161 bits_offset=4144
	'umr_modify_entity_size_disabled' type_id=16161 bits_offset=4152
	'umr_modify_atomic_disabled' type_id=16161 bits_offset=4160
	'umr_indirect_mkey_disabled' type_id=16161 bits_offset=4168
	'umr_fence' type_id=2689 bits_offset=4176
	'dc_req_scat_data_cqe' type_id=16161 bits_offset=4192
	'reserved_at_20d' type_id=2689 bits_offset=4200
	'drain_sigerr' type_id=16161 bits_offset=4216
	'cmdif_checksum' type_id=2689 bits_offset=4224
	'sigerr_cqe' type_id=16161 bits_offset=4240
	'reserved_at_213' type_id=16161 bits_offset=4248
	'wq_signature' type_id=16161 bits_offset=4256
	'sctr_data_cqe' type_id=16161 bits_offset=4264
	'reserved_at_216' type_id=16161 bits_offset=4272
	'sho' type_id=16161 bits_offset=4280
	'tph' type_id=16161 bits_offset=4288
	'rf' type_id=16161 bits_offset=4296
	'dct' type_id=16161 bits_offset=4304
	'qos' type_id=16161 bits_offset=4312
	'eth_net_offloads' type_id=16161 bits_offset=4320
	'roce' type_id=16161 bits_offset=4328
	'atomic' type_id=16161 bits_offset=4336
	'reserved_at_21f' type_id=16161 bits_offset=4344
	'cq_oi' type_id=16161 bits_offset=4352
	'cq_resize' type_id=16161 bits_offset=4360
	'cq_moderation' type_id=16161 bits_offset=4368
	'reserved_at_223' type_id=401 bits_offset=4376
	'cq_eq_remap' type_id=16161 bits_offset=4400
	'pg' type_id=16161 bits_offset=4408
	'block_lb_mc' type_id=16161 bits_offset=4416
	'reserved_at_229' type_id=16161 bits_offset=4424
	'scqe_break_moderation' type_id=16161 bits_offset=4432
	'cq_period_start_from_cqe' type_id=16161 bits_offset=4440
	'cd' type_id=16161 bits_offset=4448
	'reserved_at_22d' type_id=16161 bits_offset=4456
	'apm' type_id=16161 bits_offset=4464
	'vector_calc' type_id=16161 bits_offset=4472
	'umr_ptr_rlky' type_id=16161 bits_offset=4480
	'imaicl' type_id=16161 bits_offset=4488
	'qp_packet_based' type_id=16161 bits_offset=4496
	'reserved_at_233' type_id=401 bits_offset=4504
	'qkv' type_id=16161 bits_offset=4528
	'pkv' type_id=16161 bits_offset=4536
	'set_deth_sqpn' type_id=16161 bits_offset=4544
	'reserved_at_239' type_id=401 bits_offset=4552
	'xrc' type_id=16161 bits_offset=4576
	'ud' type_id=16161 bits_offset=4584
	'uc' type_id=16161 bits_offset=4592
	'rc' type_id=16161 bits_offset=4600
	'uar_4k' type_id=16161 bits_offset=4608
	'reserved_at_241' type_id=3023 bits_offset=4616
	'fl_rc_qp_when_roce_disabled' type_id=16161 bits_offset=4672
	'regexp_params' type_id=16161 bits_offset=4680
	'uar_sz' type_id=4362 bits_offset=4688
	'port_selection_cap' type_id=16161 bits_offset=4736
	'reserved_at_251' type_id=16161 bits_offset=4744
	'umem_uid_0' type_id=16161 bits_offset=4752
	'reserved_at_253' type_id=4325 bits_offset=4760
	'log_pg_sz' type_id=7469 bits_offset=4800
	'bf' type_id=16161 bits_offset=4864
	'driver_version' type_id=16161 bits_offset=4872
	'pad_tx_eth_packet' type_id=16161 bits_offset=4880
	'reserved_at_263' type_id=401 bits_offset=4888
	'mkey_by_name' type_id=16161 bits_offset=4912
	'reserved_at_267' type_id=2120 bits_offset=4920
	'log_bf_reg_size' type_id=4325 bits_offset=4952
	'reserved_at_270' type_id=401 bits_offset=4992
	'qp_error_syndrome' type_id=16161 bits_offset=5016
	'reserved_at_274' type_id=2689 bits_offset=5024
	'lag_dct' type_id=2689 bits_offset=5040
	'lag_tx_port_affinity' type_id=16161 bits_offset=5056
	'lag_native_fdb_selection' type_id=16161 bits_offset=5064
	'reserved_at_27a' type_id=16161 bits_offset=5072
	'lag_master' type_id=16161 bits_offset=5080
	'num_lag_ports' type_id=2120 bits_offset=5088
	'reserved_at_280' type_id=474 bits_offset=5120
	'max_wqe_sz_sq' type_id=474 bits_offset=5248
	'reserved_at_2a0' type_id=474 bits_offset=5376
	'max_wqe_sz_rq' type_id=474 bits_offset=5504
	'max_flow_counter_31_16' type_id=474 bits_offset=5632
	'max_wqe_sz_sq_dc' type_id=474 bits_offset=5760
	'reserved_at_2e0' type_id=3023 bits_offset=5888
	'max_qp_mcg' type_id=33414 bits_offset=5944
	'reserved_at_300' type_id=474 bits_offset=6144
	'flow_counter_bulk_alloc' type_id=7469 bits_offset=6272
	'log_max_mcg' type_id=7469 bits_offset=6336
	'reserved_at_320' type_id=401 bits_offset=6400
	'log_max_transport_domain' type_id=4325 bits_offset=6424
	'reserved_at_328' type_id=2689 bits_offset=6464
	'relaxed_ordering_read' type_id=16161 bits_offset=6480
	'log_max_pd' type_id=4325 bits_offset=6488
	'reserved_at_330' type_id=4362 bits_offset=6528
	'pci_sync_for_fw_update_with_driver_unload' type_id=16161 bits_offset=6576
	'vnic_env_cnt_steering_fail' type_id=16161 bits_offset=6584
	'vport_counter_local_loopback' type_id=16161 bits_offset=6592
	'q_counter_aggregation' type_id=16161 bits_offset=6600
	'q_counter_other_vport' type_id=16161 bits_offset=6608
	'log_max_xrcd' type_id=4325 bits_offset=6616
	'nic_receive_steering_discard' type_id=16161 bits_offset=6656
	'receive_discard_vport_down' type_id=16161 bits_offset=6664
	'transmit_discard_vport_down' type_id=16161 bits_offset=6672
	'eq_overrun_count' type_id=16161 bits_offset=6680
	'reserved_at_344' type_id=16161 bits_offset=6688
	'invalid_command_count' type_id=16161 bits_offset=6696
	'quota_exceeded_count' type_id=16161 bits_offset=6704
	'reserved_at_347' type_id=16161 bits_offset=6712
	'log_max_flow_counter_bulk' type_id=7469 bits_offset=6720
	'max_flow_counter_15_0' type_id=474 bits_offset=6784
	'reserved_at_360' type_id=401 bits_offset=6912
	'log_max_rq' type_id=4325 bits_offset=6936
	'reserved_at_368' type_id=401 bits_offset=6976
	'log_max_sq' type_id=4325 bits_offset=7000
	'reserved_at_370' type_id=401 bits_offset=7040
	'log_max_tir' type_id=4325 bits_offset=7064
	'reserved_at_378' type_id=401 bits_offset=7104
	'log_max_tis' type_id=4325 bits_offset=7128
	'basic_cyclic_rcv_wqe' type_id=16161 bits_offset=7168
	'reserved_at_381' type_id=2689 bits_offset=7176
	'log_max_rmp' type_id=4325 bits_offset=7192
	'reserved_at_388' type_id=401 bits_offset=7232
	'log_max_rqt' type_id=4325 bits_offset=7256
	'reserved_at_390' type_id=401 bits_offset=7296
	'log_max_rqt_size' type_id=4325 bits_offset=7320
	'reserved_at_398' type_id=401 bits_offset=7360
	'log_max_tis_per_sq' type_id=4325 bits_offset=7384
	'ext_stride_num_range' type_id=16161 bits_offset=7424
	'roce_rw_supported' type_id=16161 bits_offset=7432
	'log_max_current_uc_list_wr_supported' type_id=16161 bits_offset=7440
	'log_max_stride_sz_rq' type_id=4325 bits_offset=7448
	'reserved_at_3a8' type_id=401 bits_offset=7488
	'log_min_stride_sz_rq' type_id=4325 bits_offset=7512
	'reserved_at_3b0' type_id=401 bits_offset=7552
	'log_max_stride_sz_sq' type_id=4325 bits_offset=7576
	'reserved_at_3b8' type_id=401 bits_offset=7616
	'log_min_stride_sz_sq' type_id=4325 bits_offset=7640
	'hairpin' type_id=16161 bits_offset=7680
	'reserved_at_3c1' type_id=2689 bits_offset=7688
	'log_max_hairpin_queues' type_id=4325 bits_offset=7704
	'reserved_at_3c8' type_id=401 bits_offset=7744
	'log_max_hairpin_wq_data_sz' type_id=4325 bits_offset=7768
	'reserved_at_3d0' type_id=401 bits_offset=7808
	'log_max_hairpin_num_packets' type_id=4325 bits_offset=7832
	'reserved_at_3d8' type_id=401 bits_offset=7872
	'log_max_wq_sz' type_id=4325 bits_offset=7896
	'nic_vport_change_event' type_id=16161 bits_offset=7936
	'disable_local_lb_uc' type_id=16161 bits_offset=7944
	'disable_local_lb_mc' type_id=16161 bits_offset=7952
	'log_min_hairpin_wq_data_sz' type_id=4325 bits_offset=7960
	'reserved_at_3e8' type_id=16161 bits_offset=8000
	'silent_mode' type_id=16161 bits_offset=8008
	'vhca_state' type_id=16161 bits_offset=8016
	'log_max_vlan_list' type_id=4325 bits_offset=8024
	'reserved_at_3f0' type_id=401 bits_offset=8064
	'log_max_current_mc_list' type_id=4325 bits_offset=8088
	'reserved_at_3f8' type_id=401 bits_offset=8128
	'log_max_current_uc_list' type_id=4325 bits_offset=8152
	'general_obj_types' type_id=1843 bits_offset=8192
	'sq_ts_format' type_id=2689 bits_offset=8704
	'rq_ts_format' type_id=2689 bits_offset=8720
	'steering_format_version' type_id=2120 bits_offset=8736
	'create_qp_start_hint' type_id=9799 bits_offset=8768
	'reserved_at_460' type_id=16161 bits_offset=8960
	'ats' type_id=16161 bits_offset=8968
	'cross_vhca_rqt' type_id=16161 bits_offset=8976
	'log_max_uctx' type_id=4325 bits_offset=8984
	'reserved_at_468' type_id=16161 bits_offset=9024
	'crypto' type_id=16161 bits_offset=9032
	'ipsec_offload' type_id=16161 bits_offset=9040
	'log_max_umem' type_id=4325 bits_offset=9048
	'max_num_eqs' type_id=474 bits_offset=9088
	'reserved_at_480' type_id=16161 bits_offset=9216
	'tls_tx' type_id=16161 bits_offset=9224
	'tls_rx' type_id=16161 bits_offset=9232
	'log_max_l2_table' type_id=4325 bits_offset=9240
	'reserved_at_488' type_id=7469 bits_offset=9280
	'log_uar_page_sz' type_id=474 bits_offset=9344
	'reserved_at_4a0' type_id=3834 bits_offset=9472
	'device_frequency_mhz' type_id=3834 bits_offset=9728
	'device_frequency_khz' type_id=3834 bits_offset=9984
	'reserved_at_500' type_id=3834 bits_offset=10240
	'num_of_uars_per_page' type_id=3834 bits_offset=10496
	'flex_parser_protocols' type_id=3834 bits_offset=10752
	'max_geneve_tlv_options' type_id=7469 bits_offset=11008
	'reserved_at_568' type_id=401 bits_offset=11072
	'max_geneve_tlv_option_data_len' type_id=4325 bits_offset=11096
	'reserved_at_570' type_id=26266 bits_offset=11136
	'adv_virtualization' type_id=16161 bits_offset=11208
	'reserved_at_57a' type_id=4362 bits_offset=11216
	'reserved_at_580' type_id=33386 bits_offset=11264
	'log_max_dci_stream_channels' type_id=4325 bits_offset=11352
	'reserved_at_590' type_id=401 bits_offset=11392
	'log_max_dci_errored_streams' type_id=4325 bits_offset=11416
	'reserved_at_598' type_id=7469 bits_offset=11456
	'reserved_at_5a0' type_id=474 bits_offset=11520
	'enhanced_cqe_compression' type_id=16161 bits_offset=11648
	'reserved_at_5b1' type_id=2689 bits_offset=11656
	'log_max_dek' type_id=4325 bits_offset=11672
	'reserved_at_5b8' type_id=2120 bits_offset=11712
	'mini_cqe_resp_stride_index' type_id=16161 bits_offset=11744
	'cqe_128_always' type_id=16161 bits_offset=11752
	'cqe_compression_128' type_id=16161 bits_offset=11760
	'cqe_compression' type_id=16161 bits_offset=11768
	'cqe_compression_timeout' type_id=474 bits_offset=11776
	'cqe_compression_max_num' type_id=474 bits_offset=11904
	'reserved_at_5e0' type_id=7469 bits_offset=12032
	'flex_parser_id_gtpu_dw_0' type_id=2120 bits_offset=12096
	'reserved_at_5ec' type_id=2120 bits_offset=12128
	'tag_matching' type_id=16161 bits_offset=12160
	'rndv_offload_rc' type_id=16161 bits_offset=12168
	'rndv_offload_dc' type_id=16161 bits_offset=12176
	'log_tag_matching_list_sz' type_id=4325 bits_offset=12184
	'reserved_at_5f8' type_id=401 bits_offset=12224
	'log_max_xrq' type_id=4325 bits_offset=12248
	'affiliate_nic_vport_criteria' type_id=7469 bits_offset=12288
	'native_port_num' type_id=7469 bits_offset=12352
	'num_vhca_ports' type_id=7469 bits_offset=12416
	'flex_parser_id_gtpu_teid' type_id=2120 bits_offset=12480
	'reserved_at_61c' type_id=2689 bits_offset=12512
	'sw_owner_id' type_id=16161 bits_offset=12528
	'reserved_at_61f' type_id=16161 bits_offset=12536
	'max_num_of_monitor_counters' type_id=474 bits_offset=12544
	'num_ppcnt_monitor_counters' type_id=474 bits_offset=12672
	'max_num_sf' type_id=474 bits_offset=12800
	'num_q_monitor_counters' type_id=474 bits_offset=12928
	'reserved_at_660' type_id=3834 bits_offset=13056
	'sf' type_id=16161 bits_offset=13312
	'sf_set_partition' type_id=16161 bits_offset=13320
	'reserved_at_682' type_id=16161 bits_offset=13328
	'log_max_sf' type_id=4325 bits_offset=13336
	'apu' type_id=16161 bits_offset=13376
	'reserved_at_689' type_id=2120 bits_offset=13384
	'migration' type_id=16161 bits_offset=13416
	'reserved_at_68e' type_id=2689 bits_offset=13424
	'log_min_sf_size' type_id=7469 bits_offset=13440
	'max_num_sf_partitions' type_id=7469 bits_offset=13504
	'uctx_cap' type_id=3834 bits_offset=13568
	'reserved_at_6c0' type_id=2120 bits_offset=13824
	'flex_parser_id_geneve_tlv_option_0' type_id=2120 bits_offset=13856
	'flex_parser_id_icmp_dw1' type_id=2120 bits_offset=13888
	'flex_parser_id_icmp_dw0' type_id=2120 bits_offset=13920
	'flex_parser_id_icmpv6_dw1' type_id=2120 bits_offset=13952
	'flex_parser_id_icmpv6_dw0' type_id=2120 bits_offset=13984
	'flex_parser_id_outer_first_mpls_over_gre' type_id=2120 bits_offset=14016
	'flex_parser_id_outer_first_mpls_over_udp_label' type_id=2120 bits_offset=14048
	'max_num_match_definer' type_id=474 bits_offset=14080
	'sf_base_id' type_id=474 bits_offset=14208
	'flex_parser_id_gtpu_dw_2' type_id=2120 bits_offset=14336
	'flex_parser_id_gtpu_first_ext_dw_0' type_id=2120 bits_offset=14368
	'num_total_dynamic_vf_msix' type_id=9799 bits_offset=14400
	'reserved_at_720' type_id=7773 bits_offset=14592
	'dynamic_msix_table_size' type_id=7436 bits_offset=14752
	'reserved_at_740' type_id=7436 bits_offset=14848
	'min_dynamic_vf_msix_table_size' type_id=2120 bits_offset=14944
	'reserved_at_750' type_id=2120 bits_offset=14976
	'max_dynamic_vf_msix_table_size' type_id=7436 bits_offset=15008
	'reserved_at_760' type_id=401 bits_offset=15104
	'log_max_num_header_modify_argument' type_id=4325 bits_offset=15128
	'reserved_at_768' type_id=2120 bits_offset=15168
	'log_header_modify_argument_granularity' type_id=2120 bits_offset=15200
	'reserved_at_770' type_id=401 bits_offset=15232
	'log_header_modify_argument_max_alloc' type_id=4325 bits_offset=15256
	'reserved_at_778' type_id=7469 bits_offset=15296
	'vhca_tunnel_commands' type_id=1843 bits_offset=15360
	'match_definer_format_supported' type_id=1843 bits_offset=15872
[140350] ENUM 'mlx5_flex_parser_protos' encoding=UNSIGNED size=4 vlen=5
	'MLX5_FLEX_PROTO_GENEVE' val=8
	'MLX5_FLEX_PROTO_CW_MPLS_GRE' val=16
	'MLX5_FLEX_PROTO_CW_MPLS_UDP' val=32
	'MLX5_FLEX_PROTO_ICMP' val=256
	'MLX5_FLEX_PROTO_ICMPV6' val=512
[140351] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'FLOW_CONTEXT_HAS_TAG' val=1
	'FLOW_CONTEXT_UPLINK_HAIRPIN_EN' val=2
[140352] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_FLOW_DEST_VPORT_VHCA_ID' val=1
	'MLX5_FLOW_DEST_VPORT_REFORMAT_ID' val=2
[140353] STRUCT 'mlx5_esw_bridge_offloads' size=320 vlen=22
	'esw' type_id=139720 bits_offset=0
	'bridges' type_id=54 bits_offset=64
	'ports' type_id=660 bits_offset=192
	'debugfs_root' type_id=912 bits_offset=320
	'netdev_nb' type_id=1865 bits_offset=384
	'nb_blk' type_id=1865 bits_offset=576
	'nb' type_id=1865 bits_offset=768
	'wq' type_id=542 bits_offset=960
	'update_work' type_id=541 bits_offset=1024
	'ingress_ft' type_id=139705 bits_offset=1728
	'ingress_igmp_fg' type_id=139706 bits_offset=1792
	'ingress_mld_fg' type_id=139706 bits_offset=1856
	'ingress_vlan_fg' type_id=139706 bits_offset=1920
	'ingress_vlan_filter_fg' type_id=139706 bits_offset=1984
	'ingress_qinq_fg' type_id=139706 bits_offset=2048
	'ingress_qinq_filter_fg' type_id=139706 bits_offset=2112
	'ingress_mac_fg' type_id=139706 bits_offset=2176
	'igmp_handle' type_id=139707 bits_offset=2240
	'mld_query_handle' type_id=139707 bits_offset=2304
	'mld_report_handle' type_id=139707 bits_offset=2368
	'mld_done_handle' type_id=139707 bits_offset=2432
	'skip_ft' type_id=139705 bits_offset=2496
[140354] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=4
	'MLX5_ESW_BRIDGE_LEVEL_INGRESS_TABLE' val=0
	'MLX5_ESW_BRIDGE_LEVEL_EGRESS_TABLE' val=1
	'MLX5_ESW_BRIDGE_LEVEL_MCAST_TABLE' val=2
	'MLX5_ESW_BRIDGE_LEVEL_SKIP_TABLE' val=3
[140355] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_ESW_BRIDGE_VLAN_FILTERING_FLAG' val=1
	'MLX5_ESW_BRIDGE_MCAST_FLAG' val=2
[140356] STRUCT 'mlx5_esw_bridge_mdb_key' size=8 vlen=2
	'addr' type_id=351 bits_offset=0
	'vid' type_id=20 bits_offset=48
[140357] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_ESW_BRIDGE_PORT_FLAG_PEER' val=1
[140358] STRUCT 'mlx5_esw_bridge_mdb_entry' size=64 vlen=6
	'key' type_id=140356 bits_offset=0
	'ht_node' type_id=876 bits_offset=64
	'list' type_id=54 bits_offset=128
	'ports' type_id=660 bits_offset=256
	'num_ports' type_id=13 bits_offset=384
	'egress_handle' type_id=139707 bits_offset=448
[140359] CONST '(anon)' type_id=140358
[140360] STRUCT 'mlx5_esw_bridge_vlan' size=56 vlen=7
	'vid' type_id=20 bits_offset=0
	'flags' type_id=20 bits_offset=16
	'fdb_list' type_id=54 bits_offset=64
	'pkt_reformat_push' type_id=140068 bits_offset=192
	'pkt_reformat_pop' type_id=140068 bits_offset=256
	'pkt_mod_hdr_push_mark' type_id=140080 bits_offset=320
	'mcast_handle' type_id=139707 bits_offset=384
[140361] STRUCT '(anon)' size=56 vlen=7
	'ft' type_id=139705 bits_offset=0
	'filter_fg' type_id=139706 bits_offset=64
	'vlan_fg' type_id=139706 bits_offset=128
	'qinq_fg' type_id=139706 bits_offset=192
	'fwd_fg' type_id=139706 bits_offset=256
	'filter_handle' type_id=139707 bits_offset=320
	'fwd_handle' type_id=139707 bits_offset=384
[140362] STRUCT 'mlx5_esw_bridge_port' size=88 vlen=6
	'vport_num' type_id=20 bits_offset=0
	'esw_owner_vhca_id' type_id=20 bits_offset=16
	'flags' type_id=20 bits_offset=32
	'bridge' type_id=140364 bits_offset=64
	'vlans' type_id=660 bits_offset=128
	'mcast' type_id=140361 bits_offset=256
[140363] STRUCT 'mlx5_esw_bridge' size=416 vlen=19
	'ifindex' type_id=13 bits_offset=0
	'refcnt' type_id=13 bits_offset=32
	'list' type_id=54 bits_offset=64
	'br_offloads' type_id=140183 bits_offset=192
	'debugfs_dir' type_id=912 bits_offset=256
	'fdb_list' type_id=54 bits_offset=320
	'fdb_ht' type_id=1883 bits_offset=448
	'mdb_list' type_id=54 bits_offset=1536
	'mdb_ht' type_id=1883 bits_offset=1664
	'egress_ft' type_id=139705 bits_offset=2752
	'egress_vlan_fg' type_id=139706 bits_offset=2816
	'egress_qinq_fg' type_id=139706 bits_offset=2880
	'egress_mac_fg' type_id=139706 bits_offset=2944
	'egress_miss_fg' type_id=139706 bits_offset=3008
	'egress_miss_pkt_reformat' type_id=140068 bits_offset=3072
	'egress_miss_handle' type_id=139707 bits_offset=3136
	'ageing_time' type_id=1 bits_offset=3200
	'flags' type_id=21 bits_offset=3264
	'vlan_proto' type_id=20 bits_offset=3296
[140364] PTR '(anon)' type_id=140363
[140365] PTR '(anon)' type_id=139723
[140366] PTR '(anon)' type_id=140359
[140367] PTR '(anon)' type_id=140362
[140368] PTR '(anon)' type_id=140360
[140369] PTR '(anon)' type_id=140358
[140370] ENUM 'accel_fs_tcp_type' encoding=UNSIGNED size=4 vlen=3
	'ACCEL_FS_IPV4_TCP' val=0
	'ACCEL_FS_IPV6_TCP' val=1
	'ACCEL_FS_TCP_NUM_TYPES' val=2
[140371] STRUCT 'mlx5e_accel_fs_tcp' size=64 vlen=2
	'tables' type_id=140372 bits_offset=0
	'default_rules' type_id=140293 bits_offset=384
[140372] ARRAY '(anon)' type_id=140085 index_type_id=13 nr_elems=2
[140373] PTR '(anon)' type_id=140371
[140374] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=39
	'MLX5_ACTION_IN_FIELD_OUT_SMAC_47_16' val=1
	'MLX5_ACTION_IN_FIELD_OUT_SMAC_15_0' val=2
	'MLX5_ACTION_IN_FIELD_OUT_ETHERTYPE' val=3
	'MLX5_ACTION_IN_FIELD_OUT_DMAC_47_16' val=4
	'MLX5_ACTION_IN_FIELD_OUT_DMAC_15_0' val=5
	'MLX5_ACTION_IN_FIELD_OUT_IP_DSCP' val=6
	'MLX5_ACTION_IN_FIELD_OUT_TCP_FLAGS' val=7
	'MLX5_ACTION_IN_FIELD_OUT_TCP_SPORT' val=8
	'MLX5_ACTION_IN_FIELD_OUT_TCP_DPORT' val=9
	'MLX5_ACTION_IN_FIELD_OUT_IP_TTL' val=10
	'MLX5_ACTION_IN_FIELD_OUT_UDP_SPORT' val=11
	'MLX5_ACTION_IN_FIELD_OUT_UDP_DPORT' val=12
	'MLX5_ACTION_IN_FIELD_OUT_SIPV6_127_96' val=13
	'MLX5_ACTION_IN_FIELD_OUT_SIPV6_95_64' val=14
	'MLX5_ACTION_IN_FIELD_OUT_SIPV6_63_32' val=15
	'MLX5_ACTION_IN_FIELD_OUT_SIPV6_31_0' val=16
	'MLX5_ACTION_IN_FIELD_OUT_DIPV6_127_96' val=17
	'MLX5_ACTION_IN_FIELD_OUT_DIPV6_95_64' val=18
	'MLX5_ACTION_IN_FIELD_OUT_DIPV6_63_32' val=19
	'MLX5_ACTION_IN_FIELD_OUT_DIPV6_31_0' val=20
	'MLX5_ACTION_IN_FIELD_OUT_SIPV4' val=21
	'MLX5_ACTION_IN_FIELD_OUT_DIPV4' val=22
	'MLX5_ACTION_IN_FIELD_OUT_FIRST_VID' val=23
	'MLX5_ACTION_IN_FIELD_OUT_IPV6_HOPLIMIT' val=71
	'MLX5_ACTION_IN_FIELD_METADATA_REG_A' val=73
	'MLX5_ACTION_IN_FIELD_METADATA_REG_B' val=80
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_0' val=81
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_1' val=82
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_2' val=83
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_3' val=84
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_4' val=85
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_5' val=86
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_6' val=87
	'MLX5_ACTION_IN_FIELD_METADATA_REG_C_7' val=88
	'MLX5_ACTION_IN_FIELD_OUT_TCP_SEQ_NUM' val=89
	'MLX5_ACTION_IN_FIELD_OUT_TCP_ACK_NUM' val=91
	'MLX5_ACTION_IN_FIELD_IPSEC_SYNDROME' val=93
	'MLX5_ACTION_IN_FIELD_OUT_EMD_47_32' val=111
	'MLX5_ACTION_IN_FIELD_OUT_EMD_31_0' val=112
[140375] ENUM 'mlx5dr_domain_type' encoding=UNSIGNED size=4 vlen=3
	'MLX5DR_DOMAIN_TYPE_NIC_RX' val=0
	'MLX5DR_DOMAIN_TYPE_NIC_TX' val=1
	'MLX5DR_DOMAIN_TYPE_FDB' val=2
[140376] STRUCT 'mlx5dr_action' size=16 vlen=3
	'action_type' type_id=140392 bits_offset=0
	'refcount' type_id=178 bits_offset=32
	'(anon)' type_id=140458 bits_offset=64
[140377] STRUCT 'mlx5dr_icm_buddy_mem' size=88 vlen=10
	'bitmap' type_id=6529 bits_offset=0
	'num_free' type_id=433 bits_offset=64
	'max_order' type_id=21 bits_offset=128
	'list_node' type_id=54 bits_offset=192
	'icm_mr' type_id=140378 bits_offset=320
	'pool' type_id=140379 bits_offset=384
	'used_memory' type_id=23 bits_offset=448
	'ste_arr' type_id=140381 bits_offset=512
	'miss_list' type_id=55 bits_offset=576
	'hw_ste_arr' type_id=2241 bits_offset=640
[140378] PTR '(anon)' type_id=145683
[140379] PTR '(anon)' type_id=145684
[140380] STRUCT 'mlx5dr_ste' size=48 vlen=6
	'refcount' type_id=21 bits_offset=0
	'ste_chain_location' type_id=19 bits_offset=32
	'miss_list_node' type_id=54 bits_offset=64
	'htbl' type_id=140395 bits_offset=192
	'next_htbl' type_id=140395 bits_offset=256
	'rule_rx_tx' type_id=140397 bits_offset=320
[140381] PTR '(anon)' type_id=140380
[140382] PTR '(anon)' type_id=140317
[140383] STRUCT 'mlx5dr_domain' size=600 vlen=22
	'mdev' type_id=139673 bits_offset=0
	'pdn' type_id=21 bits_offset=64
	'uar' type_id=139693 bits_offset=128
	'type' type_id=140375 bits_offset=192
	'refcount' type_id=178 bits_offset=224
	'ste_icm_pool' type_id=140379 bits_offset=256
	'action_icm_pool' type_id=140379 bits_offset=320
	'send_info_pool_rx' type_id=140427 bits_offset=384
	'send_info_pool_tx' type_id=140427 bits_offset=448
	'chunks_kmem_cache' type_id=970 bits_offset=512
	'htbls_kmem_cache' type_id=970 bits_offset=576
	'ptrn_mgr' type_id=140428 bits_offset=640
	'arg_mgr' type_id=140429 bits_offset=704
	'send_ring' type_id=140431 bits_offset=768
	'info' type_id=140426 bits_offset=832
	'csum_fts_xa' type_id=660 bits_offset=3712
	'ste_ctx' type_id=140433 bits_offset=3840
	'dbg_tbl_list' type_id=54 bits_offset=3904
	'dump_info' type_id=140387 bits_offset=4032
	'definers_xa' type_id=660 bits_offset=4416
	'peer_dmn_xa' type_id=660 bits_offset=4544
	'num_buddies' type_id=2436 bits_offset=4672
[140384] STRUCT 'mlx5dr_matcher' size=8696 vlen=9
	'tbl' type_id=140324 bits_offset=0
	'rx' type_id=140436 bits_offset=64
	'tx' type_id=140436 bits_offset=32960
	'list_node' type_id=54 bits_offset=65856
	'prio' type_id=21 bits_offset=65984
	'mask' type_id=140406 bits_offset=66016
	'match_criteria' type_id=19 bits_offset=69344
	'refcount' type_id=178 bits_offset=69376
	'dbg_rule_list' type_id=54 bits_offset=69440
[140385] STRUCT 'mlx5dr_table' size=152 vlen=11
	'dmn' type_id=140320 bits_offset=0
	'rx' type_id=140434 bits_offset=64
	'tx' type_id=140434 bits_offset=384
	'level' type_id=21 bits_offset=704
	'table_type' type_id=21 bits_offset=736
	'table_id' type_id=21 bits_offset=768
	'flags' type_id=21 bits_offset=800
	'matcher_list' type_id=54 bits_offset=832
	'miss_action' type_id=140317 bits_offset=960
	'refcount' type_id=178 bits_offset=1024
	'dbg_node' type_id=54 bits_offset=1088
[140386] STRUCT 'mlx5_wq_qp' size=80 vlen=2
	'rq' type_id=139852 bits_offset=0
	'sq' type_id=139852 bits_offset=320
[140387] STRUCT 'mlx5dr_dbg_dump_info' size=48 vlen=3
	'dbg_mutex' type_id=155 bits_offset=0
	'steering_debugfs' type_id=912 bits_offset=256
	'fdb_debugfs' type_id=912 bits_offset=320
[140388] ENUM 'mlx5dr_icm_chunk_size' encoding=UNSIGNED size=4 vlen=24
	'DR_CHUNK_SIZE_1' val=0
	'DR_CHUNK_SIZE_MIN' val=0
	'DR_CHUNK_SIZE_2' val=1
	'DR_CHUNK_SIZE_4' val=2
	'DR_CHUNK_SIZE_8' val=3
	'DR_CHUNK_SIZE_16' val=4
	'DR_CHUNK_SIZE_32' val=5
	'DR_CHUNK_SIZE_64' val=6
	'DR_CHUNK_SIZE_128' val=7
	'DR_CHUNK_SIZE_256' val=8
	'DR_CHUNK_SIZE_512' val=9
	'DR_CHUNK_SIZE_1K' val=10
	'DR_CHUNK_SIZE_2K' val=11
	'DR_CHUNK_SIZE_4K' val=12
	'DR_CHUNK_SIZE_8K' val=13
	'DR_CHUNK_SIZE_16K' val=14
	'DR_CHUNK_SIZE_32K' val=15
	'DR_CHUNK_SIZE_64K' val=16
	'DR_CHUNK_SIZE_128K' val=17
	'DR_CHUNK_SIZE_256K' val=18
	'DR_CHUNK_SIZE_512K' val=19
	'DR_CHUNK_SIZE_1024K' val=20
	'DR_CHUNK_SIZE_2048K' val=21
	'DR_CHUNK_SIZE_MAX' val=22
[140389] ENUM 'mlx5dr_icm_type' encoding=UNSIGNED size=4 vlen=4
	'DR_ICM_TYPE_STE' val=0
	'DR_ICM_TYPE_MODIFY_ACTION' val=1
	'DR_ICM_TYPE_MODIFY_HDR_PTRN' val=2
	'DR_ICM_TYPE_MAX' val=3
[140390] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=6
	'DR_STE_SIZE' val=64
	'DR_STE_SIZE_CTRL' val=32
	'DR_STE_SIZE_MATCH_TAG' val=32
	'DR_STE_SIZE_TAG' val=16
	'DR_STE_SIZE_MASK' val=16
	'DR_STE_SIZE_REDUCED' val=48
[140391] ENUM 'mlx5dr_ste_ctx_action_cap' encoding=UNSIGNED size=4 vlen=5
	'DR_STE_CTX_ACTION_CAP_NONE' val=0
	'DR_STE_CTX_ACTION_CAP_TX_POP' val=1
	'DR_STE_CTX_ACTION_CAP_RX_PUSH' val=2
	'DR_STE_CTX_ACTION_CAP_RX_ENCAP' val=4
	'DR_STE_CTX_ACTION_CAP_POP_MDFY' val=8
[140392] ENUM 'mlx5dr_action_type' encoding=UNSIGNED size=4 vlen=19
	'DR_ACTION_TYP_TNL_L2_TO_L2' val=0
	'DR_ACTION_TYP_L2_TO_TNL_L2' val=1
	'DR_ACTION_TYP_TNL_L3_TO_L2' val=2
	'DR_ACTION_TYP_L2_TO_TNL_L3' val=3
	'DR_ACTION_TYP_DROP' val=4
	'DR_ACTION_TYP_QP' val=5
	'DR_ACTION_TYP_FT' val=6
	'DR_ACTION_TYP_CTR' val=7
	'DR_ACTION_TYP_TAG' val=8
	'DR_ACTION_TYP_MODIFY_HDR' val=9
	'DR_ACTION_TYP_VPORT' val=10
	'DR_ACTION_TYP_POP_VLAN' val=11
	'DR_ACTION_TYP_PUSH_VLAN' val=12
	'DR_ACTION_TYP_INSERT_HDR' val=13
	'DR_ACTION_TYP_REMOVE_HDR' val=14
	'DR_ACTION_TYP_SAMPLER' val=15
	'DR_ACTION_TYP_ASO_FLOW_METER' val=16
	'DR_ACTION_TYP_RANGE' val=17
	'DR_ACTION_TYP_MAX' val=18
[140393] ENUM 'mlx5dr_ipv' encoding=UNSIGNED size=4 vlen=3
	'DR_RULE_IPV4' val=0
	'DR_RULE_IPV6' val=1
	'DR_RULE_IPV_MAX' val=2
[140394] STRUCT 'mlx5dr_ste_htbl' size=32 vlen=6
	'lu_type' type_id=20 bits_offset=0
	'byte_mask' type_id=20 bits_offset=16
	'refcount' type_id=21 bits_offset=32
	'chunk' type_id=140400 bits_offset=64
	'pointing_ste' type_id=140381 bits_offset=128
	'ctrl' type_id=140398 bits_offset=192
[140395] PTR '(anon)' type_id=140394
[140396] STRUCT 'mlx5dr_rule_rx_tx' size=16 vlen=2
	'nic_matcher' type_id=140469 bits_offset=0
	'last_rule_ste' type_id=140381 bits_offset=64
[140397] PTR '(anon)' type_id=140396
[140398] STRUCT 'mlx5dr_ste_htbl_ctrl' size=8 vlen=2
	'num_of_valid_entries' type_id=6 bits_offset=0
	'num_of_collisions' type_id=6 bits_offset=32
[140399] STRUCT 'mlx5dr_icm_chunk' size=40 vlen=6
	'buddy_mem' type_id=140470 bits_offset=0
	'seg' type_id=6 bits_offset=64
	'size' type_id=140388 bits_offset=96
	'ste_arr' type_id=140381 bits_offset=128
	'hw_ste_arr' type_id=2241 bits_offset=192
	'miss_list' type_id=55 bits_offset=256
[140400] PTR '(anon)' type_id=140399
[140401] STRUCT 'mlx5dr_ste_build' size=56 vlen=9
	'inner' type_id=19 bits_offset=0 bitfield_size=1
	'rx' type_id=19 bits_offset=1 bitfield_size=1
	'vhca_id_valid' type_id=19 bits_offset=2 bitfield_size=1
	'dmn' type_id=140320 bits_offset=64
	'caps' type_id=140403 bits_offset=128
	'lu_type' type_id=20 bits_offset=192
	'byte_mask' type_id=20 bits_offset=208
	'bit_mask' type_id=474 bits_offset=224
	'ste_build_tag_func' type_id=140408 bits_offset=384
[140402] STRUCT 'mlx5dr_cmd_caps' size=224 vlen=42
	'gvmi' type_id=20 bits_offset=0
	'nic_rx_drop_address' type_id=23 bits_offset=64
	'nic_tx_drop_address' type_id=23 bits_offset=128
	'nic_tx_allow_address' type_id=23 bits_offset=192
	'esw_rx_drop_address' type_id=23 bits_offset=256
	'esw_tx_drop_address' type_id=23 bits_offset=320
	'log_icm_size' type_id=21 bits_offset=384
	'hdr_modify_icm_addr' type_id=23 bits_offset=448
	'log_modify_pattern_icm_size' type_id=21 bits_offset=512
	'hdr_modify_pattern_icm_addr' type_id=23 bits_offset=576
	'flex_protocols' type_id=21 bits_offset=640
	'flex_parser_id_icmp_dw0' type_id=19 bits_offset=672
	'flex_parser_id_icmp_dw1' type_id=19 bits_offset=680
	'flex_parser_id_icmpv6_dw0' type_id=19 bits_offset=688
	'flex_parser_id_icmpv6_dw1' type_id=19 bits_offset=696
	'flex_parser_id_geneve_tlv_option_0' type_id=19 bits_offset=704
	'flex_parser_id_mpls_over_gre' type_id=19 bits_offset=712
	'flex_parser_id_mpls_over_udp' type_id=19 bits_offset=720
	'flex_parser_id_gtpu_dw_0' type_id=19 bits_offset=728
	'flex_parser_id_gtpu_teid' type_id=19 bits_offset=736
	'flex_parser_id_gtpu_dw_2' type_id=19 bits_offset=744
	'flex_parser_id_gtpu_first_ext_dw_0' type_id=19 bits_offset=752
	'flex_parser_ok_bits_supp' type_id=19 bits_offset=760
	'max_ft_level' type_id=19 bits_offset=768
	'roce_min_src_udp' type_id=20 bits_offset=784
	'sw_format_ver' type_id=19 bits_offset=800
	'eswitch_manager' type_id=42 bits_offset=808
	'rx_sw_owner' type_id=42 bits_offset=816
	'tx_sw_owner' type_id=42 bits_offset=824
	'fdb_sw_owner' type_id=42 bits_offset=832
	'rx_sw_owner_v2' type_id=19 bits_offset=840 bitfield_size=1
	'tx_sw_owner_v2' type_id=19 bits_offset=841 bitfield_size=1
	'fdb_sw_owner_v2' type_id=19 bits_offset=842 bitfield_size=1
	'esw_caps' type_id=140420 bits_offset=896
	'vports' type_id=140423 bits_offset=1216
	'prio_tag_required' type_id=42 bits_offset=1728
	'roce_caps' type_id=140422 bits_offset=1736
	'log_header_modify_argument_granularity' type_id=20 bits_offset=1744
	'log_header_modify_argument_max_alloc' type_id=20 bits_offset=1760
	'support_modify_argument' type_id=42 bits_offset=1776
	'is_ecpf' type_id=19 bits_offset=1784 bitfield_size=1
	'isolate_vl_tc' type_id=19 bits_offset=1785 bitfield_size=1
[140403] PTR '(anon)' type_id=140402
[140404] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=140405
	'(anon)' type_id=140407
	'(anon)' type_id=2241
[140405] PTR '(anon)' type_id=140406
[140406] STRUCT 'mlx5dr_match_param' size=416 vlen=7
	'outer' type_id=140414 bits_offset=0
	'misc' type_id=140415 bits_offset=512
	'inner' type_id=140414 bits_offset=1024
	'misc2' type_id=140416 bits_offset=1536
	'misc3' type_id=140417 bits_offset=2048
	'misc4' type_id=140418 bits_offset=2560
	'misc5' type_id=140419 bits_offset=3072
[140407] PTR '(anon)' type_id=140401
[140408] PTR '(anon)' type_id=140404
[140409] STRUCT '(anon)' size=12 vlen=4
	'id' type_id=21 bits_offset=0
	'size' type_id=21 bits_offset=32
	'param_0' type_id=19 bits_offset=64
	'param_1' type_id=19 bits_offset=72
[140410] STRUCT '(anon)' size=12 vlen=2
	'count' type_id=13 bits_offset=0
	'headers' type_id=6959 bits_offset=32
[140411] STRUCT '(anon)' size=12 vlen=4
	'obj_id' type_id=21 bits_offset=0
	'offset' type_id=21 bits_offset=32
	'dest_reg_id' type_id=19 bits_offset=64
	'init_color' type_id=19 bits_offset=72
[140412] STRUCT '(anon)' size=24 vlen=4
	'miss_icm_addr' type_id=23 bits_offset=0
	'definer_id' type_id=21 bits_offset=64
	'min' type_id=21 bits_offset=96
	'max' type_id=21 bits_offset=128
[140413] STRUCT 'mlx5dr_ste_actions_attr' size=120 vlen=17
	'modify_index' type_id=21 bits_offset=0
	'modify_pat_idx' type_id=21 bits_offset=32
	'modify_actions' type_id=20 bits_offset=64
	'single_modify_action' type_id=2241 bits_offset=128
	'decap_index' type_id=21 bits_offset=192
	'decap_pat_idx' type_id=21 bits_offset=224
	'decap_actions' type_id=20 bits_offset=256
	'decap_with_vlan' type_id=19 bits_offset=272 bitfield_size=1
	'final_icm_addr' type_id=23 bits_offset=320
	'flow_tag' type_id=21 bits_offset=384
	'ctr_id' type_id=21 bits_offset=416
	'gvmi' type_id=20 bits_offset=448
	'hit_gvmi' type_id=20 bits_offset=464
	'reformat' type_id=140409 bits_offset=480
	'vlans' type_id=140410 bits_offset=576
	'aso_flow_meter' type_id=140411 bits_offset=672
	'range' type_id=140412 bits_offset=768
[140414] STRUCT 'mlx5dr_match_spec' size=64 vlen=32
	'smac_47_16' type_id=21 bits_offset=0
	'smac_15_0' type_id=21 bits_offset=32 bitfield_size=16
	'ethertype' type_id=21 bits_offset=48 bitfield_size=16
	'dmac_47_16' type_id=21 bits_offset=64
	'dmac_15_0' type_id=21 bits_offset=96 bitfield_size=16
	'first_prio' type_id=21 bits_offset=112 bitfield_size=3
	'first_cfi' type_id=21 bits_offset=115 bitfield_size=1
	'first_vid' type_id=21 bits_offset=116 bitfield_size=12
	'ip_protocol' type_id=21 bits_offset=128 bitfield_size=8
	'ip_dscp' type_id=21 bits_offset=136 bitfield_size=6
	'ip_ecn' type_id=21 bits_offset=142 bitfield_size=2
	'cvlan_tag' type_id=21 bits_offset=144 bitfield_size=1
	'svlan_tag' type_id=21 bits_offset=145 bitfield_size=1
	'frag' type_id=21 bits_offset=146 bitfield_size=1
	'ip_version' type_id=21 bits_offset=147 bitfield_size=4
	'tcp_flags' type_id=21 bits_offset=151 bitfield_size=9
	'tcp_sport' type_id=21 bits_offset=160 bitfield_size=16
	'tcp_dport' type_id=21 bits_offset=176 bitfield_size=16
	'reserved_auto1' type_id=21 bits_offset=192 bitfield_size=16
	'ipv4_ihl' type_id=21 bits_offset=208 bitfield_size=4
	'reserved_auto2' type_id=21 bits_offset=212 bitfield_size=4
	'ttl_hoplimit' type_id=21 bits_offset=216 bitfield_size=8
	'udp_sport' type_id=21 bits_offset=224 bitfield_size=16
	'udp_dport' type_id=21 bits_offset=240 bitfield_size=16
	'src_ip_127_96' type_id=21 bits_offset=256
	'src_ip_95_64' type_id=21 bits_offset=288
	'src_ip_63_32' type_id=21 bits_offset=320
	'src_ip_31_0' type_id=21 bits_offset=352
	'dst_ip_127_96' type_id=21 bits_offset=384
	'dst_ip_95_64' type_id=21 bits_offset=416
	'dst_ip_63_32' type_id=21 bits_offset=448
	'dst_ip_31_0' type_id=21 bits_offset=480
[140415] STRUCT 'mlx5dr_match_misc' size=64 vlen=40
	'gre_c_present' type_id=21 bits_offset=0 bitfield_size=1
	'reserved_auto1' type_id=21 bits_offset=1 bitfield_size=1
	'gre_k_present' type_id=21 bits_offset=2 bitfield_size=1
	'gre_s_present' type_id=21 bits_offset=3 bitfield_size=1
	'source_vhca_port' type_id=21 bits_offset=4 bitfield_size=4
	'source_sqn' type_id=21 bits_offset=8 bitfield_size=24
	'source_eswitch_owner_vhca_id' type_id=21 bits_offset=32 bitfield_size=16
	'source_port' type_id=21 bits_offset=48 bitfield_size=16
	'outer_second_prio' type_id=21 bits_offset=64 bitfield_size=3
	'outer_second_cfi' type_id=21 bits_offset=67 bitfield_size=1
	'outer_second_vid' type_id=21 bits_offset=68 bitfield_size=12
	'inner_second_prio' type_id=21 bits_offset=80 bitfield_size=3
	'inner_second_cfi' type_id=21 bits_offset=83 bitfield_size=1
	'inner_second_vid' type_id=21 bits_offset=84 bitfield_size=12
	'outer_second_cvlan_tag' type_id=21 bits_offset=96 bitfield_size=1
	'inner_second_cvlan_tag' type_id=21 bits_offset=97 bitfield_size=1
	'outer_second_svlan_tag' type_id=21 bits_offset=98 bitfield_size=1
	'inner_second_svlan_tag' type_id=21 bits_offset=99 bitfield_size=1
	'reserved_auto2' type_id=21 bits_offset=100 bitfield_size=12
	'gre_protocol' type_id=21 bits_offset=112 bitfield_size=16
	'gre_key_h' type_id=21 bits_offset=128 bitfield_size=24
	'gre_key_l' type_id=21 bits_offset=152 bitfield_size=8
	'vxlan_vni' type_id=21 bits_offset=160 bitfield_size=24
	'reserved_auto3' type_id=21 bits_offset=184 bitfield_size=8
	'geneve_vni' type_id=21 bits_offset=192 bitfield_size=24
	'reserved_auto4' type_id=21 bits_offset=216 bitfield_size=6
	'geneve_tlv_option_0_exist' type_id=21 bits_offset=222 bitfield_size=1
	'geneve_oam' type_id=21 bits_offset=223 bitfield_size=1
	'reserved_auto5' type_id=21 bits_offset=224 bitfield_size=12
	'outer_ipv6_flow_label' type_id=21 bits_offset=236 bitfield_size=20
	'reserved_auto6' type_id=21 bits_offset=256 bitfield_size=12
	'inner_ipv6_flow_label' type_id=21 bits_offset=268 bitfield_size=20
	'reserved_auto7' type_id=21 bits_offset=288 bitfield_size=10
	'geneve_opt_len' type_id=21 bits_offset=298 bitfield_size=6
	'geneve_protocol_type' type_id=21 bits_offset=304 bitfield_size=16
	'reserved_auto8' type_id=21 bits_offset=320 bitfield_size=8
	'bth_dst_qp' type_id=21 bits_offset=328 bitfield_size=24
	'reserved_auto9' type_id=21 bits_offset=352
	'outer_esp_spi' type_id=21 bits_offset=384
	'reserved_auto10' type_id=2436 bits_offset=416
[140416] STRUCT 'mlx5dr_match_misc2' size=64 vlen=26
	'outer_first_mpls_label' type_id=21 bits_offset=0 bitfield_size=20
	'outer_first_mpls_exp' type_id=21 bits_offset=20 bitfield_size=3
	'outer_first_mpls_s_bos' type_id=21 bits_offset=23 bitfield_size=1
	'outer_first_mpls_ttl' type_id=21 bits_offset=24 bitfield_size=8
	'inner_first_mpls_label' type_id=21 bits_offset=32 bitfield_size=20
	'inner_first_mpls_exp' type_id=21 bits_offset=52 bitfield_size=3
	'inner_first_mpls_s_bos' type_id=21 bits_offset=55 bitfield_size=1
	'inner_first_mpls_ttl' type_id=21 bits_offset=56 bitfield_size=8
	'outer_first_mpls_over_gre_label' type_id=21 bits_offset=64 bitfield_size=20
	'outer_first_mpls_over_gre_exp' type_id=21 bits_offset=84 bitfield_size=3
	'outer_first_mpls_over_gre_s_bos' type_id=21 bits_offset=87 bitfield_size=1
	'outer_first_mpls_over_gre_ttl' type_id=21 bits_offset=88 bitfield_size=8
	'outer_first_mpls_over_udp_label' type_id=21 bits_offset=96 bitfield_size=20
	'outer_first_mpls_over_udp_exp' type_id=21 bits_offset=116 bitfield_size=3
	'outer_first_mpls_over_udp_s_bos' type_id=21 bits_offset=119 bitfield_size=1
	'outer_first_mpls_over_udp_ttl' type_id=21 bits_offset=120 bitfield_size=8
	'metadata_reg_c_7' type_id=21 bits_offset=128
	'metadata_reg_c_6' type_id=21 bits_offset=160
	'metadata_reg_c_5' type_id=21 bits_offset=192
	'metadata_reg_c_4' type_id=21 bits_offset=224
	'metadata_reg_c_3' type_id=21 bits_offset=256
	'metadata_reg_c_2' type_id=21 bits_offset=288
	'metadata_reg_c_1' type_id=21 bits_offset=320
	'metadata_reg_c_0' type_id=21 bits_offset=352
	'metadata_reg_a' type_id=21 bits_offset=384
	'reserved_auto1' type_id=2436 bits_offset=416
[140417] STRUCT 'mlx5dr_match_misc3' size=64 vlen=24
	'inner_tcp_seq_num' type_id=21 bits_offset=0
	'outer_tcp_seq_num' type_id=21 bits_offset=32
	'inner_tcp_ack_num' type_id=21 bits_offset=64
	'outer_tcp_ack_num' type_id=21 bits_offset=96
	'reserved_auto1' type_id=21 bits_offset=128 bitfield_size=8
	'outer_vxlan_gpe_vni' type_id=21 bits_offset=136 bitfield_size=24
	'outer_vxlan_gpe_next_protocol' type_id=21 bits_offset=160 bitfield_size=8
	'outer_vxlan_gpe_flags' type_id=21 bits_offset=168 bitfield_size=8
	'reserved_auto2' type_id=21 bits_offset=176 bitfield_size=16
	'icmpv4_header_data' type_id=21 bits_offset=192
	'icmpv6_header_data' type_id=21 bits_offset=224
	'icmpv4_type' type_id=19 bits_offset=256
	'icmpv4_code' type_id=19 bits_offset=264
	'icmpv6_type' type_id=19 bits_offset=272
	'icmpv6_code' type_id=19 bits_offset=280
	'geneve_tlv_option_0_data' type_id=21 bits_offset=288
	'gtpu_teid' type_id=21 bits_offset=320
	'gtpu_msg_type' type_id=19 bits_offset=352
	'gtpu_msg_flags' type_id=19 bits_offset=360
	'reserved_auto3' type_id=21 bits_offset=368 bitfield_size=16
	'gtpu_dw_2' type_id=21 bits_offset=384
	'gtpu_first_ext_dw_0' type_id=21 bits_offset=416
	'gtpu_dw_0' type_id=21 bits_offset=448
	'reserved_auto4' type_id=21 bits_offset=480
[140418] STRUCT 'mlx5dr_match_misc4' size=64 vlen=9
	'prog_sample_field_value_0' type_id=21 bits_offset=0
	'prog_sample_field_id_0' type_id=21 bits_offset=32
	'prog_sample_field_value_1' type_id=21 bits_offset=64
	'prog_sample_field_id_1' type_id=21 bits_offset=96
	'prog_sample_field_value_2' type_id=21 bits_offset=128
	'prog_sample_field_id_2' type_id=21 bits_offset=160
	'prog_sample_field_value_3' type_id=21 bits_offset=192
	'prog_sample_field_id_3' type_id=21 bits_offset=224
	'reserved_auto1' type_id=3726 bits_offset=256
[140419] STRUCT 'mlx5dr_match_misc5' size=32 vlen=8
	'macsec_tag_0' type_id=21 bits_offset=0
	'macsec_tag_1' type_id=21 bits_offset=32
	'macsec_tag_2' type_id=21 bits_offset=64
	'macsec_tag_3' type_id=21 bits_offset=96
	'tunnel_header_0' type_id=21 bits_offset=128
	'tunnel_header_1' type_id=21 bits_offset=160
	'tunnel_header_2' type_id=21 bits_offset=192
	'tunnel_header_3' type_id=21 bits_offset=224
[140420] STRUCT 'mlx5dr_esw_caps' size=40 vlen=6
	'drop_icm_address_rx' type_id=23 bits_offset=0
	'drop_icm_address_tx' type_id=23 bits_offset=64
	'uplink_icm_address_rx' type_id=23 bits_offset=128
	'uplink_icm_address_tx' type_id=23 bits_offset=192
	'sw_owner' type_id=19 bits_offset=256 bitfield_size=1
	'sw_owner_v2' type_id=19 bits_offset=257 bitfield_size=1
[140421] STRUCT 'mlx5dr_cmd_vport_cap' size=24 vlen=5
	'vport_gvmi' type_id=20 bits_offset=0
	'vhca_gvmi' type_id=20 bits_offset=16
	'num' type_id=20 bits_offset=32
	'icm_address_rx' type_id=23 bits_offset=64
	'icm_address_tx' type_id=23 bits_offset=128
[140422] STRUCT 'mlx5dr_roce_cap' size=1 vlen=3
	'roce_en' type_id=19 bits_offset=0 bitfield_size=1
	'fl_rc_qp_when_roce_disabled' type_id=19 bits_offset=1 bitfield_size=1
	'fl_rc_qp_when_roce_enabled' type_id=19 bits_offset=2 bitfield_size=1
[140423] STRUCT 'mlx5dr_vports' size=64 vlen=3
	'esw_manager_caps' type_id=140421 bits_offset=0
	'uplink_caps' type_id=140421 bits_offset=192
	'vports_caps_xa' type_id=660 bits_offset=384
[140424] ENUM 'mlx5dr_domain_nic_type' encoding=UNSIGNED size=4 vlen=2
	'DR_DOMAIN_NIC_TYPE_RX' val=0
	'DR_DOMAIN_NIC_TYPE_TX' val=1
[140425] STRUCT 'mlx5dr_domain_rx_tx' size=56 vlen=4
	'drop_icm_addr' type_id=23 bits_offset=0
	'default_icm_addr' type_id=23 bits_offset=64
	'type' type_id=140424 bits_offset=128
	'mutex' type_id=155 bits_offset=192
[140426] STRUCT 'mlx5dr_domain_info' size=360 vlen=9
	'supp_sw_steering' type_id=42 bits_offset=0
	'max_inline_size' type_id=21 bits_offset=32
	'max_send_wr' type_id=21 bits_offset=64
	'max_log_sw_icm_sz' type_id=21 bits_offset=96
	'max_log_action_icm_sz' type_id=21 bits_offset=128
	'max_log_modify_hdr_pattern_icm_sz' type_id=21 bits_offset=160
	'rx' type_id=140425 bits_offset=192
	'tx' type_id=140425 bits_offset=640
	'caps' type_id=140402 bits_offset=1088
[140427] PTR '(anon)' type_id=143350
[140428] PTR '(anon)' type_id=141445
[140429] PTR '(anon)' type_id=144278
[140430] STRUCT 'mlx5dr_send_ring' size=80 vlen=13
	'cq' type_id=140477 bits_offset=0
	'qp' type_id=140475 bits_offset=64
	'mr' type_id=140478 bits_offset=128
	'pending_wqe' type_id=21 bits_offset=192
	'signal_th' type_id=20 bits_offset=224
	'max_post_send_size' type_id=21 bits_offset=256
	'tx_head' type_id=21 bits_offset=288
	'buf' type_id=64 bits_offset=320
	'buf_size' type_id=21 bits_offset=384
	'sync_buff' type_id=2241 bits_offset=448
	'sync_mr' type_id=140478 bits_offset=512
	'lock' type_id=154 bits_offset=576
	'err_state' type_id=42 bits_offset=608
[140431] PTR '(anon)' type_id=140430
[140432] STRUCT 'mlx5dr_ste_ctx' size=408 vlen=51
	'build_eth_l2_src_dst_init' type_id=140482 bits_offset=0
	'build_eth_l3_ipv6_src_init' type_id=140482 bits_offset=64
	'build_eth_l3_ipv6_dst_init' type_id=140482 bits_offset=128
	'build_eth_l3_ipv4_5_tuple_init' type_id=140482 bits_offset=192
	'build_eth_l2_src_init' type_id=140482 bits_offset=256
	'build_eth_l2_dst_init' type_id=140482 bits_offset=320
	'build_eth_l2_tnl_init' type_id=140482 bits_offset=384
	'build_eth_l3_ipv4_misc_init' type_id=140482 bits_offset=448
	'build_eth_ipv6_l3_l4_init' type_id=140482 bits_offset=512
	'build_mpls_init' type_id=140482 bits_offset=576
	'build_tnl_gre_init' type_id=140482 bits_offset=640
	'build_tnl_mpls_init' type_id=140482 bits_offset=704
	'build_tnl_mpls_over_gre_init' type_id=140482 bits_offset=768
	'build_tnl_mpls_over_udp_init' type_id=140482 bits_offset=832
	'build_icmp_init' type_id=140482 bits_offset=896
	'build_general_purpose_init' type_id=140482 bits_offset=960
	'build_eth_l4_misc_init' type_id=140482 bits_offset=1024
	'build_tnl_vxlan_gpe_init' type_id=140482 bits_offset=1088
	'build_tnl_geneve_init' type_id=140482 bits_offset=1152
	'build_tnl_geneve_tlv_opt_init' type_id=140482 bits_offset=1216
	'build_tnl_geneve_tlv_opt_exist_init' type_id=140482 bits_offset=1280
	'build_register_0_init' type_id=140482 bits_offset=1344
	'build_register_1_init' type_id=140482 bits_offset=1408
	'build_src_gvmi_qpn_init' type_id=140482 bits_offset=1472
	'build_flex_parser_0_init' type_id=140482 bits_offset=1536
	'build_flex_parser_1_init' type_id=140482 bits_offset=1600
	'build_tnl_gtpu_init' type_id=140482 bits_offset=1664
	'build_tnl_header_0_1_init' type_id=140482 bits_offset=1728
	'build_tnl_gtpu_flex_parser_0_init' type_id=140482 bits_offset=1792
	'build_tnl_gtpu_flex_parser_1_init' type_id=140482 bits_offset=1856
	'ste_init' type_id=140484 bits_offset=1920
	'set_next_lu_type' type_id=140486 bits_offset=1984
	'get_next_lu_type' type_id=140488 bits_offset=2048
	'is_miss_addr_set' type_id=140490 bits_offset=2112
	'set_miss_addr' type_id=140492 bits_offset=2176
	'get_miss_addr' type_id=140494 bits_offset=2240
	'set_hit_addr' type_id=140496 bits_offset=2304
	'set_byte_mask' type_id=140486 bits_offset=2368
	'get_byte_mask' type_id=140488 bits_offset=2432
	'actions_caps' type_id=21 bits_offset=2496
	'set_actions_rx' type_id=140499 bits_offset=2560
	'set_actions_tx' type_id=140499 bits_offset=2624
	'modify_field_arr_sz' type_id=21 bits_offset=2688
	'modify_field_arr' type_id=140500 bits_offset=2752
	'set_action_set' type_id=140502 bits_offset=2816
	'set_action_add' type_id=140502 bits_offset=2880
	'set_action_copy' type_id=140504 bits_offset=2944
	'set_action_decap_l3_list' type_id=140506 bits_offset=3008
	'alloc_modify_hdr_chunk' type_id=140508 bits_offset=3072
	'dealloc_modify_hdr_chunk' type_id=140510 bits_offset=3136
	'prepare_for_postsend' type_id=140512 bits_offset=3200
[140433] PTR '(anon)' type_id=140432
[140434] STRUCT 'mlx5dr_table_rx_tx' size=40 vlen=4
	's_anchor' type_id=140395 bits_offset=0
	'nic_dmn' type_id=140435 bits_offset=64
	'default_icm_addr' type_id=23 bits_offset=128
	'nic_matcher_list' type_id=54 bits_offset=192
[140435] PTR '(anon)' type_id=140425
[140436] STRUCT 'mlx5dr_matcher_rx_tx' size=4112 vlen=11
	's_htbl' type_id=140395 bits_offset=0
	'e_anchor' type_id=140395 bits_offset=64
	'ste_builder' type_id=140407 bits_offset=128
	'ste_builder_arr' type_id=140437 bits_offset=192
	'num_of_builders' type_id=19 bits_offset=32448
	'num_of_builders_arr' type_id=2120 bits_offset=32456
	'default_icm_addr' type_id=23 bits_offset=32512
	'nic_tbl' type_id=140438 bits_offset=32576
	'prio' type_id=21 bits_offset=32640
	'list_node' type_id=54 bits_offset=32704
	'rules' type_id=21 bits_offset=32832
[140437] ARRAY '(anon)' type_id=140401 index_type_id=13 nr_elems=72
[140438] PTR '(anon)' type_id=140434
[140439] STRUCT 'mlx5dr_ste_action_modify_field' size=6 vlen=5
	'hw_field' type_id=20 bits_offset=0
	'start' type_id=19 bits_offset=16
	'end' type_id=19 bits_offset=24
	'l3_type' type_id=19 bits_offset=32
	'l4_type' type_id=19 bits_offset=40
[140440] CONST '(anon)' type_id=140439
[140441] STRUCT 'mlx5dr_ptrn_obj' size=48 vlen=6
	'chunk' type_id=140400 bits_offset=0
	'data' type_id=2241 bits_offset=64
	'num_of_actions' type_id=20 bits_offset=128
	'index' type_id=21 bits_offset=160
	'refcount' type_id=178 bits_offset=192
	'list' type_id=54 bits_offset=256
[140442] STRUCT 'mlx5dr_arg_obj' size=32 vlen=4
	'obj_id' type_id=21 bits_offset=0
	'obj_offset' type_id=21 bits_offset=32
	'list_node' type_id=54 bits_offset=64
	'log_chunk_size' type_id=21 bits_offset=192
[140443] STRUCT 'mlx5dr_action_rewrite' size=56 vlen=11
	'dmn' type_id=140320 bits_offset=0
	'chunk' type_id=140400 bits_offset=64
	'data' type_id=2241 bits_offset=128
	'num_of_actions' type_id=20 bits_offset=192
	'index' type_id=21 bits_offset=224
	'single_action_opt' type_id=19 bits_offset=256 bitfield_size=1
	'allow_rx' type_id=19 bits_offset=257 bitfield_size=1
	'allow_tx' type_id=19 bits_offset=258 bitfield_size=1
	'modify_ttl' type_id=19 bits_offset=259 bitfield_size=1
	'ptrn' type_id=140444 bits_offset=320
	'arg' type_id=140445 bits_offset=384
[140444] PTR '(anon)' type_id=140441
[140445] PTR '(anon)' type_id=140442
[140446] STRUCT 'mlx5dr_action_reformat' size=24 vlen=5
	'dmn' type_id=140320 bits_offset=0
	'id' type_id=21 bits_offset=64
	'size' type_id=21 bits_offset=96
	'param_0' type_id=19 bits_offset=128
	'param_1' type_id=19 bits_offset=136
[140447] STRUCT 'mlx5dr_action_sampler' size=32 vlen=4
	'dmn' type_id=140320 bits_offset=0
	'rx_icm_addr' type_id=23 bits_offset=64
	'tx_icm_addr' type_id=23 bits_offset=128
	'sampler_id' type_id=21 bits_offset=192
[140448] STRUCT '(anon)' size=56 vlen=8
	'dmn' type_id=140320 bits_offset=0
	'id' type_id=21 bits_offset=64
	'group_id' type_id=21 bits_offset=96
	'type' type_id=140328 bits_offset=128
	'rx_icm_addr' type_id=23 bits_offset=192
	'tx_icm_addr' type_id=23 bits_offset=256
	'ref_actions' type_id=140382 bits_offset=320
	'num_of_ref_actions' type_id=21 bits_offset=384
[140449] UNION '(anon)' size=56 vlen=2
	'tbl' type_id=140324 bits_offset=0
	'fw_tbl' type_id=140448 bits_offset=0
[140450] STRUCT 'mlx5dr_action_dest_tbl' size=64 vlen=3
	'is_fw_tbl' type_id=19 bits_offset=0 bitfield_size=1
	'is_wire_ft' type_id=19 bits_offset=1 bitfield_size=1
	'(anon)' type_id=140449 bits_offset=64
[140451] STRUCT 'mlx5dr_action_range' size=40 vlen=6
	'dmn' type_id=140320 bits_offset=0
	'hit_tbl_action' type_id=140317 bits_offset=64
	'miss_tbl_action' type_id=140317 bits_offset=128
	'definer_id' type_id=21 bits_offset=192
	'min' type_id=21 bits_offset=224
	'max' type_id=21 bits_offset=256
[140452] STRUCT 'mlx5dr_action_ctr' size=8 vlen=2
	'ctr_id' type_id=21 bits_offset=0
	'offset' type_id=21 bits_offset=32
[140453] STRUCT 'mlx5dr_action_vport' size=16 vlen=2
	'dmn' type_id=140320 bits_offset=0
	'caps' type_id=140454 bits_offset=64
[140454] PTR '(anon)' type_id=140421
[140455] STRUCT 'mlx5dr_action_push_vlan' size=4 vlen=1
	'vlan_hdr' type_id=21 bits_offset=0
[140456] STRUCT 'mlx5dr_action_flow_tag' size=4 vlen=1
	'flow_tag' type_id=21 bits_offset=0
[140457] STRUCT 'mlx5dr_action_aso_flow_meter' size=24 vlen=5
	'dmn' type_id=140320 bits_offset=0
	'obj_id' type_id=21 bits_offset=64
	'offset' type_id=21 bits_offset=96
	'dest_reg_id' type_id=19 bits_offset=128
	'init_color' type_id=19 bits_offset=136
[140458] UNION '(anon)' size=8 vlen=11
	'data' type_id=64 bits_offset=0
	'rewrite' type_id=140459 bits_offset=0
	'reformat' type_id=140460 bits_offset=0
	'sampler' type_id=140461 bits_offset=0
	'dest_tbl' type_id=140462 bits_offset=0
	'ctr' type_id=140463 bits_offset=0
	'vport' type_id=140464 bits_offset=0
	'push_vlan' type_id=140465 bits_offset=0
	'flow_tag' type_id=140466 bits_offset=0
	'aso' type_id=140467 bits_offset=0
	'range' type_id=140468 bits_offset=0
[140459] PTR '(anon)' type_id=140443
[140460] PTR '(anon)' type_id=140446
[140461] PTR '(anon)' type_id=140447
[140462] PTR '(anon)' type_id=140450
[140463] PTR '(anon)' type_id=140452
[140464] PTR '(anon)' type_id=140453
[140465] PTR '(anon)' type_id=140455
[140466] PTR '(anon)' type_id=140456
[140467] PTR '(anon)' type_id=140457
[140468] PTR '(anon)' type_id=140451
[140469] PTR '(anon)' type_id=140436
[140470] PTR '(anon)' type_id=140377
[140471] STRUCT '(anon)' size=32 vlen=6
	'head' type_id=6 bits_offset=0
	'pc' type_id=6 bits_offset=32
	'cc' type_id=6 bits_offset=64
	'size' type_id=6 bits_offset=96
	'wqe_head' type_id=433 bits_offset=128
	'wqe_cnt' type_id=6 bits_offset=192
[140472] STRUCT '(anon)' size=16 vlen=4
	'pc' type_id=6 bits_offset=0
	'cc' type_id=6 bits_offset=32
	'size' type_id=6 bits_offset=64
	'wqe_cnt' type_id=6 bits_offset=96
[140473] STRUCT 'mlx5dr_qp' size=224 vlen=8
	'mdev' type_id=139673 bits_offset=0
	'wq' type_id=140386 bits_offset=64
	'uar' type_id=139693 bits_offset=704
	'wq_ctrl' type_id=139851 bits_offset=768
	'qpn' type_id=21 bits_offset=1280
	'sq' type_id=140471 bits_offset=1344
	'rq' type_id=140472 bits_offset=1600
	'max_inline_data' type_id=13 bits_offset=1728
[140474] STRUCT 'mlx5dr_cq' size=312 vlen=5
	'mdev' type_id=139673 bits_offset=0
	'wq' type_id=139853 bits_offset=64
	'wq_ctrl' type_id=139851 bits_offset=384
	'mcq' type_id=139845 bits_offset=896
	'qp' type_id=140475 bits_offset=2432
[140475] PTR '(anon)' type_id=140473
[140476] STRUCT 'mlx5dr_mr' size=40 vlen=5
	'mdev' type_id=139673 bits_offset=0
	'mkey' type_id=21 bits_offset=64
	'dma_addr' type_id=3718 bits_offset=128
	'addr' type_id=64 bits_offset=192
	'size' type_id=45 bits_offset=256
[140477] PTR '(anon)' type_id=140474
[140478] PTR '(anon)' type_id=140476
[140479] ENUM 'dr_ste_action_modify_type_l3' encoding=UNSIGNED size=4 vlen=3
	'DR_STE_ACTION_MDFY_TYPE_L3_NONE' val=0
	'DR_STE_ACTION_MDFY_TYPE_L3_IPV4' val=1
	'DR_STE_ACTION_MDFY_TYPE_L3_IPV6' val=2
[140480] ENUM 'dr_ste_action_modify_type_l4' encoding=UNSIGNED size=4 vlen=3
	'DR_STE_ACTION_MDFY_TYPE_L4_NONE' val=0
	'DR_STE_ACTION_MDFY_TYPE_L4_TCP' val=1
	'DR_STE_ACTION_MDFY_TYPE_L4_UDP' val=2
[140481] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=140407
	'(anon)' type_id=140405
[140482] PTR '(anon)' type_id=140481
[140483] FUNC_PROTO '(anon)' ret_type_id=0 vlen=4
	'(anon)' type_id=2241
	'(anon)' type_id=20
	'(anon)' type_id=42
	'(anon)' type_id=20
[140484] PTR '(anon)' type_id=140483
[140485] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=2241
	'(anon)' type_id=20
[140486] PTR '(anon)' type_id=140485
[140487] FUNC_PROTO '(anon)' ret_type_id=20 vlen=1
	'(anon)' type_id=2241
[140488] PTR '(anon)' type_id=140487
[140489] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'(anon)' type_id=2241
[140490] PTR '(anon)' type_id=140489
[140491] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=2241
	'(anon)' type_id=23
[140492] PTR '(anon)' type_id=140491
[140493] FUNC_PROTO '(anon)' ret_type_id=23 vlen=1
	'(anon)' type_id=2241
[140494] PTR '(anon)' type_id=140493
[140495] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'(anon)' type_id=2241
	'(anon)' type_id=23
	'(anon)' type_id=21
[140496] PTR '(anon)' type_id=140495
[140497] FUNC_PROTO '(anon)' ret_type_id=0 vlen=6
	'(anon)' type_id=140320
	'(anon)' type_id=2241
	'(anon)' type_id=21
	'(anon)' type_id=2241
	'(anon)' type_id=140498
	'(anon)' type_id=96
[140498] PTR '(anon)' type_id=140413
[140499] PTR '(anon)' type_id=140497
[140500] PTR '(anon)' type_id=140440
[140501] FUNC_PROTO '(anon)' ret_type_id=0 vlen=5
	'(anon)' type_id=2241
	'(anon)' type_id=19
	'(anon)' type_id=19
	'(anon)' type_id=19
	'(anon)' type_id=21
[140502] PTR '(anon)' type_id=140501
[140503] FUNC_PROTO '(anon)' ret_type_id=0 vlen=6
	'(anon)' type_id=2241
	'(anon)' type_id=19
	'(anon)' type_id=19
	'(anon)' type_id=19
	'(anon)' type_id=19
	'(anon)' type_id=19
[140504] PTR '(anon)' type_id=140503
[140505] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'(anon)' type_id=64
	'(anon)' type_id=21
	'(anon)' type_id=2241
	'(anon)' type_id=21
	'(anon)' type_id=5292
[140506] PTR '(anon)' type_id=140505
[140507] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=140317
[140508] PTR '(anon)' type_id=140507
[140509] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=140317
[140510] PTR '(anon)' type_id=140509
[140511] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=2241
	'(anon)' type_id=21
[140512] PTR '(anon)' type_id=140511
[140513] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=30
	'DR_STE_V2_ACTION_MDFY_FLD_L2_OUT_0' val=0
	'DR_STE_V2_ACTION_MDFY_FLD_L2_OUT_1' val=1
	'DR_STE_V2_ACTION_MDFY_FLD_L2_OUT_2' val=2
	'DR_STE_V2_ACTION_MDFY_FLD_SRC_L2_OUT_0' val=8
	'DR_STE_V2_ACTION_MDFY_FLD_SRC_L2_OUT_1' val=9
	'DR_STE_V2_ACTION_MDFY_FLD_L3_OUT_0' val=14
	'DR_STE_V2_ACTION_MDFY_FLD_L4_OUT_0' val=24
	'DR_STE_V2_ACTION_MDFY_FLD_L4_OUT_1' val=25
	'DR_STE_V2_ACTION_MDFY_FLD_IPV4_OUT_0' val=64
	'DR_STE_V2_ACTION_MDFY_FLD_IPV4_OUT_1' val=65
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_DST_OUT_0' val=68
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_DST_OUT_1' val=69
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_DST_OUT_2' val=70
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_DST_OUT_3' val=71
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_SRC_OUT_0' val=76
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_SRC_OUT_1' val=77
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_SRC_OUT_2' val=78
	'DR_STE_V2_ACTION_MDFY_FLD_IPV6_SRC_OUT_3' val=79
	'DR_STE_V2_ACTION_MDFY_FLD_TCP_MISC_0' val=94
	'DR_STE_V2_ACTION_MDFY_FLD_TCP_MISC_1' val=95
	'DR_STE_V2_ACTION_MDFY_FLD_CFG_HDR_0_0' val=111
	'DR_STE_V2_ACTION_MDFY_FLD_CFG_HDR_0_1' val=112
	'DR_STE_V2_ACTION_MDFY_FLD_METADATA_2_CQE' val=123
	'DR_STE_V2_ACTION_MDFY_FLD_GNRL_PURPOSE' val=124
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_2_0' val=144
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_2_1' val=145
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_1_0' val=146
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_1_1' val=147
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_0_0' val=148
	'DR_STE_V2_ACTION_MDFY_FLD_REGISTER_0_1' val=149
[140514] ARRAY '(anon)' type_id=140440 index_type_id=13 nr_elems=113
[140515] CONST '(anon)' type_id=140514
[140516] STRUCT 'mlx5_ifc_enable_hca_in_bits' size=128 vlen=8
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'embedded_cpu_function' type_id=16161 bits_offset=512
	'reserved_at_41' type_id=2960 bits_offset=520
	'function_id' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
[140517] STRUCT 'mlx5_ifc_disable_hca_in_bits' size=128 vlen=8
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'embedded_cpu_function' type_id=16161 bits_offset=512
	'reserved_at_41' type_id=2960 bits_offset=520
	'function_id' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
[140518] STRUCT 'mlx5_ifc_dealloc_sf_in_bits' size=128 vlen=7
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=474 bits_offset=512
	'function_id' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
[140519] STRUCT 'mlx5_ifc_alloc_sf_in_bits' size=128 vlen=7
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=474 bits_offset=512
	'function_id' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
[140520] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=21
[140521] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_SHARED_RESOURCE_UID' val=65535
[140522] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=29
[140523] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1984
[140524] STRUCT 'mlx5_ifc_macsec_cap_bits' size=2048 vlen=13
	'macsec_epn' type_id=16161 bits_offset=0
	'reserved_at_1' type_id=2689 bits_offset=8
	'macsec_crypto_esp_aes_gcm_256_encrypt' type_id=16161 bits_offset=24
	'macsec_crypto_esp_aes_gcm_128_encrypt' type_id=16161 bits_offset=32
	'macsec_crypto_esp_aes_gcm_256_decrypt' type_id=16161 bits_offset=40
	'macsec_crypto_esp_aes_gcm_128_decrypt' type_id=16161 bits_offset=48
	'reserved_at_7' type_id=2120 bits_offset=56
	'log_max_macsec_offload' type_id=4325 bits_offset=88
	'reserved_at_10' type_id=474 bits_offset=128
	'min_log_macsec_full_replay_window' type_id=7469 bits_offset=256
	'max_log_macsec_full_replay_window' type_id=7469 bits_offset=320
	'reserved_at_30' type_id=474 bits_offset=384
	'reserved_at_40' type_id=140523 bits_offset=512
[140525] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_CAP_PORT_TYPE_IB' val=0
	'MLX5_CAP_PORT_TYPE_ETH' val=1
[140526] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1216
[140527] STRUCT 'mlx5_ifc_eqc_bits' size=512 vlen=26
	'status' type_id=2120 bits_offset=0
	'reserved_at_4' type_id=26266 bits_offset=32
	'ec' type_id=16161 bits_offset=104
	'oi' type_id=16161 bits_offset=112
	'reserved_at_f' type_id=4325 bits_offset=120
	'st' type_id=2120 bits_offset=160
	'reserved_at_18' type_id=7469 bits_offset=192
	'reserved_at_20' type_id=3834 bits_offset=256
	'reserved_at_40' type_id=7773 bits_offset=512
	'page_offset' type_id=4362 bits_offset=672
	'reserved_at_5a' type_id=4362 bits_offset=720
	'reserved_at_60' type_id=401 bits_offset=768
	'log_eq_size' type_id=4325 bits_offset=792
	'uar_page' type_id=9799 bits_offset=832
	'reserved_at_80' type_id=3834 bits_offset=1024
	'reserved_at_a0' type_id=7773 bits_offset=1280
	'intr' type_id=7436 bits_offset=1440
	'reserved_at_c0' type_id=401 bits_offset=1536
	'log_page_size' type_id=4325 bits_offset=1560
	'reserved_at_c8' type_id=9799 bits_offset=1600
	'reserved_at_e0' type_id=19321 bits_offset=1792
	'reserved_at_140' type_id=7469 bits_offset=2560
	'consumer_counter' type_id=9799 bits_offset=2624
	'reserved_at_160' type_id=7469 bits_offset=2816
	'producer_counter' type_id=9799 bits_offset=2880
	'reserved_at_180' type_id=13111 bits_offset=3072
[140528] STRUCT 'mlx5_ifc_destroy_eq_in_bits' size=128 vlen=7
	'opcode' type_id=474 bits_offset=0
	'reserved_at_10' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=9799 bits_offset=512
	'eq_number' type_id=7469 bits_offset=704
	'reserved_at_60' type_id=3834 bits_offset=768
[140529] STRUCT 'mlx5_ifc_create_eq_out_bits' size=128 vlen=6
	'status' type_id=7469 bits_offset=0
	'reserved_at_8' type_id=9799 bits_offset=64
	'syndrome' type_id=3834 bits_offset=256
	'reserved_at_40' type_id=9799 bits_offset=512
	'eq_number' type_id=7469 bits_offset=704
	'reserved_at_60' type_id=3834 bits_offset=768
[140530] STRUCT 'mlx5_ifc_create_eq_in_bits' size=2176 vlen=10
	'opcode' type_id=474 bits_offset=0
	'uid' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=1843 bits_offset=512
	'eq_context_entry' type_id=140527 bits_offset=1024
	'reserved_at_280' type_id=1843 bits_offset=5120
	'event_bitmask' type_id=12906 bits_offset=5632
	'reserved_at_3c0' type_id=140526 bits_offset=7680
	'pas' type_id=112 bits_offset=17408
[140531] STRUCT 'mlx5_ifc_mcam_enhanced_features_bits' size=128 vlen=22
	'reserved_at_0' type_id=23917 bits_offset=0
	'mtutc_freq_adj_units' type_id=16161 bits_offset=640
	'mtutc_time_adjustment_extended_range' type_id=16161 bits_offset=648
	'reserved_at_52' type_id=33386 bits_offset=656
	'mcia_32dwords' type_id=16161 bits_offset=744
	'out_pulse_duration_ns' type_id=16161 bits_offset=752
	'npps_period' type_id=16161 bits_offset=760
	'reserved_at_60' type_id=19155 bits_offset=768
	'reset_state' type_id=16161 bits_offset=848
	'ptpcyc2realtime_modify' type_id=16161 bits_offset=856
	'reserved_at_6c' type_id=2689 bits_offset=864
	'pci_status_and_power' type_id=16161 bits_offset=880
	'reserved_at_6f' type_id=4325 bits_offset=888
	'mark_tx_action_cnp' type_id=16161 bits_offset=928
	'mark_tx_action_cqe' type_id=16161 bits_offset=936
	'dynamic_tx_overflow' type_id=16161 bits_offset=944
	'reserved_at_77' type_id=2120 bits_offset=952
	'pcie_outbound_stalled' type_id=16161 bits_offset=984
	'tx_overflow_buffer_pkt' type_id=16161 bits_offset=992
	'mtpps_enh_out_per_adj' type_id=16161 bits_offset=1000
	'mtpps_fs' type_id=16161 bits_offset=1008
	'pcie_performance_group' type_id=16161 bits_offset=1016
[140532] STRUCT 'mlx5_ifc_mcam_access_reg_bits' size=128 vlen=18
	'reserved_at_0' type_id=139769 bits_offset=0
	'mcda' type_id=16161 bits_offset=224
	'mcc' type_id=16161 bits_offset=232
	'mcqi' type_id=16161 bits_offset=240
	'mcqs' type_id=16161 bits_offset=248
	'regs_95_to_87' type_id=26266 bits_offset=256
	'mpegc' type_id=16161 bits_offset=328
	'mtutc' type_id=16161 bits_offset=336
	'regs_84_to_68' type_id=11216 bits_offset=344
	'tracer_registers' type_id=2120 bits_offset=480
	'regs_63_to_46' type_id=63089 bits_offset=512
	'mrtc' type_id=16161 bits_offset=656
	'regs_44_to_41' type_id=2120 bits_offset=664
	'mfrl' type_id=16161 bits_offset=696
	'regs_39_to_32' type_id=7469 bits_offset=704
	'regs_31_to_11' type_id=140520 bits_offset=768
	'mtmp' type_id=16161 bits_offset=936
	'regs_9_to_0' type_id=19155 bits_offset=944
[140533] STRUCT 'mlx5_ifc_mcam_access_reg_bits1' size=128 vlen=4
	'regs_127_to_96' type_id=3834 bits_offset=0
	'regs_95_to_64' type_id=3834 bits_offset=256
	'regs_63_to_32' type_id=3834 bits_offset=512
	'regs_31_to_0' type_id=3834 bits_offset=768
[140534] STRUCT 'mlx5_ifc_mcam_access_reg_bits2' size=128 vlen=8
	'regs_127_to_99' type_id=140522 bits_offset=0
	'mirc' type_id=16161 bits_offset=232
	'regs_97_to_96' type_id=2689 bits_offset=240
	'regs_95_to_87' type_id=26266 bits_offset=256
	'synce_registers' type_id=2689 bits_offset=328
	'regs_84_to_64' type_id=140520 bits_offset=344
	'regs_63_to_32' type_id=3834 bits_offset=512
	'regs_31_to_0' type_id=3834 bits_offset=768
[140535] UNION '(anon)' size=128 vlen=4
	'access_regs' type_id=140532 bits_offset=0
	'access_regs1' type_id=140533 bits_offset=0
	'access_regs2' type_id=140534 bits_offset=0
	'reserved_at_0' type_id=13111 bits_offset=0
[140536] UNION '(anon)' size=128 vlen=2
	'enhanced_features' type_id=140531 bits_offset=0
	'reserved_at_0' type_id=13111 bits_offset=0
[140537] STRUCT 'mlx5_ifc_mcam_reg_bits' size=576 vlen=9
	'reserved_at_0' type_id=7469 bits_offset=0
	'feature_group' type_id=7469 bits_offset=64
	'reserved_at_10' type_id=7469 bits_offset=128
	'access_reg_group' type_id=7469 bits_offset=192
	'reserved_at_20' type_id=3834 bits_offset=256
	'mng_access_reg_cap_mask' type_id=140535 bits_offset=512
	'reserved_at_c0' type_id=13111 bits_offset=1536
	'mng_feature_cap_mask' type_id=140536 bits_offset=2560
	'reserved_at_1c0' type_id=13111 bits_offset=3584
[140538] STRUCT 'mlx5_eq_param' size=48 vlen=3
	'nent' type_id=13 bits_offset=0
	'mask' type_id=3269 bits_offset=64
	'irq' type_id=140539 bits_offset=320
[140539] PTR '(anon)' type_id=143200
[140540] CONST '(anon)' type_id=139672
[140541] STRUCT 'mlx5_eq_table' size=5736 vlen=15
	'comp_eqs' type_id=660 bits_offset=0
	'pages_eq' type_id=140550 bits_offset=128
	'cmd_eq' type_id=140550 bits_offset=1344
	'async_eq' type_id=140550 bits_offset=2560
	'nh' type_id=140564 bits_offset=3776
	'cq_err_nb' type_id=139666 bits_offset=36544
	'lock' type_id=155 bits_offset=36800
	'comp_lock' type_id=155 bits_offset=37056
	'curr_comp_eqs' type_id=13 bits_offset=37312
	'max_comp_eqs' type_id=13 bits_offset=37344
	'irq_table' type_id=139712 bits_offset=37376
	'comp_irqs' type_id=660 bits_offset=37440
	'ctrl_irq' type_id=140539 bits_offset=37568
	'rmap' type_id=8126 bits_offset=37632
	'used_cpus' type_id=88 bits_offset=37696
[140542] STRUCT 'mlx5_fpga_device' size=104 vlen=8
	'mdev' type_id=139673 bits_offset=0
	'fpga_err_nb' type_id=139666 bits_offset=64
	'fpga_qp_err_nb' type_id=139666 bits_offset=320
	'state_lock' type_id=154 bits_offset=576
	'state' type_id=140552 bits_offset=608
	'last_admin_image' type_id=140551 bits_offset=640
	'last_oper_image' type_id=140551 bits_offset=672
	'conn_res' type_id=140553 bits_offset=704
[140543] STRUCT 'mlx5_fw_tracer' size=2229208 vlen=17
	'dev' type_id=139673 bits_offset=0
	'nb' type_id=139666 bits_offset=64
	'owner' type_id=42 bits_offset=320
	'trc_ver' type_id=19 bits_offset=328
	'work_queue' type_id=542 bits_offset=384
	'ownership_change_work' type_id=540 bits_offset=448
	'read_fw_strings_work' type_id=540 bits_offset=704
	'str_db' type_id=140555 bits_offset=960
	'buff' type_id=140556 bits_offset=2112
	'st_arr' type_id=140557 bits_offset=2432
	'last_timestamp' type_id=23 bits_offset=17828544
	'handle_traces_work' type_id=540 bits_offset=17828608
	'hash' type_id=10555 bits_offset=17828864
	'ready_strings_list' type_id=54 bits_offset=17832960
	'update_db_work' type_id=540 bits_offset=17833088
	'state_lock' type_id=155 bits_offset=17833344
	'state' type_id=1 bits_offset=17833600
[140544] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_COMP_EQ_SIZE' val=1024
[140545] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'CMD_ALLOWED_OPCODE_ALL' val=0
[140546] STRUCT 'mlx5_eq_comp' size=240 vlen=4
	'core' type_id=140549 bits_offset=0
	'irq_nb' type_id=1865 bits_offset=960
	'tasklet_ctx' type_id=140547 bits_offset=1152
	'list' type_id=54 bits_offset=1792
[140547] STRUCT 'mlx5_eq_tasklet' size=80 vlen=4
	'list' type_id=54 bits_offset=0
	'process_list' type_id=54 bits_offset=128
	'task' type_id=5434 bits_offset=256
	'lock' type_id=154 bits_offset=576
[140548] STRUCT 'mlx5_cq_table' size=24 vlen=2
	'lock' type_id=154 bits_offset=0
	'tree' type_id=660 bits_offset=64
[140549] STRUCT 'mlx5_eq' size=120 vlen=11
	'fbc' type_id=139820 bits_offset=0
	'frag_buf' type_id=139818 bits_offset=192
	'dev' type_id=139673 bits_offset=384
	'cq_table' type_id=140548 bits_offset=448
	'doorbell' type_id=8515 bits_offset=640
	'cons_index' type_id=21 bits_offset=704
	'vecidx' type_id=6 bits_offset=736
	'irqn' type_id=6 bits_offset=768
	'eqn' type_id=19 bits_offset=800
	'dbg' type_id=139841 bits_offset=832
	'irq' type_id=140539 bits_offset=896
[140550] STRUCT 'mlx5_eq_async' size=152 vlen=3
	'core' type_id=140549 bits_offset=0
	'irq_nb' type_id=1865 bits_offset=960
	'lock' type_id=154 bits_offset=1152
[140551] ENUM 'mlx5_fpga_image' encoding=UNSIGNED size=4 vlen=2
	'MLX5_FPGA_IMAGE_USER' val=0
	'MLX5_FPGA_IMAGE_FACTORY' val=1
[140552] ENUM 'mlx5_fpga_status' encoding=UNSIGNED size=4 vlen=4
	'MLX5_FPGA_STATUS_SUCCESS' val=0
	'MLX5_FPGA_STATUS_FAILURE' val=1
	'MLX5_FPGA_STATUS_IN_PROGRESS' val=2
	'MLX5_FPGA_STATUS_NONE' val=65535
[140553] STRUCT '(anon)' size=16 vlen=3
	'pdn' type_id=21 bits_offset=0
	'mkey' type_id=21 bits_offset=32
	'uar' type_id=139693 bits_offset=64
[140554] STRUCT 'mlx5_fw_trace_data' size=272 vlen=4
	'timestamp' type_id=23 bits_offset=0
	'lost' type_id=42 bits_offset=64
	'event_id' type_id=19 bits_offset=72
	'msg' type_id=3147 bits_offset=80
[140555] STRUCT '(anon)' size=144 vlen=7
	'first_string_trace' type_id=19 bits_offset=0
	'num_string_trace' type_id=19 bits_offset=8
	'num_string_db' type_id=21 bits_offset=32
	'base_address_out' type_id=3726 bits_offset=64
	'size_out' type_id=3726 bits_offset=320
	'buffer' type_id=14014 bits_offset=576
	'loaded' type_id=42 bits_offset=1088
[140556] STRUCT '(anon)' size=40 vlen=6
	'pdn' type_id=21 bits_offset=0
	'log_buf' type_id=64 bits_offset=64
	'dma' type_id=3718 bits_offset=128
	'size' type_id=21 bits_offset=192
	'mkey' type_id=21 bits_offset=224
	'consumer_index' type_id=21 bits_offset=256
[140557] STRUCT '(anon)' size=2228264 vlen=3
	'straces' type_id=140558 bits_offset=0
	'saved_traces_index' type_id=21 bits_offset=17825792
	'lock' type_id=155 bits_offset=17825856
[140558] ARRAY '(anon)' type_id=140554 index_type_id=13 nr_elems=8192
[140559] STRUCT 'mlx5_irq_pool' size=112 vlen=8
	'name' type_id=8427 bits_offset=0
	'xa_num_irqs' type_id=14086 bits_offset=224
	'lock' type_id=155 bits_offset=320
	'irqs' type_id=660 bits_offset=576
	'max_threshold' type_id=21 bits_offset=704
	'min_threshold' type_id=21 bits_offset=736
	'irqs_per_cpu' type_id=5292 bits_offset=768
	'dev' type_id=139673 bits_offset=832
[140560] ENUM 'mlx5_ipsec_cap' encoding=UNSIGNED size=4 vlen=7
	'MLX5_IPSEC_CAP_CRYPTO' val=1
	'MLX5_IPSEC_CAP_ESN' val=2
	'MLX5_IPSEC_CAP_PACKET_OFFLOAD' val=4
	'MLX5_IPSEC_CAP_ROCE' val=8
	'MLX5_IPSEC_CAP_PRIO' val=16
	'MLX5_IPSEC_CAP_TUNNEL' val=32
	'MLX5_IPSEC_CAP_ESPINUDP' val=64
[140561] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_EQE_OWNER_INIT_VAL' val=1
[140562] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_EQ_DOORBEL_OFFSET' val=64
[140563] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_EQ_POLLING_BUDGET' val=128
[140564] ARRAY '(anon)' type_id=4203 index_type_id=13 nr_elems=256
[140565] ENUM 'async_eq_nb_action' encoding=UNSIGNED size=4 vlen=2
	'ASYNC_EQ_IRQ_HANDLER' val=0
	'ASYNC_EQ_RECOVER' val=1
[140566] PTR '(anon)' type_id=8126
[140567] PTR '(anon)' type_id=140559
[140568] PTR '(anon)' type_id=140549
[140569] PTR '(anon)' type_id=139818
[140570] PTR '(anon)' type_id=139666
[140571] PTR '(anon)' type_id=140538
[140572] PTR '(anon)' type_id=140550
[140573] PTR '(anon)' type_id=140548
[140574] PTR '(anon)' type_id=139711
[140575] PTR '(anon)' type_id=140540
[140576] PTR '(anon)' type_id=139820
[140577] STRUCT 'mlx5_devcom_dev' size=32 vlen=3
	'list' type_id=54 bits_offset=0
	'dev' type_id=139673 bits_offset=128
	'ref' type_id=525 bits_offset=192
[140578] STRUCT 'mlx5_devcom_comp_dev' size=40 vlen=4
	'list' type_id=54 bits_offset=0
	'comp' type_id=140582 bits_offset=128
	'devc' type_id=139722 bits_offset=192
	'data' type_id=64 bits_offset=256
[140579] ENUM 'mlx5_devcom_component' encoding=UNSIGNED size=4 vlen=4
	'MLX5_DEVCOM_ESW_OFFLOADS' val=0
	'MLX5_DEVCOM_MPV' val=1
	'MLX5_DEVCOM_HCA_PORTS' val=2
	'MLX5_DEVCOM_NUM_COMPONENTS' val=3
[140580] TYPEDEF 'mlx5_devcom_event_handler_t' type_id=10415
[140581] STRUCT 'mlx5_devcom_comp' size=104 vlen=9
	'comp_list' type_id=54 bits_offset=0
	'id' type_id=140579 bits_offset=128
	'key' type_id=23 bits_offset=192
	'comp_dev_list_head' type_id=54 bits_offset=256
	'handler' type_id=140580 bits_offset=384
	'ref' type_id=525 bits_offset=448
	'ready' type_id=42 bits_offset=480
	'sem' type_id=531 bits_offset=512
	'lock_key' type_id=405 bits_offset=832
[140582] PTR '(anon)' type_id=140581
[140583] STRUCT 'mlx5e_rqt' size=16 vlen=3
	'mdev' type_id=139673 bits_offset=0
	'rqtn' type_id=21 bits_offset=64
	'size' type_id=20 bits_offset=96
[140584] STRUCT 'mlx5e_rss_params_hash' size=41 vlen=2
	'hfunc' type_id=19 bits_offset=0
	'toeplitz_hash_key' type_id=89139 bits_offset=8
[140585] STRUCT 'mlx5e_tir' size=32 vlen=3
	'mdev' type_id=139673 bits_offset=0
	'tirn' type_id=21 bits_offset=64
	'list' type_id=54 bits_offset=128
[140586] ENUM 'mlx5e_rss_init_type' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_RSS_INIT_NO_TIRS' val=0
	'MLX5E_RSS_INIT_TIRS' val=1
[140587] ENUM 'mlx5e_rx_res_features' encoding=UNSIGNED size=4 vlen=2
	'MLX5E_RX_RES_FEATURE_INNER_FT' val=1
	'MLX5E_RX_RES_FEATURE_PTP' val=2
[140588] CONST '(anon)' type_id=139908
[140589] STRUCT 'mlx5e_rx_res' size=280 vlen=12
	'mdev' type_id=139673 bits_offset=0
	'features' type_id=140587 bits_offset=64
	'max_nch' type_id=6 bits_offset=96
	'drop_rqn' type_id=21 bits_offset=128
	'pkt_merge_param' type_id=139908 bits_offset=160
	'pkt_merge_param_sem' type_id=531 bits_offset=256
	'rss' type_id=140592 bits_offset=576
	'rss_active' type_id=42 bits_offset=1600
	'rss_rqns' type_id=96 bits_offset=1664
	'rss_nch' type_id=6 bits_offset=1728
	'channels' type_id=140594 bits_offset=1792
	'ptp' type_id=140591 bits_offset=1856
[140590] STRUCT '(anon)' size=48 vlen=2
	'direct_rqt' type_id=140583 bits_offset=0
	'direct_tir' type_id=140585 bits_offset=128
[140591] STRUCT '(anon)' size=48 vlen=2
	'rqt' type_id=140583 bits_offset=0
	'tir' type_id=140585 bits_offset=128
[140592] ARRAY '(anon)' type_id=140593 index_type_id=13 nr_elems=16
[140593] PTR '(anon)' type_id=141287
[140594] PTR '(anon)' type_id=140590
[140595] PTR '(anon)' type_id=146476
[140596] PTR '(anon)' type_id=140585
[140597] PTR '(anon)' type_id=139908
[140598] PTR '(anon)' type_id=140583
[140599] PTR '(anon)' type_id=140588
[140600] STRUCT 'mlx5_ifc_arm_monitor_counter_in_bits' size=128 vlen=6
	'opcode' type_id=474 bits_offset=0
	'uid' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=3834 bits_offset=512
	'reserved_at_60' type_id=3834 bits_offset=768
[140601] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=2
	'MLX5_QUERY_MONITOR_CNT_TYPE_PPCNT' val=0
	'MLX5_QUERY_MONITOR_CNT_TYPE_Q_COUNTER' val=1
[140602] ENUM 'mlx5_monitor_counter_ppcnt' encoding=UNSIGNED size=4 vlen=6
	'MLX5_QUERY_MONITOR_PPCNT_IN_RANGE_LENGTH_ERRORS' val=0
	'MLX5_QUERY_MONITOR_PPCNT_OUT_OF_RANGE_LENGTH_FIELD' val=1
	'MLX5_QUERY_MONITOR_PPCNT_FRAME_TOO_LONG_ERRORS' val=2
	'MLX5_QUERY_MONITOR_PPCNT_FRAME_CHECK_SEQUENCE_ERRORS' val=3
	'MLX5_QUERY_MONITOR_PPCNT_ALIGNMENT_ERRORS' val=4
	'MLX5_QUERY_MONITOR_PPCNT_IF_OUT_DISCARDS' val=5
[140603] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_QUERY_MONITOR_Q_COUNTER_RX_OUT_OF_BUFFER' val=4
[140604] STRUCT 'mlx5_ifc_monitor_counter_output_bits' size=64 vlen=5
	'reserved_at_0' type_id=2120 bits_offset=0
	'type' type_id=2120 bits_offset=32
	'reserved_at_8' type_id=7469 bits_offset=64
	'counter' type_id=474 bits_offset=128
	'counter_group_id' type_id=3834 bits_offset=256
[140605] STRUCT 'mlx5_ifc_set_monitor_counter_in_bits' size=576 vlen=8
	'opcode' type_id=474 bits_offset=0
	'uid' type_id=474 bits_offset=128
	'reserved_at_20' type_id=474 bits_offset=256
	'op_mod' type_id=474 bits_offset=384
	'reserved_at_40' type_id=474 bits_offset=512
	'num_of_counters' type_id=474 bits_offset=640
	'reserved_at_60' type_id=3834 bits_offset=768
	'monitor_counter' type_id=140606 bits_offset=1024
[140606] ARRAY '(anon)' type_id=140604 index_type_id=13 nr_elems=7
[140607] STRUCT 'mlx5_ifc_pcam_enhanced_features_bits' size=128 vlen=15
	'reserved_at_0' type_id=56551 bits_offset=0
	'fec_50G_per_lane_in_pplm' type_id=16161 bits_offset=832
	'reserved_at_69' type_id=2120 bits_offset=840
	'rx_icrc_encapsulated_counter' type_id=16161 bits_offset=872
	'reserved_at_6e' type_id=2120 bits_offset=880
	'ptys_extended_ethernet' type_id=16161 bits_offset=912
	'reserved_at_73' type_id=401 bits_offset=920
	'pfcc_mask' type_id=16161 bits_offset=944
	'reserved_at_77' type_id=401 bits_offset=952
	'per_lane_error_counters' type_id=16161 bits_offset=976
	'rx_buffer_fullness_counters' type_id=16161 bits_offset=984
	'ptys_connector_type' type_id=16161 bits_offset=992
	'reserved_at_7d' type_id=16161 bits_offset=1000
	'ppcnt_discard_group' type_id=16161 bits_offset=1008
	'ppcnt_statistical_group' type_id=16161 bits_offset=1016
[140608] STRUCT 'mlx5_ifc_pcam_regs_5000_to_507f_bits' size=128 vlen=11
	'port_access_reg_cap_mask_127_to_96' type_id=3834 bits_offset=0
	'port_access_reg_cap_mask_95_to_64' type_id=3834 bits_offset=256
	'port_access_reg_cap_mask_63_to_36' type_id=139769 bits_offset=512
	'pplm' type_id=16161 bits_offset=736
	'port_access_reg_cap_mask_34_to_32' type_id=401 bits_offset=744
	'port_access_reg_cap_mask_31_to_13' type_id=63723 bits_offset=768
	'pbmc' type_id=16161 bits_offset=920
	'pptb' type_id=16161 bits_offset=928
	'port_access_reg_cap_mask_10_to_09' type_id=2689 bits_offset=936
	'ppcnt' type_id=16161 bits_offset=952
	'port_access_reg_cap_mask_07_to_00' type_id=7469 bits_offset=960
[140609] UNION '(anon)' size=128 vlen=2
	'regs_5000_to_507f' type_id=140608 bits_offset=0
	'reserved_at_0' type_id=13111 bits_offset=0
[140610] UNION '(anon)' size=128 vlen=2
	'enhanced_features' type_id=140607 bits_offset=0
	'reserved_at_0' type_id=13111 bits_offset=0
[140611] STRUCT 'mlx5_ifc_pcam_reg_bits' size=640 vlen=9
	'reserved_at_0' type_id=7469 bits_offset=0
	'feature_group' type_id=7469 bits_offset=64
	'reserved_at_10' type_id=7469 bits_offset=128
	'access_reg_group' type_id=7469 bits_offset=192
	'reserved_at_20' type_id=3834 bits_offset=256
	'port_access_reg_cap_mask' type_id=140609 bits_offset=512
	'reserved_at_c0' type_id=13111 bits_offset=1536
	'feature_cap_mask' type_id=140610 bits_offset=2560
	'reserved_at_1c0' type_id=26434 bits_offset=3584
[140612] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=5
	'MLX5_HASH_FIELD_SEL_SRC_IP' val=1
	'MLX5_HASH_FIELD_SEL_DST_IP' val=2
	'MLX5_HASH_FIELD_SEL_L4_SPORT' val=4
	'MLX5_HASH_FIELD_SEL_L4_DPORT' val=8
	'MLX5_HASH_FIELD_SEL_IPSEC_SPI' val=16
[140613] STRUCT 'mlx5e_ethtool_table' size=16 vlen=2
	'ft' type_id=139705 bits_offset=0
	'num_rules' type_id=13 bits_offset=64
[140614] STRUCT 'mlx5e_ethtool_steering' size=200 vlen=4
	'l3_l4_ft' type_id=140615 bits_offset=0
	'l2_ft' type_id=140616 bits_offset=896
	'rules' type_id=54 bits_offset=1408
	'tot_num_rules' type_id=13 bits_offset=1536
[140615] ARRAY '(anon)' type_id=140613 index_type_id=13 nr_elems=7
[140616] ARRAY '(anon)' type_id=140613 index_type_id=13 nr_elems=4
[140617] STRUCT 'mlx5e_ethtool_rule' size=208 vlen=5
	'list' type_id=54 bits_offset=0
	'flow_spec' type_id=12098 bits_offset=128
	'rule' type_id=139707 bits_offset=1472
	'eth_ft' type_id=140618 bits_offset=1536
	'rss' type_id=140593 bits_offset=1600
[140618] PTR '(anon)' type_id=140613
[140619] PTR '(anon)' type_id=140614
[140620] PTR '(anon)' type_id=140617
[140621] PTR '(anon)' type_id=140619
[140622] PTR '(anon)' type_id=12098
[140623] PTR '(anon)' type_id=12091
[140624] PTR '(anon)' type_id=12093
[140625] PTR '(anon)' type_id=12090
[140626] PTR '(anon)' type_id=12088
[140627] STRUCT 'mlx5_esw_indir_table' size=2080 vlen=2
	'lock' type_id=155 bits_offset=0
	'table' type_id=7038 bits_offset=256
[140628] ENUM 'mlx5e_tc_attr_to_reg' encoding=UNSIGNED size=4 vlen=12
	'MAPPED_OBJ_TO_REG' val=0
	'VPORT_TO_REG' val=1
	'TUNNEL_TO_REG' val=2
	'CTSTATE_TO_REG' val=3
	'ZONE_TO_REG' val=4
	'ZONE_RESTORE_TO_REG' val=5
	'MARK_TO_REG' val=6
	'LABELS_TO_REG' val=7
	'FTEID_TO_REG' val=8
	'NIC_MAPPED_OBJ_TO_REG' val=9
	'NIC_ZONE_RESTORE_TO_REG' val=10
	'PACKET_COLOR_TO_REG' val=11
[140629] STRUCT 'mlx5_esw_indir_table_rule' size=24 vlen=3
	'handle' type_id=139707 bits_offset=0
	'mh' type_id=140080 bits_offset=64
	'refcnt' type_id=178 bits_offset=128
[140630] STRUCT 'mlx5_esw_indir_table_entry' size=64 vlen=8
	'hlist' type_id=57 bits_offset=0
	'ft' type_id=139705 bits_offset=128
	'recirc_grp' type_id=139706 bits_offset=192
	'fwd_grp' type_id=139706 bits_offset=256
	'fwd_rule' type_id=139707 bits_offset=320
	'recirc_rule' type_id=140631 bits_offset=384
	'fwd_ref' type_id=13 bits_offset=448
	'vport' type_id=20 bits_offset=480
[140631] PTR '(anon)' type_id=140629
[140632] PTR '(anon)' type_id=140223
[140633] PTR '(anon)' type_id=140630
[140634] STRUCT 'file_system_type' size=72 vlen=17
	'name' type_id=2 bits_offset=0
	'fs_flags' type_id=13 bits_offset=64
	'init_fs_context' type_id=1364 bits_offset=128
	'parameters' type_id=1366 bits_offset=192
	'mount' type_id=140637 bits_offset=256
	'kill_sb' type_id=1341 bits_offset=320
	'owner' type_id=448 bits_offset=384
	'next' type_id=140635 bits_offset=448
	'fs_supers' type_id=56 bits_offset=512
	's_lock_key' type_id=405 bits_offset=576
	's_umount_key' type_id=405 bits_offset=576
	's_vfs_rename_key' type_id=405 bits_offset=576
	's_writers_key' type_id=1369 bits_offset=576
	'i_lock_key' type_id=405 bits_offset=576
	'i_mutex_key' type_id=405 bits_offset=576
	'invalidate_lock_key' type_id=405 bits_offset=576
	'i_mutex_dir_key' type_id=405 bits_offset=576
[140635] PTR '(anon)' type_id=140634
[140636] FUNC_PROTO '(anon)' ret_type_id=912 vlen=4
	'(anon)' type_id=140635
	'(anon)' type_id=13
	'(anon)' type_id=2
	'(anon)' type_id=64
[140637] PTR '(anon)' type_id=140636
[140638] ENUM 'macvlan_mode' encoding=UNSIGNED size=4 vlen=5
	'MACVLAN_MODE_PRIVATE' val=1
	'MACVLAN_MODE_VEPA' val=2
	'MACVLAN_MODE_BRIDGE' val=4
	'MACVLAN_MODE_PASSTHRU' val=8
	'MACVLAN_MODE_SOURCE' val=16
[140639] STRUCT 'nf_conntrack_helper' size=160 vlen=15
	'hnode' type_id=57 bits_offset=0
	'name' type_id=122 bits_offset=128
	'refcnt' type_id=178 bits_offset=256
	'me' type_id=448 bits_offset=320
	'expect_policy' type_id=140643 bits_offset=384
	'tuple' type_id=62899 bits_offset=448
	'help' type_id=140645 bits_offset=768
	'destroy' type_id=32834 bits_offset=832
	'from_nlattr' type_id=140647 bits_offset=896
	'to_nlattr' type_id=140649 bits_offset=960
	'expect_class_max' type_id=6 bits_offset=1024
	'flags' type_id=6 bits_offset=1056
	'queue_num' type_id=6 bits_offset=1088
	'data_len' type_id=20 bits_offset=1120
	'nat_mod_name' type_id=122 bits_offset=1136
[140640] PTR '(anon)' type_id=140639
[140641] STRUCT 'nf_conntrack_expect_policy' size=24 vlen=3
	'max_expected' type_id=6 bits_offset=0
	'timeout' type_id=6 bits_offset=32
	'name' type_id=122 bits_offset=64
[140642] CONST '(anon)' type_id=140641
[140643] PTR '(anon)' type_id=140642
[140644] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=1896
	'(anon)' type_id=6
	'(anon)' type_id=32825
	'(anon)' type_id=32816
[140645] PTR '(anon)' type_id=140644
[140646] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'(anon)' type_id=7962
	'(anon)' type_id=32825
[140647] PTR '(anon)' type_id=140646
[140648] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'(anon)' type_id=1896
	'(anon)' type_id=32853
[140649] PTR '(anon)' type_id=140648
[140650] STRUCT '(anon)' size=16 vlen=3
	'action' type_id=13 bits_offset=0
	'zone' type_id=20 bits_offset=32
	'flow_table' type_id=140141 bits_offset=64
[140651] STRUCT 'nf_flowtable' size=320 vlen=9
	'flags' type_id=6 bits_offset=0
	'priority' type_id=13 bits_offset=32
	'rhashtable' type_id=1883 bits_offset=64
	'list' type_id=54 bits_offset=1152
	'type' type_id=140674 bits_offset=1280
	'gc_work' type_id=541 bits_offset=1344
	'flow_block' type_id=8192 bits_offset=2048
	'flow_block_lock' type_id=531 bits_offset=2176
	'net' type_id=7684 bits_offset=2496
[140652] UNION '(anon)' size=32 vlen=2
	'enc_ipv4' type_id=20537 bits_offset=0
	'enc_ipv6' type_id=20538 bits_offset=0
[140653] STRUCT 'nf_flow_key' size=120 vlen=11
	'meta' type_id=62842 bits_offset=0
	'control' type_id=20416 bits_offset=64
	'enc_control' type_id=20416 bits_offset=128
	'basic' type_id=20417 bits_offset=192
	'vlan' type_id=20536 bits_offset=224
	'cvlan' type_id=20536 bits_offset=288
	'(anon)' type_id=23721 bits_offset=352
	'enc_key_id' type_id=24010 bits_offset=608
	'(anon)' type_id=140652 bits_offset=640
	'tcp' type_id=20544 bits_offset=896
	'tp' type_id=20542 bits_offset=928
[140654] STRUCT 'nf_flow_match' size=320 vlen=3
	'dissector' type_id=20418 bits_offset=0
	'key' type_id=140653 bits_offset=640
	'mask' type_id=140653 bits_offset=1600
[140655] STRUCT 'nf_flow_rule' size=328 vlen=2
	'match' type_id=140654 bits_offset=0
	'rule' type_id=20598 bits_offset=2560
[140656] STRUCT 'nf_flowtable_type' size=96 vlen=11
	'list' type_id=54 bits_offset=0
	'family' type_id=13 bits_offset=128
	'init' type_id=140659 bits_offset=192
	'gc' type_id=140664 bits_offset=256
	'setup' type_id=140666 bits_offset=320
	'action' type_id=140671 bits_offset=384
	'free' type_id=140673 bits_offset=448
	'get' type_id=140673 bits_offset=512
	'put' type_id=140673 bits_offset=576
	'hook' type_id=20197 bits_offset=640
	'owner' type_id=448 bits_offset=704
[140657] CONST '(anon)' type_id=140656
[140658] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'(anon)' type_id=140141
[140659] PTR '(anon)' type_id=140658
[140660] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'(anon)' type_id=140661
[140661] PTR '(anon)' type_id=140663
[140662] STRUCT 'flow_offload' size=216 vlen=6
	'tuplehash' type_id=140684 bits_offset=0
	'ct' type_id=32825 bits_offset=1408
	'flags' type_id=1 bits_offset=1472
	'type' type_id=20 bits_offset=1536
	'timeout' type_id=21 bits_offset=1568
	'callback_head' type_id=60 bits_offset=1600
[140663] CONST '(anon)' type_id=140662
[140664] PTR '(anon)' type_id=140660
[140665] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'(anon)' type_id=140141
	'(anon)' type_id=1996
	'(anon)' type_id=32654
[140666] PTR '(anon)' type_id=140665
[140667] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=321
	'(anon)' type_id=140668
	'(anon)' type_id=140669
	'(anon)' type_id=140670
[140668] PTR '(anon)' type_id=140662
[140669] ENUM 'flow_offload_tuple_dir' encoding=UNSIGNED size=4 vlen=2
	'FLOW_OFFLOAD_DIR_ORIGINAL' val=0
	'FLOW_OFFLOAD_DIR_REPLY' val=1
[140670] PTR '(anon)' type_id=140655
[140671] PTR '(anon)' type_id=140667
[140672] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=140141
[140673] PTR '(anon)' type_id=140672
[140674] PTR '(anon)' type_id=140657
[140675] UNION '(anon)' size=16 vlen=2
	'src_v4' type_id=12639 bits_offset=0
	'src_v6' type_id=1904 bits_offset=0
[140676] UNION '(anon)' size=16 vlen=2
	'dst_v4' type_id=12639 bits_offset=0
	'dst_v6' type_id=1904 bits_offset=0
[140677] STRUCT '(anon)' size=4 vlen=2
	'src_port' type_id=1850 bits_offset=0
	'dst_port' type_id=1850 bits_offset=16
[140678] STRUCT '(anon)' size=16 vlen=2
	'dst_cache' type_id=1986 bits_offset=0
	'dst_cookie' type_id=21 bits_offset=64
[140679] STRUCT '(anon)' size=20 vlen=4
	'ifidx' type_id=21 bits_offset=0
	'hw_ifidx' type_id=21 bits_offset=32
	'h_source' type_id=4362 bits_offset=64
	'h_dest' type_id=4362 bits_offset=112
[140680] STRUCT '(anon)' size=4 vlen=1
	'iifidx' type_id=21 bits_offset=0
[140681] UNION '(anon)' size=24 vlen=3
	'(anon)' type_id=140678 bits_offset=0
	'out' type_id=140679 bits_offset=0
	'tc' type_id=140680 bits_offset=0
[140682] STRUCT 'flow_offload_tuple' size=80 vlen=14
	'(anon)' type_id=140675 bits_offset=0
	'(anon)' type_id=140676 bits_offset=128
	'(anon)' type_id=140677 bits_offset=256
	'iifidx' type_id=13 bits_offset=288
	'l3proto' type_id=19 bits_offset=320
	'l4proto' type_id=19 bits_offset=328
	'encap' type_id=7875 bits_offset=336
	'__hash' type_id=526 bits_offset=400
	'dir' type_id=19 bits_offset=400 bitfield_size=2
	'xmit_type' type_id=19 bits_offset=402 bitfield_size=3
	'encap_num' type_id=19 bits_offset=405 bitfield_size=2
	'in_vlan_ingress' type_id=19 bits_offset=408 bitfield_size=2
	'mtu' type_id=20 bits_offset=416
	'(anon)' type_id=140681 bits_offset=448
[140683] STRUCT 'flow_offload_tuple_rhash' size=88 vlen=2
	'node' type_id=876 bits_offset=0
	'tuple' type_id=140682 bits_offset=64
[140684] ARRAY '(anon)' type_id=140683 index_type_id=13 nr_elems=2
[140685] STRUCT 'macvlan_dev' size=136 vlen=15
	'dev' type_id=1996 bits_offset=0
	'list' type_id=54 bits_offset=64
	'hlist' type_id=57 bits_offset=192
	'port' type_id=140687 bits_offset=320
	'lowerdev' type_id=1996 bits_offset=384
	'dev_tracker' type_id=7682 bits_offset=448
	'accel_priv' type_id=64 bits_offset=448
	'pcpu_stats' type_id=94891 bits_offset=512
	'mc_filter' type_id=547 bits_offset=576
	'set_features' type_id=7675 bits_offset=832
	'mode' type_id=140638 bits_offset=896
	'flags' type_id=20 bits_offset=928
	'macaddr_count' type_id=6 bits_offset=960
	'bc_queue_len_req' type_id=21 bits_offset=992
	'netpoll' type_id=22806 bits_offset=1024
[140686] FWD 'macvlan_port' fwd_kind=struct
[140687] PTR '(anon)' type_id=140686
[140688] STRUCT 'mlx5_ifc_set_action_in_bits' size=64 vlen=7
	'action_type' type_id=2120 bits_offset=0
	'field' type_id=7436 bits_offset=32
	'reserved_at_10' type_id=401 bits_offset=128
	'offset' type_id=4325 bits_offset=152
	'reserved_at_18' type_id=401 bits_offset=192
	'length' type_id=4325 bits_offset=216
	'data' type_id=3834 bits_offset=256
[140689] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_ACTION_TYPE_SET' val=1
	'MLX5_ACTION_TYPE_ADD' val=2
	'MLX5_ACTION_TYPE_COPY' val=3
[140690] STRUCT 'mlx5_ct_ft' size=272 vlen=9
	'node' type_id=876 bits_offset=0
	'zone' type_id=20 bits_offset=64
	'zone_restore_id' type_id=21 bits_offset=96
	'refcount' type_id=178 bits_offset=128
	'nf_ft' type_id=140141 bits_offset=192
	'ct_priv' type_id=140237 bits_offset=256
	'ct_entries_ht' type_id=1883 bits_offset=320
	'pre_ct' type_id=140714 bits_offset=1408
	'pre_ct_nat' type_id=140714 bits_offset=1792
[140691] STRUCT 'mlx5_ct_fs' size=16 vlen=3
	'netdev' type_id=7834 bits_offset=0
	'dev' type_id=139673 bits_offset=64
	'priv_data' type_id=3995 bits_offset=128
[140692] STRUCT 'mlx5_ct_fs_rule' size=0 vlen=0
[140693] STRUCT 'mlx5_ct_fs_ops' size=40 vlen=5
	'init' type_id=140696 bits_offset=0
	'destroy' type_id=140698 bits_offset=64
	'ct_rule_add' type_id=140701 bits_offset=128
	'ct_rule_del' type_id=140703 bits_offset=192
	'priv_size' type_id=45 bits_offset=256
[140694] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'(anon)' type_id=140695
	'(anon)' type_id=139705
	'(anon)' type_id=139705
	'(anon)' type_id=139705
[140695] PTR '(anon)' type_id=140691
[140696] PTR '(anon)' type_id=140694
[140697] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'(anon)' type_id=140695
[140698] PTR '(anon)' type_id=140697
[140699] FUNC_PROTO '(anon)' ret_type_id=140700 vlen=4
	'(anon)' type_id=140695
	'(anon)' type_id=140109
	'(anon)' type_id=140259
	'(anon)' type_id=20598
[140700] PTR '(anon)' type_id=140692
[140701] PTR '(anon)' type_id=140699
[140702] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'(anon)' type_id=140695
	'(anon)' type_id=140700
[140703] PTR '(anon)' type_id=140702
[140704] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=6
	'MAPPING_TYPE_CHAIN' val=0
	'MAPPING_TYPE_TUNNEL' val=1
	'MAPPING_TYPE_TUNNEL_ENC_OPTS' val=2
	'MAPPING_TYPE_LABELS' val=3
	'MAPPING_TYPE_ZONE' val=4
	'MAPPING_TYPE_INT_PORT' val=5
[140705] PTR '(anon)' type_id=146487
[140706] STRUCT 'mlx5_tc_ct_priv' size=592 vlen=21
	'dev' type_id=139673 bits_offset=0
	'priv' type_id=139858 bits_offset=64
	'netdev' type_id=7834 bits_offset=128
	'mod_hdr_tbl' type_id=140711 bits_offset=192
	'tuple_ids' type_id=660 bits_offset=256
	'zone_ht' type_id=1883 bits_offset=384
	'ct_tuples_ht' type_id=1883 bits_offset=1472
	'ct_tuples_nat_ht' type_id=1883 bits_offset=2560
	'ct' type_id=139705 bits_offset=3648
	'ct_nat' type_id=139705 bits_offset=3712
	'post_act' type_id=140705 bits_offset=3776
	'control_lock' type_id=155 bits_offset=3840
	'zone_mapping' type_id=140165 bits_offset=4096
	'labels_mapping' type_id=140165 bits_offset=4160
	'ns_type' type_id=140222 bits_offset=4224
	'chains' type_id=140172 bits_offset=4288
	'fs' type_id=140695 bits_offset=4352
	'fs_ops' type_id=140712 bits_offset=4416
	'ht_lock' type_id=154 bits_offset=4480
	'wq' type_id=542 bits_offset=4544
	'debugfs' type_id=140710 bits_offset=4608
[140707] STRUCT 'mlx5e_tc_attr_to_reg_mapping' size=16 vlen=4
	'mfield' type_id=13 bits_offset=0
	'moffset' type_id=13 bits_offset=32
	'mlen' type_id=13 bits_offset=64
	'soffset' type_id=13 bits_offset=96
[140708] ARRAY '(anon)' type_id=140707 index_type_id=13 nr_elems=0
[140709] STRUCT '(anon)' size=8 vlen=2
	'offloaded' type_id=51 bits_offset=0
	'rx_dropped' type_id=51 bits_offset=32
[140710] STRUCT 'mlx5_tc_ct_debugfs' size=16 vlen=2
	'stats' type_id=140709 bits_offset=0
	'root' type_id=912 bits_offset=64
[140711] PTR '(anon)' type_id=140143
[140712] PTR '(anon)' type_id=140693
[140713] STRUCT 'mlx5_ct_zone_rule' size=32 vlen=4
	'rule' type_id=140700 bits_offset=0
	'mh' type_id=140255 bits_offset=64
	'attr' type_id=140259 bits_offset=128
	'nat' type_id=42 bits_offset=192
[140714] STRUCT 'mlx5_tc_ct_pre' size=48 vlen=6
	'ft' type_id=139705 bits_offset=0
	'flow_grp' type_id=139706 bits_offset=64
	'miss_grp' type_id=139706 bits_offset=128
	'flow_rule' type_id=139707 bits_offset=192
	'miss_rule' type_id=139707 bits_offset=256
	'modify_hdr' type_id=140080 bits_offset=320
[140715] UNION '(anon)' size=16 vlen=2
	'src_v4' type_id=1851 bits_offset=0
	'src_v6' type_id=1904 bits_offset=0
[140716] UNION '(anon)' size=16 vlen=2
	'dst_v4' type_id=1851 bits_offset=0
	'dst_v6' type_id=1904 bits_offset=0
[140717] STRUCT '(anon)' size=32 vlen=2
	'(anon)' type_id=140715 bits_offset=0
	'(anon)' type_id=140716 bits_offset=128
[140718] STRUCT 'mlx5_ct_tuple' size=48 vlen=6
	'addr_type' type_id=20 bits_offset=0
	'n_proto' type_id=1850 bits_offset=16
	'ip_proto' type_id=19 bits_offset=32
	'ip' type_id=140717 bits_offset=64
	'port' type_id=20540 bits_offset=320
	'zone' type_id=20 bits_offset=352
[140719] STRUCT 'mlx5_ct_counter' size=16 vlen=3
	'counter' type_id=140229 bits_offset=0
	'refcount' type_id=178 bits_offset=64
	'is_shared' type_id=42 bits_offset=96
[140720] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5_CT_ENTRY_FLAG_VALID' val=0
[140721] STRUCT 'mlx5_ct_entry' size=264 vlen=13
	'node' type_id=876 bits_offset=0
	'tuple_node' type_id=876 bits_offset=64
	'tuple_nat_node' type_id=876 bits_offset=128
	'counter' type_id=140722 bits_offset=192
	'cookie' type_id=1 bits_offset=256
	'restore_cookie' type_id=1 bits_offset=320
	'tuple' type_id=140718 bits_offset=384
	'tuple_nat' type_id=140718 bits_offset=768
	'zone_rules' type_id=140723 bits_offset=1152
	'ct_priv' type_id=140237 bits_offset=1664
	'work' type_id=540 bits_offset=1728
	'refcnt' type_id=178 bits_offset=1984
	'flags' type_id=1 bits_offset=2048
[140722] PTR '(anon)' type_id=140719
[140723] ARRAY '(anon)' type_id=140713 index_type_id=13 nr_elems=2
[140724] PTR '(anon)' type_id=140721
[140725] PTR '(anon)' type_id=140710
[140726] PTR '(anon)' type_id=140714
[140727] PTR '(anon)' type_id=140225
[140728] PTR '(anon)' type_id=140718
[140729] PTR '(anon)' type_id=140713
[140730] PTR '(anon)' type_id=140255
[140731] PTR '(anon)' type_id=140685
[140732] PTR '(anon)' type_id=20594
[140733] STRUCT 'mlx5e_ipsec' size=376 vlen=19
	'mdev' type_id=139673 bits_offset=0
	'sadb' type_id=660 bits_offset=64
	'sw_stats' type_id=140743 bits_offset=192
	'hw_stats' type_id=140742 bits_offset=640
	'wq' type_id=542 bits_offset=1152
	'comp' type_id=508 bits_offset=1216
	'fs' type_id=140016 bits_offset=1472
	'rx_ipv4' type_id=140755 bits_offset=1536
	'rx_ipv6' type_id=140755 bits_offset=1600
	'rx_esw' type_id=140755 bits_offset=1664
	'tx' type_id=140756 bits_offset=1728
	'tx_esw' type_id=140756 bits_offset=1792
	'aso' type_id=140757 bits_offset=1856
	'nb' type_id=1865 bits_offset=1920
	'netevent_nb' type_id=1865 bits_offset=2112
	'roce' type_id=140758 bits_offset=2304
	'is_uplink_rep' type_id=19 bits_offset=2368 bitfield_size=1
	'mpv_work' type_id=140754 bits_offset=2432
	'ipsec_obj_id_map' type_id=660 bits_offset=2880
[140734] STRUCT 'aes_gcm_keymat' size=56 vlen=5
	'seq_iv' type_id=23 bits_offset=0
	'salt' type_id=21 bits_offset=64
	'icv_len' type_id=21 bits_offset=96
	'key_len' type_id=21 bits_offset=128
	'aes_key' type_id=3726 bits_offset=160
[140735] STRUCT 'upspec' size=10 vlen=5
	'dport' type_id=20 bits_offset=0
	'dport_mask' type_id=20 bits_offset=16
	'sport' type_id=20 bits_offset=32
	'sport_mask' type_id=20 bits_offset=48
	'proto' type_id=19 bits_offset=64
[140736] STRUCT 'mlx5_ipsec_lft' size=32 vlen=4
	'hard_packet_limit' type_id=23 bits_offset=0
	'soft_packet_limit' type_id=23 bits_offset=64
	'numb_rounds_hard' type_id=23 bits_offset=128
	'numb_rounds_soft' type_id=23 bits_offset=192
[140737] STRUCT 'mlx5_replay_esn' size=16 vlen=5
	'replay_window' type_id=21 bits_offset=0
	'esn' type_id=21 bits_offset=32
	'esn_msb' type_id=21 bits_offset=64
	'overlap' type_id=19 bits_offset=96 bitfield_size=1
	'trigger' type_id=19 bits_offset=97 bitfield_size=1
[140738] UNION '(anon)' size=16 vlen=2
	'a4' type_id=1851 bits_offset=0
	'a6' type_id=1903 bits_offset=0
[140739] UNION '(anon)' size=6 vlen=2
	'smac' type_id=4362 bits_offset=0
	'sport' type_id=1850 bits_offset=0
[140740] UNION '(anon)' size=6 vlen=2
	'dmac' type_id=4362 bits_offset=0
	'dport' type_id=1850 bits_offset=0
[140741] STRUCT 'mlx5_accel_esp_xfrm_attrs' size=184 vlen=17
	'spi' type_id=21 bits_offset=0
	'mode' type_id=21 bits_offset=32
	'aes_gcm' type_id=140734 bits_offset=64
	'saddr' type_id=140738 bits_offset=512
	'daddr' type_id=140738 bits_offset=640
	'upspec' type_id=140735 bits_offset=768
	'dir' type_id=19 bits_offset=848 bitfield_size=2
	'type' type_id=19 bits_offset=850 bitfield_size=2
	'drop' type_id=19 bits_offset=852 bitfield_size=1
	'encap' type_id=19 bits_offset=853 bitfield_size=1
	'family' type_id=19 bits_offset=856
	'replay_esn' type_id=140737 bits_offset=864
	'authsize' type_id=21 bits_offset=992
	'reqid' type_id=21 bits_offset=1024
	'lft' type_id=140736 bits_offset=1088
	'(anon)' type_id=140739 bits_offset=1344
	'(anon)' type_id=140740 bits_offset=1392
[140742] STRUCT 'mlx5e_ipsec_hw_stats' size=64 vlen=8
	'ipsec_rx_pkts' type_id=23 bits_offset=0
	'ipsec_rx_bytes' type_id=23 bits_offset=64
	'ipsec_rx_drop_pkts' type_id=23 bits_offset=128
	'ipsec_rx_drop_bytes' type_id=23 bits_offset=192
	'ipsec_tx_pkts' type_id=23 bits_offset=256
	'ipsec_tx_bytes' type_id=23 bits_offset=320
	'ipsec_tx_drop_pkts' type_id=23 bits_offset=384
	'ipsec_tx_drop_bytes' type_id=23 bits_offset=448
[140743] STRUCT 'mlx5e_ipsec_sw_stats' size=56 vlen=7
	'ipsec_rx_drop_sp_alloc' type_id=53 bits_offset=0
	'ipsec_rx_drop_sadb_miss' type_id=53 bits_offset=64
	'ipsec_rx_drop_syndrome' type_id=53 bits_offset=128
	'ipsec_tx_drop_bundle' type_id=53 bits_offset=192
	'ipsec_tx_drop_no_state' type_id=53 bits_offset=256
	'ipsec_tx_drop_not_ip' type_id=53 bits_offset=320
	'ipsec_tx_drop_trailer' type_id=53 bits_offset=384
[140744] STRUCT 'mlx5e_ipsec_work' size=48 vlen=3
	'work' type_id=540 bits_offset=0
	'sa_entry' type_id=140746 bits_offset=256
	'data' type_id=64 bits_offset=320
[140745] STRUCT 'mlx5e_ipsec_sa_entry' size=352 vlen=12
	'esn_state' type_id=140759 bits_offset=0
	'x' type_id=7888 bits_offset=128
	'ipsec' type_id=140025 bits_offset=192
	'attrs' type_id=140741 bits_offset=256
	'set_iv_op' type_id=140762 bits_offset=1728
	'ipsec_obj_id' type_id=21 bits_offset=1792
	'enc_key_id' type_id=21 bits_offset=1824
	'ipsec_rule' type_id=140752 bits_offset=1856
	'work' type_id=140763 bits_offset=2496
	'dwork' type_id=140764 bits_offset=2560
	'limits' type_id=140760 bits_offset=2624
	'rx_mapped_id' type_id=21 bits_offset=2752
[140746] PTR '(anon)' type_id=140745
[140747] STRUCT 'mlx5e_ipsec_dwork' size=96 vlen=2
	'dwork' type_id=541 bits_offset=0
	'sa_entry' type_id=140746 bits_offset=704
[140748] STRUCT 'mlx5e_ipsec_aso' size=128 vlen=4
	'ctx' type_id=1843 bits_offset=0
	'dma_addr' type_id=3718 bits_offset=512
	'aso' type_id=140749 bits_offset=576
	'lock' type_id=154 bits_offset=640
[140749] PTR '(anon)' type_id=145022
[140750] STRUCT 'mlx5e_ipsec_rx_create_attr' size=40 vlen=8
	'ns' type_id=140083 bits_offset=0
	'ttc' type_id=140104 bits_offset=64
	'family' type_id=21 bits_offset=128
	'prio' type_id=13 bits_offset=160
	'pol_level' type_id=13 bits_offset=192
	'sa_level' type_id=13 bits_offset=224
	'status_level' type_id=13 bits_offset=256
	'chains_ns' type_id=140222 bits_offset=288
[140751] STRUCT 'mlx5e_ipsec_drop' size=16 vlen=2
	'rule' type_id=139707 bits_offset=0
	'fc' type_id=140229 bits_offset=64
[140752] STRUCT 'mlx5e_ipsec_rule' size=80 vlen=7
	'rule' type_id=139707 bits_offset=0
	'modify_hdr' type_id=140080 bits_offset=64
	'pkt_reformat' type_id=140068 bits_offset=128
	'fc' type_id=140229 bits_offset=192
	'replay' type_id=140751 bits_offset=256
	'auth' type_id=140751 bits_offset=384
	'trailer' type_id=140751 bits_offset=512
[140753] STRUCT 'mlx5e_ipsec_tx_create_attr' size=20 vlen=5
	'prio' type_id=13 bits_offset=0
	'pol_level' type_id=13 bits_offset=32
	'sa_level' type_id=13 bits_offset=64
	'cnt_level' type_id=13 bits_offset=96
	'chains_ns' type_id=140222 bits_offset=128
[140754] STRUCT 'mlx5e_ipsec_mpv_work' size=56 vlen=4
	'event' type_id=13 bits_offset=0
	'work' type_id=540 bits_offset=64
	'slave_priv' type_id=139858 bits_offset=320
	'master_priv' type_id=139858 bits_offset=384
[140755] PTR '(anon)' type_id=146110
[140756] PTR '(anon)' type_id=146111
[140757] PTR '(anon)' type_id=140748
[140758] PTR '(anon)' type_id=142773
[140759] STRUCT 'mlx5e_ipsec_esn_state' size=12 vlen=3
	'esn' type_id=21 bits_offset=0
	'esn_msb' type_id=21 bits_offset=32
	'overlap' type_id=19 bits_offset=64 bitfield_size=1
[140760] STRUCT 'mlx5e_ipsec_limits' size=16 vlen=3
	'round' type_id=23 bits_offset=0
	'soft_limit_hit' type_id=19 bits_offset=64 bitfield_size=1
	'fix_limit' type_id=19 bits_offset=65 bitfield_size=1
[140761] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'(anon)' type_id=1896
	'(anon)' type_id=7888
	'(anon)' type_id=23870
[140762] PTR '(anon)' type_id=140761
[140763] PTR '(anon)' type_id=140744
[140764] PTR '(anon)' type_id=140747
[140765] STRUCT 'mlx5_tun_entropy' size=56 vlen=5
	'mdev' type_id=139673 bits_offset=0
	'num_enabling_entries' type_id=21 bits_offset=64
	'num_disabling_entries' type_id=21 bits_offset=96
	'enabled' type_id=19 bits_offset=128
	'lock' type_id=155 bits_offset=192
[140766] STRUCT 'mlx5e_neigh_update_table' size=304 vlen=6
	'neigh_ht' type_id=1883 bits_offset=0
	'neigh_list' type_id=54 bits_offset=1088
	'encap_lock' type_id=155 bits_offset=1216
	'netevent_nb' type_id=1865 bits_offset=1472
	'neigh_stats_work' type_id=541 bits_offset=1664
	'min_interval' type_id=1 bits_offset=2368
[140767] STRUCT 'mlx5_rep_uplink_priv' size=264 vlen=16
	'tc_indr_block_priv_list' type_id=54 bits_offset=0
	'tun_entropy' type_id=140765 bits_offset=128
	'unready_flows_lock' type_id=155 bits_offset=576
	'unready_flows' type_id=54 bits_offset=832
	'reoffload_flows_work' type_id=540 bits_offset=960
	'tunnel_mapping' type_id=140165 bits_offset=1216
	'tunnel_enc_opts_mapping' type_id=140165 bits_offset=1280
	'post_act' type_id=140705 bits_offset=1344
	'ct_priv' type_id=140237 bits_offset=1408
	'tc_psample' type_id=140768 bits_offset=1472
	'bond' type_id=140769 bits_offset=1536
	'encap' type_id=140770 bits_offset=1600
	'int_port_priv' type_id=140771 bits_offset=1664
	'flow_meters' type_id=140238 bits_offset=1728
	'action_stats_handle' type_id=140772 bits_offset=1792
	'mpesw_work' type_id=540 bits_offset=1856
[140768] PTR '(anon)' type_id=143281
[140769] PTR '(anon)' type_id=145624
[140770] PTR '(anon)' type_id=141969
[140771] PTR '(anon)' type_id=145110
[140772] PTR '(anon)' type_id=143922
[140773] STRUCT 'mlx5e_rep_priv' size=968 vlen=11
	'rep' type_id=140153 bits_offset=0
	'neigh_update' type_id=140766 bits_offset=64
	'netdev' type_id=1996 bits_offset=2496
	'root_ft' type_id=139705 bits_offset=2560
	'vport_rx_rule' type_id=139707 bits_offset=2624
	'vport_sqs_list' type_id=54 bits_offset=2688
	'uplink_priv' type_id=140767 bits_offset=2816
	'prev_vf_vport_stats' type_id=7785 bits_offset=4928
	'send_to_vport_meta_rule' type_id=139707 bits_offset=6528
	'tc_ht' type_id=1883 bits_offset=6592
	'rep_vnic_reporter' type_id=25060 bits_offset=7680
[140774] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_ESW_IPSEC_RX_POL_FT_LEVEL' val=0
	'MLX5_ESW_IPSEC_RX_ESP_FT_LEVEL' val=1
	'MLX5_ESW_IPSEC_RX_ESP_FT_CHK_LEVEL' val=2
[140775] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_ESW_IPSEC_TX_POL_FT_LEVEL' val=0
	'MLX5_ESW_IPSEC_TX_ESP_FT_LEVEL' val=1
	'MLX5_ESW_IPSEC_TX_ESP_FT_CNT_LEVEL' val=2
[140776] PTR '(anon)' type_id=140773
[140777] PTR '(anon)' type_id=140753
[140778] PTR '(anon)' type_id=140750
[140779] STRUCT 'mlx5_ifc_per_protocol_networking_offload_caps_bits' size=2048 vlen=45
	'csum_cap' type_id=16161 bits_offset=0
	'vlan_cap' type_id=16161 bits_offset=8
	'lro_cap' type_id=16161 bits_offset=16
	'lro_psh_flag' type_id=16161 bits_offset=24
	'lro_time_stamp' type_id=16161 bits_offset=32
	'reserved_at_5' type_id=2689 bits_offset=40
	'wqe_vlan_insert' type_id=16161 bits_offset=56
	'self_lb_en_modifiable' type_id=16161 bits_offset=64
	'reserved_at_9' type_id=2689 bits_offset=72
	'max_lso_cap' type_id=4325 bits_offset=88
	'multi_pkt_send_wqe' type_id=2689 bits_offset=128
	'wqe_inline_mode' type_id=2689 bits_offset=144
	'rss_ind_tbl_cap' type_id=2120 bits_offset=160
	'reg_umr_sq' type_id=16161 bits_offset=192
	'scatter_fcs' type_id=16161 bits_offset=200
	'enhanced_multi_pkt_send_wqe' type_id=16161 bits_offset=208
	'tunnel_lso_const_out_ip_id' type_id=16161 bits_offset=216
	'tunnel_lro_gre' type_id=16161 bits_offset=224
	'tunnel_lro_vxlan' type_id=16161 bits_offset=232
	'tunnel_stateless_gre' type_id=16161 bits_offset=240
	'tunnel_stateless_vxlan' type_id=16161 bits_offset=248
	'swp' type_id=16161 bits_offset=256
	'swp_csum' type_id=16161 bits_offset=264
	'swp_lso' type_id=16161 bits_offset=272
	'cqe_checksum_full' type_id=16161 bits_offset=280
	'tunnel_stateless_geneve_tx' type_id=16161 bits_offset=288
	'tunnel_stateless_mpls_over_udp' type_id=16161 bits_offset=296
	'tunnel_stateless_mpls_over_gre' type_id=16161 bits_offset=304
	'tunnel_stateless_vxlan_gpe' type_id=16161 bits_offset=312
	'tunnel_stateless_ipv4_over_vxlan' type_id=16161 bits_offset=320
	'tunnel_stateless_ip_over_ip' type_id=16161 bits_offset=328
	'insert_trailer' type_id=16161 bits_offset=336
	'reserved_at_2b' type_id=16161 bits_offset=344
	'tunnel_stateless_ip_over_ip_rx' type_id=16161 bits_offset=352
	'tunnel_stateless_ip_over_ip_tx' type_id=16161 bits_offset=360
	'reserved_at_2e' type_id=2689 bits_offset=368
	'max_vxlan_udp_ports' type_id=7469 bits_offset=384
	'reserved_at_38' type_id=4362 bits_offset=448
	'max_geneve_opt_len' type_id=16161 bits_offset=496
	'tunnel_stateless_geneve_rx' type_id=16161 bits_offset=504
	'reserved_at_40' type_id=474 bits_offset=512
	'lro_min_mss_size' type_id=474 bits_offset=640
	'reserved_at_60' type_id=140780 bits_offset=768
	'lro_timer_supported_periods' type_id=13111 bits_offset=3072
	'reserved_at_200' type_id=140781 bits_offset=4096
[140780] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=288
[140781] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=1536
[140782] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=4
	'MLX5_IPSEC_ASO_REPLAY_WIN_32BIT' val=0
	'MLX5_IPSEC_ASO_REPLAY_WIN_64BIT' val=1
	'MLX5_IPSEC_ASO_REPLAY_WIN_128BIT' val=2
	'MLX5_IPSEC_ASO_REPLAY_WIN_256BIT' val=3
[140783] STRUCT 'mlx5e_tx_wqe_info' size=24 vlen=6
	'skb' type_id=1896 bits_offset=0
	'num_bytes' type_id=21 bits_offset=64
	'num_wqebbs' type_id=19 bits_offset=96
	'num_dma' type_id=19 bits_offset=104
	'num_fifo_pkts' type_id=19 bits_offset=112
	'resync_dump_frag_page' type_id=85 bits_offset=128
[140784] STRUCT 'mlx5e_xmit_data' size=24 vlen=4
	'dma_addr' type_id=3718 bits_offset=0
	'data' type_id=64 bits_offset=64
	'len' type_id=21 bits_offset=128 bitfield_size=31
	'has_frags' type_id=21 bits_offset=159 bitfield_size=1
[140785] STRUCT 'mlx5e_icosq_wqe_info' size=16 vlen=3
	'wqe_type' type_id=19 bits_offset=0
	'num_wqebbs' type_id=19 bits_offset=8
	'(anon)' type_id=140796 bits_offset=64
[140786] CONST '(anon)' type_id=140741
[140787] STRUCT 'mlx5e_ipsec_netevent_data' size=6 vlen=1
	'addr' type_id=4362 bits_offset=0
[140788] STRUCT 'mlx5_accel_pol_xfrm_attrs' size=56 vlen=9
	'saddr' type_id=140738 bits_offset=0
	'daddr' type_id=140738 bits_offset=128
	'upspec' type_id=140735 bits_offset=256
	'family' type_id=19 bits_offset=336
	'action' type_id=19 bits_offset=344
	'type' type_id=19 bits_offset=352 bitfield_size=2
	'dir' type_id=19 bits_offset=354 bitfield_size=2
	'reqid' type_id=21 bits_offset=384
	'prio' type_id=21 bits_offset=416
[140789] STRUCT 'mlx5e_ipsec_pol_entry' size=152 vlen=4
	'x' type_id=7895 bits_offset=0
	'ipsec' type_id=140025 bits_offset=64
	'ipsec_rule' type_id=140752 bits_offset=128
	'attrs' type_id=140788 bits_offset=768
[140790] STRUCT 'mlx5e_shampo_umr' size=2 vlen=1
	'len' type_id=20 bits_offset=0
[140791] STRUCT '(anon)' size=8 vlen=1
	'rq' type_id=139965 bits_offset=0
[140792] STRUCT '(anon)' size=8 vlen=1
	'priv_rx' type_id=140793 bits_offset=0
[140793] PTR '(anon)' type_id=143933
[140794] STRUCT '(anon)' size=8 vlen=1
	'buf' type_id=140795 bits_offset=0
[140795] PTR '(anon)' type_id=143934
[140796] UNION '(anon)' size=8 vlen=4
	'umr' type_id=140791 bits_offset=0
	'shampo' type_id=140790 bits_offset=0
	'tls_set_params' type_id=140792 bits_offset=0
	'tls_get_params' type_id=140794 bits_offset=0
[140797] PTR '(anon)' type_id=140786
[140798] PTR '(anon)' type_id=140789
[140799] PTR '(anon)' type_id=140788
[140800] PTR '(anon)' type_id=140752
[140801] PTR '(anon)' type_id=140741
[140802] PTR '(anon)' type_id=140787
[140803] PTR '(anon)' type_id=140734
[140804] ARRAY '(anon)' type_id=11601 index_type_id=13 nr_elems=4
[140805] CONST '(anon)' type_id=140804
[140806] ARRAY '(anon)' type_id=19 index_type_id=13 nr_elems=320
[140807] STRUCT 'mlx5dr_match_parameters' size=16 vlen=2
	'match_sz' type_id=45 bits_offset=0
	'match_buf' type_id=1473 bits_offset=64
[140808] STRUCT 'mlx5dr_rule' size=80 vlen=6
	'matcher' type_id=140322 bits_offset=0
	'rx' type_id=140396 bits_offset=64
	'tx' type_id=140396 bits_offset=192
	'rule_actions_list' type_id=54 bits_offset=320
	'dbg_node' type_id=54 bits_offset=448
	'flow_source' type_id=21 bits_offset=576
[140809] PTR '(anon)' type_id=140808
[140810] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=1
	'MLX5DR_STE_LU_TYPE_DONT_CARE' val=15
[140811] ENUM 'mlx5dr_matcher_criteria' encoding=UNSIGNED size=4 vlen=9
	'DR_MATCHER_CRITERIA_EMPTY' val=0
	'DR_MATCHER_CRITERIA_OUTER' val=1
	'DR_MATCHER_CRITERIA_MISC' val=2
	'DR_MATCHER_CRITERIA_INNER' val=4
	'DR_MATCHER_CRITERIA_MISC2' val=8
	'DR_MATCHER_CRITERIA_MISC3' val=16
	'DR_MATCHER_CRITERIA_MISC4' val=32
	'DR_MATCHER_CRITERIA_MISC5' val=64
	'DR_MATCHER_CRITERIA_MAX' val=128
[140812] STRUCT 'mlx5dr_ste_send_info' size=104 vlen=6
	'ste' type_id=140381 bits_offset=0
	'send_list' type_id=54 bits_offset=64
	'size' type_id=20 bits_offset=192
	'offset' type_id=20 bits_offset=208
	'data_cont' type_id=1843 bits_offset=224
	'data' type_id=2241 bits_offset=768
[140813] STRUCT 'mlx5dr_rule_action_member' size=24 vlen=2
	'action' type_id=140317 bits_offset=0
	'list' type_id=54 bits_offset=64
[140814] ENUM 'mlx5dr_connect_type' encoding=UNSIGNED size=4 vlen=2
	'CONNECT_HIT' val=1
	'CONNECT_MISS' val=2
[140815] UNION '(anon)' size=8 vlen=2
	'hit_next_htbl' type_id=140395 bits_offset=0
	'miss_icm_addr' type_id=23 bits_offset=0
[140816] STRUCT 'mlx5dr_htbl_connect_info' size=16 vlen=2
	'type' type_id=140814 bits_offset=0
	'(anon)' type_id=140815 bits_offset=64
[140817] PTR '(anon)' type_id=140816
[140818] PTR '(anon)' type_id=140812
[140819] PTR '(anon)' type_id=140807
[140820] PTR '(anon)' type_id=140414
[140821] PTR '(anon)' type_id=140395
[140822] ARRAY '(anon)' type_id=140818 index_type_id=13 nr_elems=5
[140823] PTR '(anon)' type_id=140398
[140824] ARRAY '(anon)' type_id=140381 index_type_id=13 nr_elems=23
[140825] PTR '(anon)' type_id=140381
[140826] PTR '(anon)' type_id=140813
[140827] ENUM '(anon)' encoding=UNSIGNED size=4 vlen=3
	'MLX5_STEERING_FORMAT_CONNECTX_5' val=0
	'MLX5_STEERING_FORMAT_CONNECTX_6DX' val=1
	'MLX5_STEERING_FORMAT_CONNECTX_7' val=2
[140828] ENUM 'dr_dump_rec_type' encoding=UNSIGNED size=4 vlen=38
	'DR_DUMP_REC_TYPE_DOMAIN' val=3000
	'DR_DUMP_REC_TYPE_DOMAIN_INFO_FLEX_PARSER' val=3001
	'DR_DUMP_REC_TYPE_DOMAIN_INFO_DEV_ATTR' val=3002
	'DR_DUMP_REC_TYPE_DOMAIN_INFO_VPORT' val=3003
	'DR_DUMP_REC_TYPE_DOMAIN_INFO_CAPS' val=3004
	'DR_DUMP_REC_TYPE_DOMAIN_SEND_RING' val=3005
	'DR_DUMP_REC_TYPE_TABLE' val=3100
	'DR_DUMP_REC_TYPE_TABLE_RX' val=3101
	'DR_DUMP_REC_TYPE_TABLE_TX' val=3102
	'DR_DUMP_REC_TYPE_MATCHER' val=3200
	'DR_DUMP_REC_TYPE_MATCHER_MASK_DEPRECATED' val=3201
	'DR_DUMP_REC_TYPE_MATCHER_RX' val=3202
	'DR_DUMP_REC_TYPE_MATCHER_TX' val=3203
	'DR_DUMP_REC_TYPE_MATCHER_BUILDER' val=3204
	'DR_DUMP_REC_TYPE_MATCHER_MASK' val=3205
	'DR_DUMP_REC_TYPE_RULE' val=3300
	'DR_DUMP_REC_TYPE_RULE_RX_ENTRY_V0' val=3301
	'DR_DUMP_REC_TYPE_RULE_TX_ENTRY_V0' val=3302
	'DR_DUMP_REC_TYPE_RULE_RX_ENTRY_V1' val=3303
	'DR_DUMP_REC_TYPE_RULE_TX_ENTRY_V1' val=3304
	'DR_DUMP_REC_TYPE_ACTION_ENCAP_L2' val=3400
	'DR_DUMP_REC_TYPE_ACTION_ENCAP_L3' val=3401
	'DR_DUMP_REC_TYPE_ACTION_MODIFY_HDR' val=3402
	'DR_DUMP_REC_TYPE_ACTION_DROP' val=3403
	'DR_DUMP_REC_TYPE_ACTION_QP' val=3404
	'DR_DUMP_REC_TYPE_ACTION_FT' val=3405
	'DR_DUMP_REC_TYPE_ACTION_CTR' val=3406
	'DR_DUMP_REC_TYPE_ACTION_TAG' val=3407
	'DR_DUMP_REC_TYPE_ACTION_VPORT' val=3408
	'DR_DUMP_REC_TYPE_ACTION_DECAP_L2' val=3409
	'DR_DUMP_REC_TYPE_ACTION_DECAP_L3' val=3410
	'DR_DUMP_REC_TYPE_ACTION_DEVX_TIR' val=3411
	'DR_DUMP_REC_TYPE_ACTION_PUSH_VLAN' val=3412
	'DR_DUMP_REC_TYPE_ACTION_POP_VLAN' val=3413
	'DR_DUMP_REC_TYPE_ACTION_SAMPLER' val=3415
	'DR_DUMP_REC_TYPE_ACTION_INSERT_HDR' val=3420
	'DR_DUMP_REC_TYPE_ACTION_REMOVE_HDR' val=3421
	'DR_DUMP_REC_TYPE_ACTION_MATCH_RANGE' val=3425
[140829] PTR '(anon)' type_id=140426
[140830] ARRAY '(anon)' type_id=5 index_type_id=13 nr_elems=18561
[140831] CONST '(anon)' type_id=140830
[140832] FUNC_PROTO '(anon)' ret_type_id=64 vlen=5
	'ht' type_id=1884
	'key' type_id=388
	'obj' type_id=877
	'params' type_id=23380
	'rhlist' type_id=42
[140833] FUNC '__rhashtable_insert_fast' type_id=140832 linkage=static
[140834] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'ht' type_id=1884
	'tbl' type_id=1894
	'obj' type_id=877
	'params' type_id=23380
	'rhlist' type_id=42
[140835] FUNC '__rhashtable_remove_fast_one' type_id=140834 linkage=static
[140836] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'dev' type_id=139673
	'eq' type_id=140572
	'name' type_id=2
[140837] FUNC 'cleanup_async_eq' type_id=140836 linkage=static
[140838] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'dev' type_id=139673
	'vecidx' type_id=20
[140839] FUNC 'comp_irq_release_sf' type_id=140838 linkage=static
[140840] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'dev' type_id=139673
	'vecidx' type_id=20
[140841] FUNC 'comp_irq_request_pci' type_id=140840 linkage=static
[140842] FUNC 'comp_irq_request_sf' type_id=140840 linkage=static
[140843] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'nb' type_id=1864
	'type' type_id=1
	'data' type_id=64
[140844] FUNC 'cq_err_event_notifier' type_id=140843 linkage=static
[140845] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'dev' type_id=139673
	'eq' type_id=140568
	'param' type_id=140571
[140846] FUNC 'create_map_eq' type_id=140845 linkage=static
[140847] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'fs' type_id=140016
	'eth_rule' type_id=140620
[140848] FUNC 'del_ethtool_rule' type_id=140847 linkage=static
[140849] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'dev' type_id=139673
[140850] FUNC 'destroy_async_eqs' type_id=140849 linkage=static
[140851] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'dev' type_id=139673
	'eq' type_id=140568
[140852] FUNC 'destroy_unmap_eq' type_id=140851 linkage=static
[140853] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'file' type_id=676
	'mask' type_id=140405
	'criteria' type_id=19
	'matcher_id' type_id=2961
[140854] FUNC 'dr_dump_matcher_mask' type_id=140853 linkage=static
[140855] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'file' type_id=676
	'is_rx' type_id=42
	'matcher_rx_tx' type_id=140469
	'matcher_id' type_id=2961
[140856] FUNC 'dr_dump_matcher_rx_tx' type_id=140855 linkage=static
[140857] FUNC 'dr_dump_open' type_id=36679 linkage=static
[140858] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'file' type_id=676
	'ste' type_id=140381
	'is_rx' type_id=42
	'rule_id' type_id=2961
	'format_ver' type_id=19
[140859] FUNC 'dr_dump_rule_mem' type_id=140858 linkage=static
[140860] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'file' type_id=676
	'priv' type_id=64
[140861] FUNC 'dr_dump_show' type_id=140860 linkage=static
[140862] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'dmn' type_id=140320
	'nic_type' type_id=140424
	'new_last_ste' type_id=140381
	'miss_list' type_id=55
	'send_list' type_id=55
[140863] FUNC 'dr_rule_append_to_miss_list' type_id=140862 linkage=static
[140864] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'rule' type_id=140809
	'nic_rule' type_id=140397
[140865] FUNC 'dr_rule_clean_rule_members' type_id=140864 linkage=static
[140866] FUNC_PROTO '(anon)' ret_type_id=140381 vlen=3
	'matcher' type_id=140322
	'nic_matcher' type_id=140469
	'hw_ste' type_id=2241
[140867] FUNC 'dr_rule_create_collision_htbl' type_id=140866 linkage=static
[140868] FUNC_PROTO '(anon)' ret_type_id=140809 vlen=5
	'matcher' type_id=140322
	'value' type_id=140819
	'num_actions' type_id=45
	'actions' type_id=140382
	'flow_source' type_id=21
[140869] FUNC 'dr_rule_create_rule' type_id=140868 linkage=static
[140870] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'rule' type_id=140809
	'param' type_id=140405
	'num_actions' type_id=45
	'actions' type_id=140382
[140871] FUNC 'dr_rule_create_rule_fdb' type_id=140870 linkage=static
[140872] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'rule' type_id=140809
	'nic_rule' type_id=140397
	'param' type_id=140405
	'num_actions' type_id=45
	'actions' type_id=140382
[140873] FUNC 'dr_rule_create_rule_nic' type_id=140872 linkage=static
[140874] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'rule' type_id=140809
	'nic_rule' type_id=140397
[140875] FUNC 'dr_rule_destroy_rule_nic' type_id=140874 linkage=static
[140876] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'ste_info' type_id=140818
	'dmn' type_id=140320
[140877] FUNC 'dr_rule_handle_one_ste_in_update_list' type_id=140876 linkage=static
[140878] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'rule' type_id=140809
[140879] FUNC 'dr_rule_remove_action_members' type_id=140878 linkage=static
[140880] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'send_ste_list' type_id=55
	'dmn' type_id=140320
	'is_reverse' type_id=42
[140881] FUNC 'dr_rule_send_update_list' type_id=140880 linkage=static
[140882] FUNC 'mlx5_cmd_eq_recover' type_id=140849 linkage=static
[140883] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'dev' type_id=139673
	'vecidx' type_id=20
	'eqn' type_id=87
[140884] FUNC 'mlx5_comp_eqn_get' type_id=140883 linkage=static
[140885] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'dev' type_id=139673
	'vector' type_id=13
	'irqn' type_id=433
[140886] FUNC 'mlx5_comp_irqn_get' type_id=140885 linkage=static
[140887] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'dev' type_id=139673
	'vector' type_id=13
[140888] FUNC 'mlx5_comp_vector_get_cpu' type_id=140887 linkage=static
[140889] FUNC_PROTO '(anon)' ret_type_id=6 vlen=1
	'dev' type_id=139673
[140890] FUNC 'mlx5_comp_vectors_max' type_id=140889 linkage=static
[140891] FUNC 'mlx5_core_eq_free_irqs' type_id=140849 linkage=static
[140892] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'dev' type_id=139673
[140893] FUNC 'mlx5_core_is_eth_enabled' type_id=140892 linkage=static
[140894] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'numa_node' type_id=13
	'index' type_id=13
[140895] FUNC 'mlx5_cpumask_default_spread' type_id=140894 linkage=static
[140896] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'esw' type_id=139720
	'e' type_id=140633
[140897] FUNC 'mlx5_create_indir_fwd_group' type_id=140896 linkage=static
[140898] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'devcom' type_id=139723
[140899] FUNC 'mlx5_devcom_comp_get_size' type_id=140898 linkage=static
[140900] FUNC_PROTO '(anon)' ret_type_id=42 vlen=1
	'devcom' type_id=139723
[140901] FUNC 'mlx5_devcom_comp_is_ready' type_id=140900 linkage=static
[140902] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'devcom' type_id=139723
[140903] FUNC 'mlx5_devcom_comp_lock' type_id=140902 linkage=static
[140904] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'devcom' type_id=139723
	'ready' type_id=42
[140905] FUNC 'mlx5_devcom_comp_set_ready' type_id=140904 linkage=static
[140906] FUNC 'mlx5_devcom_comp_trylock' type_id=140898 linkage=static
[140907] FUNC 'mlx5_devcom_comp_unlock' type_id=140902 linkage=static
[140908] FUNC 'mlx5_devcom_for_each_peer_begin' type_id=140900 linkage=static
[140909] FUNC 'mlx5_devcom_for_each_peer_end' type_id=140902 linkage=static
[140910] FUNC_PROTO '(anon)' ret_type_id=64 vlen=2
	'devcom' type_id=139723
	'pos' type_id=140365
[140911] FUNC 'mlx5_devcom_get_next_peer_data' type_id=140910 linkage=static
[140912] FUNC 'mlx5_devcom_get_next_peer_data_rcu' type_id=140910 linkage=static
[140913] FUNC_PROTO '(anon)' ret_type_id=139723 vlen=5
	'devc' type_id=139722
	'id' type_id=140579
	'key' type_id=23
	'handler' type_id=140580
	'data' type_id=64
[140914] FUNC 'mlx5_devcom_register_component' type_id=140913 linkage=static
[140915] FUNC_PROTO '(anon)' ret_type_id=139722 vlen=1
	'dev' type_id=139673
[140916] FUNC 'mlx5_devcom_register_device' type_id=140915 linkage=static
[140917] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'devcom' type_id=139723
	'event' type_id=13
	'rollback_event' type_id=13
	'event_data' type_id=64
[140918] FUNC 'mlx5_devcom_send_event' type_id=140917 linkage=static
[140919] FUNC 'mlx5_devcom_unregister_component' type_id=140902 linkage=static
[140920] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'devc' type_id=139722
[140921] FUNC 'mlx5_devcom_unregister_device' type_id=140920 linkage=static
[140922] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'eq' type_id=140568
	'cq' type_id=139844
[140923] FUNC 'mlx5_eq_add_cq' type_id=140922 linkage=static
[140924] FUNC 'mlx5_eq_async_int' type_id=41362 linkage=static
[140925] FUNC 'mlx5_eq_comp_int' type_id=41362 linkage=static
[140926] FUNC_PROTO '(anon)' ret_type_id=139844 vlen=2
	'eq' type_id=140568
	'cqn' type_id=21
[140927] FUNC 'mlx5_eq_cq_get' type_id=140926 linkage=static
[140928] FUNC_PROTO '(anon)' ret_type_id=140568 vlen=2
	'dev' type_id=139673
	'param' type_id=140571
[140929] FUNC 'mlx5_eq_create_generic' type_id=140928 linkage=static
[140930] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'eq' type_id=140568
	'cq' type_id=139844
[140931] FUNC 'mlx5_eq_del_cq' type_id=140930 linkage=static
[140932] FUNC 'mlx5_eq_destroy_generic' type_id=140851 linkage=static
[140933] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'dev' type_id=139673
	'eq' type_id=140568
	'nb' type_id=1864
[140934] FUNC 'mlx5_eq_disable' type_id=140933 linkage=static
[140935] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'dev' type_id=139673
	'eq' type_id=140568
	'nb' type_id=1864
[140936] FUNC 'mlx5_eq_enable' type_id=140935 linkage=static
[140937] FUNC_PROTO '(anon)' ret_type_id=139846 vlen=2
	'eq' type_id=140568
	'cc' type_id=21
[140938] FUNC 'mlx5_eq_get_eqe' type_id=140937 linkage=static
[140939] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'dev' type_id=139673
	'nb' type_id=140570
[140940] FUNC 'mlx5_eq_notifier_register' type_id=140939 linkage=static
[140941] FUNC 'mlx5_eq_notifier_unregister' type_id=140939 linkage=static
[140942] FUNC_PROTO '(anon)' ret_type_id=21 vlen=1
	'eq' type_id=139850
[140943] FUNC 'mlx5_eq_poll_irq_disabled' type_id=140942 linkage=static
[140944] FUNC 'mlx5_eq_synchronize_async_irq' type_id=140849 linkage=static
[140945] FUNC 'mlx5_eq_synchronize_cmd_irq' type_id=140849 linkage=static
[140946] FUNC 'mlx5_eq_table_cleanup' type_id=140849 linkage=static
[140947] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'dev' type_id=139673
[140948] FUNC 'mlx5_eq_table_create' type_id=140947 linkage=static
[140949] FUNC 'mlx5_eq_table_destroy' type_id=140849 linkage=static
[140950] FUNC_PROTO '(anon)' ret_type_id=8126 vlen=1
	'dev' type_id=139673
[140951] FUNC 'mlx5_eq_table_get_rmap' type_id=140950 linkage=static
[140952] FUNC 'mlx5_eq_table_init' type_id=140947 linkage=static
[140953] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'eq' type_id=140568
	'cc' type_id=21
	'arm' type_id=42
[140954] FUNC 'mlx5_eq_update_ci' type_id=140953 linkage=static
[140955] FUNC_PROTO '(anon)' ret_type_id=139850 vlen=2
	'dev' type_id=139673
	'eqn' type_id=13
[140956] FUNC 'mlx5_eqn2comp_eq' type_id=140955 linkage=static
[140957] FUNC_PROTO '(anon)' ret_type_id=20 vlen=1
	'attr' type_id=140259
[140958] FUNC 'mlx5_esw_indir_table_decap_vport' type_id=140957 linkage=static
[140959] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'indir' type_id=140173
[140960] FUNC 'mlx5_esw_indir_table_destroy' type_id=140959 linkage=static
[140961] FUNC_PROTO '(anon)' ret_type_id=139705 vlen=4
	'esw' type_id=139720
	'attr' type_id=140259
	'vport' type_id=20
	'decap' type_id=42
[140962] FUNC 'mlx5_esw_indir_table_get' type_id=140961 linkage=static
[140963] FUNC_PROTO '(anon)' ret_type_id=140173 vlen=0
[140964] FUNC 'mlx5_esw_indir_table_init' type_id=140963 linkage=static
[140965] FUNC_PROTO '(anon)' ret_type_id=42 vlen=4
	'esw' type_id=139720
	'attr' type_id=140259
	'vport_num' type_id=20
	'dest_mdev' type_id=139673
[140966] FUNC 'mlx5_esw_indir_table_needed' type_id=140965 linkage=static
[140967] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'esw' type_id=139720
	'vport' type_id=20
	'decap' type_id=42
[140968] FUNC 'mlx5_esw_indir_table_put' type_id=140967 linkage=static
[140969] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'esw' type_id=139720
	'attr' type_id=140259
	'e' type_id=140633
[140970] FUNC 'mlx5_esw_indir_table_rule_get' type_id=140969 linkage=static
[140971] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'esw' type_id=139720
	'e' type_id=140633
[140972] FUNC 'mlx5_esw_indir_table_rule_put' type_id=140971 linkage=static
[140973] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'mdev' type_id=139673
[140974] FUNC 'mlx5_esw_ipsec_restore_dest_uplink' type_id=140973 linkage=static
[140975] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'ipsec' type_id=140025
	'attr' type_id=140778
[140976] FUNC 'mlx5_esw_ipsec_rx_create_attr_set' type_id=140975 linkage=static
[140977] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'sa_entry' type_id=140746
[140978] FUNC 'mlx5_esw_ipsec_rx_id_mapping_remove' type_id=140977 linkage=static
[140979] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'priv' type_id=139858
	'id' type_id=21
	'ipsec_obj_id' type_id=96
[140980] FUNC 'mlx5_esw_ipsec_rx_ipsec_obj_id_search' type_id=140979 linkage=static
[140981] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'sa_entry' type_id=140746
	'flow_act' type_id=140100
[140982] FUNC 'mlx5_esw_ipsec_rx_setup_modify_header' type_id=140981 linkage=static
[140983] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'ipsec' type_id=140025
	'dest' type_id=140098
[140984] FUNC 'mlx5_esw_ipsec_rx_status_pass_dest_get' type_id=140983 linkage=static
[140985] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'ipsec' type_id=140025
	'attr' type_id=140777
[140986] FUNC 'mlx5_esw_ipsec_tx_create_attr_set' type_id=140985 linkage=static
[140987] FUNC_PROTO '(anon)' ret_type_id=140568 vlen=1
	'dev' type_id=139673
[140988] FUNC 'mlx5_get_async_eq' type_id=140987 linkage=static
[140989] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'ct_priv' type_id=140237
	'labels' type_id=96
	'id' type_id=96
[140990] FUNC 'mlx5_get_label_mapping' type_id=140989 linkage=static
[140991] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'spec' type_id=140109
[140992] FUNC 'mlx5_tc_ct_add_no_trk_match' type_id=140991 linkage=static
[140993] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'ct_ft' type_id=140226
	'pre_ct' type_id=140726
	'nat' type_id=42
[140994] FUNC 'mlx5_tc_ct_alloc_pre_ct' type_id=140993 linkage=static
[140995] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'type' type_id=7876
	'type_data' type_id=64
	'cb_priv' type_id=64
[140996] FUNC 'mlx5_tc_ct_block_flow_offload' type_id=140995 linkage=static
[140997] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'ct_priv' type_id=140237
[140998] FUNC 'mlx5_tc_ct_clean' type_id=140997 linkage=static
[140999] FUNC_PROTO '(anon)' ret_type_id=140722 vlen=1
	'ct_priv' type_id=140237
[141000] FUNC 'mlx5_tc_ct_counter_create' type_id=140999 linkage=static
[141001] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'ct_priv' type_id=140237
	'entry' type_id=140724
[141002] FUNC 'mlx5_tc_ct_counter_put' type_id=141001 linkage=static
[141003] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'ct_priv' type_id=140237
	'ft' type_id=140226
[141004] FUNC 'mlx5_tc_ct_del_ft_cb' type_id=141003 linkage=static
[141005] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'priv' type_id=140237
	'attr' type_id=140259
[141006] FUNC 'mlx5_tc_ct_delete_flow' type_id=141005 linkage=static
[141007] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'ct_priv' type_id=140237
	'flow_rule' type_id=20598
	'entry' type_id=140724
	'nat' type_id=42
	'zone_restore_id' type_id=19
[141008] FUNC 'mlx5_tc_ct_entry_add_rule' type_id=141007 linkage=static
[141009] FUNC_PROTO '(anon)' ret_type_id=13 vlen=7
	'ct_priv' type_id=140237
	'attr' type_id=140259
	'flow_rule' type_id=20598
	'mh' type_id=140730
	'zone_restore_id' type_id=19
	'nat_table' type_id=42
	'has_nat' type_id=42
[141010] FUNC 'mlx5_tc_ct_entry_create_mod_hdr' type_id=141009 linkage=static
[141011] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'entry' type_id=140724
[141012] FUNC 'mlx5_tc_ct_entry_del' type_id=141011 linkage=static
[141013] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'ct_priv' type_id=140237
	'entry' type_id=140724
	'nat' type_id=42
[141014] FUNC 'mlx5_tc_ct_entry_del_rule' type_id=141013 linkage=static
[141015] FUNC 'mlx5_tc_ct_entry_del_work' type_id=35555 linkage=static
[141016] FUNC_PROTO '(anon)' ret_type_id=140724 vlen=2
	'ct_priv' type_id=140237
	'tuple' type_id=140728
[141017] FUNC 'mlx5_tc_ct_entry_get' type_id=141016 linkage=static
[141018] FUNC 'mlx5_tc_ct_entry_put' type_id=141011 linkage=static
[141019] FUNC 'mlx5_tc_ct_entry_replace_rule' type_id=141007 linkage=static
[141020] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'priv' type_id=140237
	'attr' type_id=140259
[141021] FUNC 'mlx5_tc_ct_flow_offload' type_id=141020 linkage=static
[141022] FUNC 'mlx5_tc_ct_flush_ft_entry' type_id=105903 linkage=static
[141023] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'ct_priv' type_id=140237
	'ndev' type_id=1996
[141024] FUNC 'mlx5_tc_ct_get_flow_source_match' type_id=141023 linkage=static
[141025] FUNC_PROTO '(anon)' ret_type_id=140237 vlen=5
	'priv' type_id=139858
	'chains' type_id=140172
	'mod_hdr' type_id=140711
	'ns_type' type_id=140222
	'post_act' type_id=140705
[141026] FUNC 'mlx5_tc_ct_init' type_id=141025 linkage=static
[141027] FUNC_PROTO '(anon)' ret_type_id=13 vlen=5
	'priv' type_id=140237
	'spec' type_id=140109
	'f' type_id=20614
	'ct_attr' type_id=140727
	'extack' type_id=7783
[141028] FUNC 'mlx5_tc_ct_match_add' type_id=141027 linkage=static
[141029] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'priv' type_id=140237
	'ct_attr' type_id=140727
[141030] FUNC 'mlx5_tc_ct_match_del' type_id=141029 linkage=static
[141031] FUNC_PROTO '(anon)' ret_type_id=13 vlen=4
	'priv' type_id=140237
	'attr' type_id=140259
	'act' type_id=140270
	'extack' type_id=7783
[141032] FUNC 'mlx5_tc_ct_parse_action' type_id=141031 linkage=static
[141033] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'ct_priv' type_id=140237
	'spec' type_id=140109
	'rule' type_id=20598
[141034] FUNC 'mlx5_tc_ct_set_tuple_match' type_id=141033 linkage=static
[141035] FUNC_PROTO '(anon)' ret_type_id=42 vlen=3
	'skb' type_id=1896
	'tuple' type_id=140728
	'zone' type_id=20
[141036] FUNC 'mlx5_tc_ct_skb_to_tuple' type_id=141035 linkage=static
[141037] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'dmn' type_id=140320
[141038] FUNC 'mlx5dr_dbg_init_dump' type_id=141037 linkage=static
[141039] FUNC 'mlx5dr_dbg_rule_add' type_id=140878 linkage=static
[141040] FUNC 'mlx5dr_dbg_rule_del' type_id=140878 linkage=static
[141041] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'tbl' type_id=140324
[141042] FUNC 'mlx5dr_dbg_tbl_add' type_id=141041 linkage=static
[141043] FUNC 'mlx5dr_dbg_tbl_del' type_id=141041 linkage=static
[141044] FUNC 'mlx5dr_dbg_uninit_dump' type_id=141037 linkage=static
[141045] FUNC 'mlx5dr_rule_create' type_id=140868 linkage=static
[141046] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'rule' type_id=140809
[141047] FUNC 'mlx5dr_rule_destroy' type_id=141046 linkage=static
[141048] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'ste_arr' type_id=140825
	'curr_ste' type_id=140381
	'num_of_stes' type_id=87
[141049] FUNC 'mlx5dr_rule_get_reverse_rule_members' type_id=141048 linkage=static
[141050] FUNC_PROTO '(anon)' ret_type_id=0 vlen=3
	'nic_rule' type_id=140397
	'ste' type_id=140381
	'force' type_id=42
[141051] FUNC 'mlx5dr_rule_set_last_member' type_id=141050 linkage=static
[141052] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'ethtool' type_id=140621
[141053] FUNC 'mlx5e_ethtool_alloc' type_id=141052 linkage=static
[141054] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'fs' type_id=140016
[141055] FUNC 'mlx5e_ethtool_cleanup_steering' type_id=141054 linkage=static
[141056] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'ethtool' type_id=140619
[141057] FUNC 'mlx5e_ethtool_free' type_id=141056 linkage=static
[141058] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'priv' type_id=139858
	'info' type_id=12198
	'rule_locs' type_id=96
[141059] FUNC 'mlx5e_ethtool_get_rxnfc' type_id=141058 linkage=static
[141060] FUNC 'mlx5e_ethtool_init_steering' type_id=141054 linkage=static
[141061] FUNC_PROTO '(anon)' ret_type_id=13 vlen=2
	'priv' type_id=139858
	'cmd' type_id=12198
[141062] FUNC 'mlx5e_ethtool_set_rxnfc' type_id=141061 linkage=static
[141063] FUNC_PROTO '(anon)' ret_type_id=0 vlen=2
	'sa_entry' type_id=140746
	'attrs' type_id=140801
[141064] FUNC 'mlx5e_ipsec_build_accel_xfrm_attrs' type_id=141063 linkage=static
[141065] FUNC_PROTO '(anon)' ret_type_id=0 vlen=1
	'priv' type_id=139858
[141066] FUNC 'mlx5e_ipsec_build_netdev' type_id=141065 linkage=static
[141067] FUNC 'mlx5e_ipsec_cleanup' type_id=141065 linkage=static
[141068] FUNC 'mlx5e_ipsec_handle_netdev_event' type_id=101909 linkage=static
[141069] FUNC 'mlx5e_ipsec_handle_sw_limits' type_id=101909 linkage=static
[141070] FUNC 'mlx5e_ipsec_init' type_id=141065 linkage=static
[141071] FUNC 'mlx5e_ipsec_modify_state' type_id=101909 linkage=static
[141072] FUNC 'mlx5e_ipsec_netevent_event' type_id=80255 linkage=static
[141073] FUNC 'mlx5e_ipsec_offload_ok' type_id=88656 linkage=static
[141074] FUNC 'mlx5e_monitor_counter_cleanup' type_id=141065 linkage=static
[141075] FUNC 'mlx5e_monitor_counter_init' type_id=141065 linkage=static
[141076] FUNC_PROTO '(anon)' ret_type_id=13 vlen=1
	'priv' type_id=139858
[141077] FUNC 'mlx5e_monitor_counter_supported' type_id=141076 linkage=static
[141078] FUNC 'mlx5e_monitor_counters_work' type_id=35555 linkage=static
[141079] FUNC_PROTO '(anon)' ret_type_id=13 vlen=3
	'nb' type_id=1864
	'event' type_id=1
	'eqe' type_id=64
